{
  "Add MS 12273": {
    "title": "Sĕrat Rama",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181063592.0x000001",
    "scope": "Sĕrat Rama , incomplete. The leaves have Javanese numerals up to 169, but there are some gaps suggesting the leaves are out of order and some are missing. In Javanese language and script.",
    "physical": "Dimensions: 40 x 510 mm.161 ff.; palm leaves; 4 lines of text per page. F.1 comprises two leaves sewn together with red thread through the three holes, and has two lines of text. Many of the leaves are damaged.Covers: two wooden covers, each with five smooth outer sides covered with black laquer, abraded along ridges, and an inner unpainted side; gilded floral ornaments surround the three string holes.The MS is currently strung with a modern string through the centre hole, and has three plexiglass plates at beginning, middle and end of the manuscript; some leaves have been strung the wrong way round."
  },
  "Add MS 12274": {
    "title": "Arjunawiwāha Kakawin",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181063710.0x000001",
    "scope": "Arjunawiwāha Kakawin In Old Javanese language and Balinese script.",
    "physical": "Dimensions: 35 x 335 mm.59 ff. (including 11 blank folios); palm leaves; 4 lines of text per page, some pages unblackened.Some leaves (ff. 30, 42) have original threads tied (as bookmarks?) through one of the end holes.The MS is current strung through the centre hole; some leaves may currently be out of order. Covers: two plain brown wooden covers, rounded and varnished on the outer side. 3 holes."
  },
  "Add MS 12275": {
    "title": "Raden (Ardi) Kusuma romance",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348025.0x000001",
    "scope": "Raden (Ardi) Kusuma romance. In Javanese language and script.",
    "physical": "Dimensions: 35 x 380 mm.86 ff.; palm leaves; 4 lines per page, written across the leaf. Some leaves are rather soiled and damaged; eg. f. 48, which has remnants of original thread which may signify an old repair.Decoration: the first page, with two lines of text, is set within a decorated frame.This MS is currently unstrung; some leaves may be out of order.Covers: two plain wooden covers, outer sides rounded and varnished brown; three holes."
  },
  "Add MS 12276": {
    "title": "Rāmāyana Kakawin",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181063809.0x000001",
    "scope": "Rāmāyana Kakawin , sarga 24. In Old Javanese language and Balinese script.",
    "physical": "Dimensions: 35 x 230 mm.24 ff.; palm leaves, folded with ridged tops; 4 lines of text per page; three holes (two holes at each end, and another hole in the top left corner).This manuscript is currently unstrung.Two wooden covers, with finely carved outer sides, and floral ornaments around the three holes placed at each end and in the centre (i.e. which do not match the pattern of holes on the leaves)."
  },
  "Add MS 12277": {
    "title": "Kutāra Mānawa",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181063838.0x000001",
    "scope": "Kutāra Mānawa , law book. Inscribed on the inside cover: 'Cuntara Manawa Sastra, a paraphrase of the Institutes of Menu, in the Kawi or ancient Javanese language. Presented to J. Crawfurd, Esq., by the Rajah of Blilling [Buleleng, in Bali], 1814.' According to Jonker, 1885, pp. 32 et seqq., the text is almost the same as that in Leiden Or 2215. Cf. Add. MS 12336, and Add. MS 12321. In Old (or Middle) Javanese language and Balinese script.",
    "physical": "Dimensions: 35 x 280 mm. 63 ff.; palm leaves, folded along the spine ( embat-embatan ); 4 lines of text per page; three holes (two at each end and and one at the top left corner). Currently strung through the top left hole. Covers: two wooden covers, finely carved with floral decorations, two of these around the holes at each end."
  },
  "Add MS 12278": {
    "title": "Rāmāyana",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181063874.0x000001",
    "scope": "Rāmāyana. Annotated: 'Ramayana, according to the Javanese paraphrase, in the Kawi or ancient character. This MS was given to J. Crawfurd by the Rajah of Blilling [Buleleng], in the island of Bali'. The text starts with canto 19: Tatkālanyān inājñan sahana-hana nika ng rākṣasomətva ri ng prang, tinyup ta ng sangka śangkyānya inatusātus koṭi lakṣa parārdhya, śabdanyātyughra mapyak prakaṭa kadi gəlap sapta pātāla molah, lyab ta ng rāt bhūr-bhuvah-svah kadi ta yá sivakāng aṇḍa koṇḍākya kāṇḍək. (Identification and reading by Arlo Giffiths, 2023.) In Old (or Middle) Javanese language and Balinese script.",
    "physical": "Dimensions: 35 x 275 mm. 27 ff.; palm leaves, folded along the spine (of the type called embat-embatan ); 4 lines of text per page; three holes (two and each end and one in the corner by the fold). This MS is currently unstrung. Covers: two finely carved wooden covers, with floral decorations around three holes (which do not correspond with the holes on the leaves)."
  },
  "Add MS 12279": {
    "title": "Bhāratayuddha",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12279",
    "scope": "Bhāratayuddha . The beginning of the volume is Old Javanese text, each line followed by a word-for-word explanation in Modern Javanese. On f. 146r, a second section begins, ing andap punika pratelanipun ing lapal kimawon tanpa makna , and is Old Javanese only. A romanised Malay note inside the cover says the MS was owned by Crawfurd. Copyist ( ingkang s ĕrat ) is given as pun Sastrwijaya, and the MS is dated (A.J.) 1741, (A.D.) 1814. In Old Javanese and Javanese language, and Javanese script. In verse; 27 cantos.",
    "physical": "Dimensions: 220 x 175 mm. 178 folios; English paper, watermarked '1808' (cf. f. 9). 15 lines per page, brown ink. Binding: original black full leather binding with stamped frame bands and small palmette motifs, with ruled central vertical and horizonal lines, and dluwang endpapers. Red leather addition on spine with British Museum shelfmark and title."
  },
  "Add MS 12280": {
    "title": "Sĕrat Babad Mangkunagaran",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12280",
    "scope": "Sĕrat Babad Mangkunagaran, also called Babad Pakubuwanan , which may be a mistake for Babad Pakunagaran . Begins, Anĕnggih kang ginupita / Pangran Amangkunĕgari / kalanira abĕdami / lan kang rama Sri Bupati / Jĕng Sunan Mangkubumi / Kabanaran kang kadatun / . . . Cf. RAS Javanese Raffles Java 16. The text begins in 1749, but is incomplete at the end. Copyist ( sĕratanipun ) Sĕtradirana (cf. Add. 12287, 12290). Dated giri kalih rĕsi tunggal [AJ. 1727/A.D. 1800]. In Javanese language and script. In verse; 29 cantos. See Ricklefs, 1969, pp. 245-6.",
    "physical": "Dimensions: 220 x 180 mm. 149 ff. Eur paper. Illuminated double frames in gold and colours at start of volume Each canto kĕpala similarly decorated."
  },
  "Add MS 12281": {
    "title": "Sĕrat Panji Angronagung Pakualaman",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12281",
    "scope": "Sĕrat Panji Angronagung Pakualaman , also called Sĕrat Jaya Lĕngkara . In Javanese language and script. Dated eka windu pandita satunggil [A.J. 1741/A.D. 1813]. In verse; 31 cantos.",
    "physical": "Dimensions: 225 x 180 mm. 162 ff; English paper; ff. 3-162 watermarked 'B&amp;W 1809' [i.e. Budgen &amp; Wilmott]; illuminated frames on ff. 1-2 on English paper watermarked '1814'. Endpapers of Javanese paper ( dluwang ). 15 lines per page, in a sloping hand, brown ink. Illuminated double frames on ff. 1v-2r with architectural candi style wadana in gold, blue, red, pink, yellow, green and black ink, with a pair of birds on the headpiece. Binding: Full black leather binding, with stamped frame and ornaments, with red and white head and tailbands, bound in Java. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12282": {
    "title": "Sĕrat Babad Pakubuwanan",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12282",
    "scope": "Sĕrat Babad Pakubuwanan . Beginning with the death of Pakubuwana I in mantri papat ngrasa wani [A.J. 1643/A.D. 1718]. Ricklefs, 1969, p. 246, is wrong in suggesting it begins with the death of Pakubuwana II. It ends during the Chinese war of the 1740s. Copyist ( seratanipun ) Wongsayuda (cf. Add. 12286, 12292, 12322, 12323). Dated guna di panditeng rat [AJ. 1723/A.D. 1796] (the date of the original of which this is a copy). In Javanese language and script. In verse; 65 cantos. See Ricklefs, 1969, pp. 246.",
    "physical": "Dimensions: 220 x 170 mm. 271 ff. Englishpaper: ‘C Wilmott 1812'."
  },
  "Add MS 12283": {
    "title": "Sĕrat Babad Pakunĕgaran",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/FullDisplay.aspx?index=0&amp;ref=add_ms_12283",
    "scope": "Sĕrat Babad Pakunegaran . ‘History of Mangkunagara, composed by the prince himself! written in Surakarta for the 55th birthday of Mangkunĕgara I, in buta wiyat turongga ngrat [AJ. 1705/A.D. 1779]. Copyist Sĕtrawijaya (cf. Add. 12296); the date of this copy is A.J. 1740 [A.D. 1813]. In Javanese language and script. In verse; 90 cantos. See Ricklefs, 1974, pp. 42n., 46n., 90n., 93n.; Ricklefs, 1969, p. 246. Microfilm in Cornell University Library. Cf. Add. 12318.",
    "physical": "Dimensions: 225 x180 mm. 365 ff. English paper: ‘C Wilmott 1814'."
  },
  "Add MS 12284": {
    "title": "Sĕrat Rama Kĕling",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12284",
    "scope": "Sĕrat Rama Kĕling , the Javanese version of the Ramayana. F.ir.: konda Mĕlayu kikayat // pinindah ing basa Jawi / sinung gĕnding sandi warna / . . . . Said to be written at the royal wish ( ing karsa Jĕng Nata ) but neither the king nor the author are named. Dated duwi catur syara ratu [A.J. 1742/A.D. 1814]. On ff. 141v, 142v. are found numerical tables. In Javanese language and script. In verse; 94 cantos. See Ricklefs, 1969, pp. 246.",
    "physical": "Dimensions: 235 x 175 mm.Decorated initial p. and canto headings, in colours and gilt. 256 ff. English paper: ‘S &amp; C Wise 1815’."
  },
  "Add MS 12285": {
    "title": "Sĕrat Angling Darma",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12285",
    "scope": "Sĕrat Angling Darma. In Javanese language and script. In verse; 29 cantos. See Ricklefs, 1969, pp. 246.",
    "physical": "Dimensions: 245 x 195 mm. 103 ff. English paper: ‘Budgen &amp; Wilmott 1808’. Initial pp. decorated in colours and gilt."
  },
  "Add MS 12286": {
    "title": "Sĕrat Jaya Kusuma",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12286",
    "scope": "Sĕrat Jaya Kusuma . Copyist ( sĕratanipun ) Wongsayuda (cf. Add. 12282, 12292, 12322, 12323). Dated in Semarang, janma catur syara iku [A.J. 1741/A.D. 1813]. In Javanese language and script. In verse; 55 cantos. See Ricklefs, 1969, p. 246.",
    "physical": "Dimensions: 240 x 195 mm.31 ff. Eur paper: ‘1808 [?]’."
  },
  "Add MS 12287": {
    "title": "Babad Sĕjarah M ĕ ntaram",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/FullDisplay.aspx?index=0&amp;ref=Add_MS_12287",
    "scope": "Babad Sĕjarah M ĕ ntaram . Historical chronicle from Adam to the fall of Kartasura. This is a copy of Add. 12320, without the earlier ending discussed in Ricklefs, 1974, pp. 214-16, and without the colophon at the end. The copy seems to be exact, as far as could be determined by a rapid comparison, except on f. 572r. of Add. 12287 where the copy ceases to follow Add. 12320's text, hut later returns to it. Both texts have 170 cantos because of this divergence of Add. 12287, although Add. 12287 lacks Add. 12320's final canto. Copyist ( sĕratanipun ) Sĕtradirana (cf. Add. 12280, 12290). Dated damar muluk wikujagat [A.J. 1703/A.D. 1777], like Add. 12320. Ricklefs, 1969, p. 246, wrongly converts this date. In Javanese language and script. In verse; 170 cantos. See Ricklefs, 1969, p. 246.",
    "physical": "Dimensions: 225 x 180 mm.Initial pp. and cantoheadings decorated in colours and gilt. 658 ff. Engl paper: 'Budgen &amp; Wilmott 1808', ‘C Wilmott 1814'."
  },
  "Add MS 12288": {
    "title": "Babad Sultanan utawi Mangkunĕgaran [sic, i.e. Mangkubumen?]",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12288",
    "scope": "Babad Sultanan utawi Mangkunĕgaran [sic], the latter title perhaps being a mistake for Mangkubumen . In Javanese language and script. The text begins in the Third Javanese War of Succession, c. 1749, and breaks off at the end apparently c. 1754. A note which is partially glued down to the cover reads, punika sĕratanipun Kangjĕng Sultan Sĕpuh [Hamĕngkubuwana II]. Perhaps this was indeed written by Hamĕngkubuwana II. who is believed also to be the author of Leiden Or 2191, Babad Mangkubumi , which begins in 1755 (see Ricklefs, 1971). In verse; 160 cantos.",
    "physical": "Dimensions: 225 x 185 mm. 330 ff; English paper, ff. 4-440 watermarked 'Budgen &amp; Wilmott 1808', 'B&amp;W 1809'; ff. 2-3 watermarked '1814'. Endpapers of Javanese paper ( dluwang ). 15 lines per page, squarish script, brown ink. Illuminated double frames on ff. 2v-3r with architectural candi style wadana in gold, blue, red, pink, yellow, green and black ink, with pairs of makara , naga and peacocks. Binding: Full black leather binding, with stamped frame and ornaments, bound in Java, with red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12289": {
    "title": "Sĕrat Sakonḍar",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12289",
    "scope": "Sĕrat Sakonḍar , a version of the Baron Sakender stories. In Javanese language and script. Discussed and summarized in Ricklefs, 1974, where it is argued that the MS is from the Yogyakarta kraton , written in the early 19th century. The final canto is a version of the Kidung Lalĕmbut . In verse; 15 cantos.",
    "physical": "Dimensions: 220 x 140 mm. 149 ff; Javanese paper ( dluwang ) for text block and endpapers; some wormholes. 16 lines per page, squarish script, black ink; dry-pointed ruled lines to guide the text. Rectangular decorated double frames on ff. 2v-3r in black ink with a floral scroll border. Binding: Full black leather binding, with stamped frame and ornaments, bound in Java, with red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12290": {
    "title": "Sĕrat Kitab Tupah",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12290",
    "scope": "Sĕrat Kitab Tupah , a Javanese translation of the Tufa by Ibn Hajar al-Haytami, a treatise on Islamic law. Translated from the Arabic into Javanesefor John Crawfurd by 'the chief of Samarang Adimanggolo'. Dated (for the original Arabic text) AH 958 (AD 1551/2). Copyist Sĕtradirana (cf. Add MS 12280, 12287). 359 sections. Law Muhammadan Canon: Tufah, translated from Arabic into Javanese, by Adimanggolo. Adimanggolo, Chief of Samarang: Tufah, a Treatise on Mahommedan Law translated by him from the Arabic into Javanese.",
    "physical": "Dimensions: 240 x 195 mm. 116 ff.; various English and Dutch papers, watermarked 'Zoonen' (f. 25), 'J Honig &amp;' (f.30), 'G Willmott 1810' (f. 60), 'Jansell 1810' (f. 73), 'Budgen &amp; Willmott 1809' (ff. 78-88). End papers of Javanese treebark paper ( dluwang ). 12 lines per page, black ink. Illumination: double decorated frames ( wadana ) on ff. 5v-6r, with gold, red, pink, green, blue and black ink. Binding: Full black leather binding with blind stamped frames and ornaments. Some early folios have the text on the vertical sides cropped (presumably in binding)."
  },
  "Add MS 12291": {
    "title": "Sĕrat Maliawan",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12291",
    "scope": "Sĕrat Maliawan, in Javanese language and script. A king Subali is mentioned in the text. Dated Jimawal, jalma kon ḍa maweng ratu , which must be AJ 1741 (AD 1813). In verse; 41 cantos.",
    "physical": "Dimensions: 235 x 190 mm. 135 ff.; English paper, watermarked '1808' (f. 11), 'V E I C' (f. 135). Endpapers of Javanese treebark paper ( dluwang ). 15 lines per page; brown ink. Illumination: Double decorated frames on ff. 2v-3r in gold and red, green, blue and black ink, on paper watermarked '1814'. Binding: Full black leather binding, with tooled and stamped frames and ornaments."
  },
  "Add MS 12292": {
    "title": "Babad , Javanese historical chronicle",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12292",
    "scope": "Babad , extending from Nyai Agĕng Tarub to the Trunajaya rebellion. Text ends abruptly, after the death of Raden Prawiratruna. Copyist ( sĕratanipun ) Wongsayuda (cf. Add. 12282, 12286, 12322, 12323). Dated nir catur wiku jagat [AJ. 1740/A.D. 1813]. In Javanese language and script. In verse; 79 cantos. See Ricklefs, 1969, p. 247.",
    "physical": "Dimensions: 220 x 180 mm. 202 ff. Eur paper. Initial pp. decorated in colours and gilt."
  },
  "Add MS 12293": {
    "title": "Sĕrat Babad Mangkuratan",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12293",
    "scope": "Sĕrat Babad Mangkuratan . Apparently concerning Amangkurat II (1677-1703). Copyist ( sĕratanipun ) Sĕtrajaya; this copy made in A.J. 1740 [A.D. 1813]. In Javanese language and script. In verse; 42 cantos. See Ricklefs, 1969, p. 247.",
    "physical": "Dimensions: 220 x 180 mm. 202 ff. Engl paper: '1810', 22 x 18 cm."
  },
  "Add MS 12294": {
    "title": "Sĕrat Gonda Kusuma",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12294",
    "scope": "A: ff. 3v-66r. Sĕrat Gonda Kusuma . Dated with a sĕngkala which must be read from left to right, jilma muni kerni naga [A.J. 1728/A.D. 1801]. Cf. Add. 12295. In verse; 40 cantos. B: ff. 67r-182r. Sela Rasa . In verse; 30 cantos. In Javanese language and script.",
    "physical": "Dimensions: 265 x 185 mm. 183 ff; Javanese paper ( dluwang ). Endpapers of European paper. 16-19 lines per page, squarish script, black ink. Binding: Full black leather binding, with stamped frame and ornaments, bound in Java, with green, red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12295": {
    "title": "Sĕrat Gonda Kusuma",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12295",
    "scope": "Sĕrat Gonda Kusuma . Dated jalma muni catur sirna , which must be read from left to right [A.J. 1740/A.D. 1813]. This is a transcript (or a copy of a transcript) of Add. 12294 (A), although a quick comparison revealed a number of inaccuracies and omissions. In Javanese language and script. In verse; 40 cantos. See Ricklefs, 1969, p. 248.",
    "physical": "Dimensions: 250 x 195 mm. 68 ff. Engl paper: ‘C Wilmott 1814’, ‘Budgen &amp; Wilmott 1808’. Decorated initial pp."
  },
  "Add MS 12296": {
    "title": "Menak story",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12296",
    "scope": "Menak story, about Amir Hamzah, the uncle of the Prophet Muhammad. At the beginning are mentioned Ki Arya Ngabdol Montalib, nagri Mĕkah , and nĕgari Mĕdayin . Incomplete at end. This copy dated A.J. 1740 [A.D. 1813]; copyist ( sĕratanipun ) Sĕtrawijaya (cf. Add. 12283). In Javanese language and script. In verse; 86 cantos. See Ricklefs, 1969, p. 248.",
    "physical": "Dimensions: 225 x 185 mm. 186 ff., European paper."
  },
  "Add MS 12297": {
    "title": "Sĕrat Gonda Kusuma",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12297",
    "scope": "Sĕrat Gada (Gonda) Kusuma . Copyist ‘Tiyangsĕpoh' (cf. Add. 12302, 12317, 12332). In Javanese language and script. In verse; 74 cantos. See Ricklefs, 1969, p. 248.",
    "physical": "208 ff. Engl paper: ‘Budgen &amp; Wilmott’, 22 x 18 cm. Initial pp. decorated in colours and gilt."
  },
  "Add MS 12298": {
    "title": "Babad Pajang",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12298",
    "scope": "Babad Pajang. Begins with the fall of the Pajang dynasty and the rise of Senapati Ingalaga, and ends with Sultan Agung's reception of Pangeran Pĕkik of Surabaya [c. 1628]. Written upon the wish of panjĕnĕngandalĕm Kangjĕng Tuwan [Crawfurd?]. The dating is unclear: the text reads, ing etang taunira sewu wolungatus . . . sinĕngkalan (kang) pĕksi dangdang ing ardi pan dadine kaetang . Thus, it says the writing was in ‘the 1800s’ but the chronogram, if read left to right, produces 1177, which could only be a date in Anno Hijrae, equivalent to A.D. 1763 (which is not possible if the Kangjĕng Tuwan is Crawfurd). Read in the usual fashion the chronogram makes no sense whatsoever. In Javanese language and script. In verse; 31 cantos. See Ricklefs, 1969, p. 248.",
    "physical": "Dimensions: 225 x 180 mm. 128 ff. Engl paper: 'C Wilmott 1814’. Initial pp. decorated in colours and gilt."
  },
  "Add MS 12299": {
    "title": "Menak story",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12299",
    "scope": "Menak story, about Amir Hamzah, uncle of the Prophet Muhammad. Incomplete at end. In Javanese language and script. In verse; 32 cantos. See Ricklefs, 1969, p. 248.",
    "physical": "Dimensions: 220 x 180 mm. 10 ff. English paper: 'BW'."
  },
  "Add MS 12300": {
    "title": "Javanese legendary tales",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12300",
    "scope": "Legendary tales, including those of Res Gĕṭayu and Panji, according to Djajadiningrat, 1913, p. 4 n. 1. Copyist Ranawijaya (cf. Add. 12333). The text is incomplete. Dated Dal, pĕksi srĕngkara winayang mantriy which is confused but may be intended as A.J. 1743/A.D. 1815. In Javanese language and script. In verse; 31 cantos. See Ricklefs, 1969, p. 248.",
    "physical": "Dimensions: 250 x 195 mm. 90 ff. English paper: ‘Budgen &amp; Wilmott 1808’. Initial pp. decorated in colours and gilt."
  },
  "Add MS 12301": {
    "title": "Babad Pacina",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12301",
    "scope": "Babad Pacina . Written in the Katĕmĕnggungan in Madiun, in boja ro kuda ning rat [ A.J. 1722/A.D. 1795]. In Javanese language and script. In verse; 36 cantos. See Ricklefs, 1969, p. 248.",
    "physical": "Dimensions: 225 x 180 mm. Paper: 169 ff. Various papers: illuminated frames on ff. 1-2 on English paper watermarked 'C Wilmott 1814', no chainlines; fly leaf and main text (ff. 3-169) on English paper, watermarked ‘B &amp; W 1809’, also no chainlines. 15 lines of text per page, brown ink; forward sloping hand. Canto markers illuminated with gold.Binding: full black leather binding, with blind-stamped frame bands and foliate ornaments in corners, with red leather BM label on spine."
  },
  "Add MS 12302": {
    "title": "Sĕrat Rĕjunawijaya",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12302",
    "scope": "Sĕrat Rĕjunawijaya . Ends with the Asṭa Brata . Copyist ( sĕratanipun ) abdidalĕm tiyangsĕpuh Ngabehi Sĕstraprawira (cf. Add. 12297, 12317, 12332). Dated in numerals A.J. 1728 [A.D. 1801]; another date on f. 128v., A.J. 1729 [A.D. 1802]. In Javanese language and script. In verse; 74 cantos.",
    "physical": "Dimensions: 275 x 105 mm. 252 ff; European paper, no watermark visible but very evident vertical chainline shadows; ff. 2-3 are of English paper with Brittania watermark, and horizontal chainlines without shadows. Endpapers of European paper. 17 lines per page, cursive script, brown ink. Dry-ruled guide lines for the text. Illuminated double frames on ff. 2v-3r with architectural candi style wadana in gold, blue, red, pink, yellow, green and black ink, with text in black ink. Binding: original full brown leather binding with ruled frames and large corner pieces and central medallion, with red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12303": {
    "title": "Yogyakarta court records",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12303",
    "scope": "Records from the kraton of Yogyakarta taken at the deposition of Hamengkubuwana II in 1812. In Javanese language and script. The contents are miscellaneous, being mostly of a legal nature. Included are texts of padu pradata (f. 4v); Angg ĕr Ag ĕng of AJ 1718 (AD 1791) (ff. 39r-45v); a royal command of AJ 1719 (AD 1792) (ff. 47 r-v); an order of Danurĕja I concerning land disputes of AJ 1720 (AD 1793) (ff. 49v-50r); Angg ĕr Ag ĕng ing pradata-dal ĕm of AJ 1723 (AD 1796) which is a Yogyakarta Nawala Pradata (ff. 56r-61r); Angg ĕr Ag ĕng of AJ 1719 (AD 1792) (ff. 63v-78v); Angg ĕr Arubiru of AJ 1712 (AD 1785) (ff. 78v-81r); S ĕrat Ĕbuk Anyar ratification of the land-settlement of AD 1774 (ff. 82r-83r); Yogyakarta-VOC contract of AJ 1706 (AD 1780) (ff. 83r-v); Yogyakarta-Surakarta contract of AJ 1707/AD 1781 (ff. 83v-88r); Yogyakarta-VOC contract of AJ 1715 (AD 1788) (ff. 88v-92r); Yogyakarta-Surakarta-Mangkunĕgaran-VOC treaty of AJ 1717 (AD 1790) (ff. 93r-97v); and various royal commands (ff. 98r et seqq.).",
    "physical": "Dimensions: 30 x 20 cm. 180 ff; mostly Javanese paper, some European papers. 1 red wax seal on f. 166r. Ff. 168-174 bound upside-down. Binding: Brown leather Javanese binding with tooled and stamped frames and medallions, and a remnant of a metal clasp on the front cover, but the envelope flap is missing."
  },
  "Add MS 12304": {
    "title": "Babad",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12304",
    "scope": "Babad , concerning Sultan Agung's sieges of Batavia. Called Sĕrat Bantĕn in a note at the front. A note suggests the author may have been Raden Wirakusuma of the Danurĕjan, Yogyakarta. Dated Wawu, tri songka winuruk den Nrĕpati [A.J. 1713/A.D. 1786]. In Javanese language and script. In verse; 35 cantos.",
    "physical": "Dimensions: 230 x 150 mm. 142 ff; Javanese paper ( dluwang ). 13 lines per page, squarish script, black ink. Binding: Full brown leather Javanese binding, with five stamped frames, corner pieces, a central medallion, and floral ornaments, bound with green, red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12305": {
    "title": "Sĕrat Nawawi",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12305",
    "scope": "A: ff. 1r.-195r. Sĕrat Nawawi, a Javanese verse translation of al-Rānīrī's Bustān al-Salāṭīn, books IV and V (see Voorhoeve, 1956). B: ff. 195v.-209r. A Javanese adaptation of the Arabic al-Tuḥfa al-mursala ilā rūḥ al-Nabī by Muḥammad ibn Faḍl Allāh al-Burhānpūrī. Edited and translated in Johns, 1965. Said to have been written in Tĕgalarum. C: ff. 209r.-227v. Mystical teachings. In verse; 6 cantos. In Javanese in Arabic script ( pegon ).",
    "physical": "Dimensions: 270 x 195 mm. 230 ff; Javanese paper ( dluwang ). 13 lines per page, black ink. Decoration: some doodles of peacocks on f.1; decorated stanza markers. Binding: Full brown Javanese leather binding, with five stamped frames, and corner pieces and central medallion, and floral ornaments on spine, envelope flap with metal clasp, with red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum (upside down on volume)."
  },
  "Add MS 12306": {
    "title": "Sĕrat Babad Mĕtaram",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12306",
    "scope": "A: ff. 1-147. Sĕrat Babad Mĕtaram . A loose note on Javanese paper says, punika Sĕrat Babad Mĕtaram, Kangjĕng Sultan Karta . The text opens with a discussion of Jeng Sultan teng Mataram , and seems to end in the Kartasura period. In verse; 58 cantos. B: ff. 148-9. A text setting out the genealogy of Citrasoma of Jĕpara (cf. RAS Javanese Raffles Java 34 E). It begins with Sang Nata ing Majapahit. A note suggests either this text or perhaps both texts are associated with the date [A.J.] 1733 or 1734 [A.D. 1806 or 1807]. In Javanese language and script. See Ricklefs, 1969, p. 249.",
    "physical": "Dimensions: 310 x 190 mm. 149 ff. European paper."
  },
  "Add MS 12307": {
    "title": "Carita dadine Bumi Salangit",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12307",
    "scope": "‘Charita dadine Bumi Salangit' [Carita dadine Bumi Salangit]. Described in Keyzer, 1854, p. 336, as a creation story. In Javanese in Arabic script ( pegon ).",
    "physical": "Dimensions: 255 x 180 mm. 203 ff; Javanese paper ( dluwang ). 17 lines per page, black ink, up to f. 112 with red reading marks. Binding: Full brown leather Javanese binding, with four stamped frames, corner pieces and central medallion, and ornaments on spine, with envelope flap and metal clasp (fastening from right), with green, red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12308": {
    "title": "Babad, wiwit suwung ing tanah Jawi",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12308",
    "scope": "A: ff. 1-210. Babad, wiwit suwung ing tanah Jawi dumugi babaripun Kanjeng Panĕmbahan Purubaya. Begins with Adam and ends abruptly in the reign of Senapati after the birth of Raden Umbaran [i.e. apparently Pan. Purubaya]. Written in the Mangkubumen, Yogyakarta. Dated A.J. 1740 [A.D. 1813]. Several cantos are individually dated, from A.J. 1736 to 1738 [A.D. 1809-11]. In verse; 63 cantos. This text is discussed in Ricklefs, 1974, pp. 242-4. B: ff. 211-14. An order of the British Administration of Java concerning currency matters (in Javanese), dated A.J. 1741 [A.D. 1813], on the back of which is a text about Raja Sinḍula. In Javanese language and script.",
    "physical": "Dimensions: 340 x 235 mm. 214 ff; Javanese paper ( dluwang ). 2--22 lines per page, several different hands, black ink. Binding: Full brown Javanese leather binding, with six stamped frames, and corner pieces and central medallion, with green, red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12309": {
    "title": "Menak Amir Hamza",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12309",
    "scope": "Menak Amir Hamza , the Javanese story of the adventures of Amir Hamza, uncle of the prophet Muhammad. Written for Ratu Ageng (c. 1730-1803), a wife of Sultan Hamengku Buwana I and the mother of Hamengku Buwana II, some time after 1792. In the introduction she is called prabu wanodeya / kang jumeneng Ratu Agung / kang ngedhaton Tegalreja /, 'the female monarch / who reigns as Ratu Agung / and has her palace in Tegalreja'. Ratu Ageng was a daughter of an Islamic scholar and was known as a devout Muslim. Niemann, 1861, p. 480, says that the government of Abdul Mutalib in Mecca is discussed at the beginning; later stories concerning Amir Hamza are told. In Javanese in Arabic script ( pegon ).",
    "physical": "Dimensions: 287 x 217 mm. 1,520 folios; Javanese paper ( dluwang ). Due to its enormous size, there was an error in the original foliation, which jumps from 449 to 500. The last numbered folio is 1564 [i.e. 1514 numbered folios], and there are 5 unnumbered folios between ff. 3 and 4, and one final blank folio at the end of the volume. The total number of folios in the volume is therefore 1520. This is the thickest manuscript codex in the British Library (i.e. the manuscript with the largest number of folios bound into a single volume). In the digital surrogate, f. 1000 has been numbered as f. 999a. Ff. 1001-1564 are treated as flysheets and numbered with Roman numerals i-dxliv. The final leaf is an unnumbered flysheet. 13 lines per page, black ink. Binding: Full brown leather Javanese binding, with stamped frame and ornaments, originally with envelope flap (now missing) and metal clasps. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12310": {
    "title": "Serat Jaya Lengkara Wulang",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12310",
    "scope": "Serat Jaya Lengkara Wulang. Wrongly identified by Ricklefs &amp; Voorhoeve (1977: 48) as Gonda Kusuma . Compare with MSS Jav 24 of the same work, which is very similar in hand and style, and may have been decorated by the same artist. This appears to be a single text, with some loose pages and miscellaneous annotations at the beginning and end. The beginning is abrupt, and clearly some pages are missing. Begins with a discussion of the king of Bojanĕgari. In Javanese language and script. In verse; 76 cantos.",
    "physical": "Dimensions: 310 x 195 mm. 235 ff; Dutch paper, watermarked 'H Konig' (cf. f. 235). 17 lines per page, squarish script, black ink, with rubrication. Illumination: many decorated chapter headings and illustrations of battle formations in blue, red, yellow and green, outlined in black ink, on ff. 5v, 19v, 44v, 54v, 67v, 72v, 80v, 83v, 91r, 92v, 95r, 99r, 102v, 109v, 116v, 117r, 119v, 120r, 128v, 134v, 142r, 143v, 159v, 167v, 180r, 189v, 211v (uncoloured). Binding: Full brown leather Javanese binding, with five stamped frames, corner pieces and a central medallion, with green and white head and tailbands."
  },
  "Add MS 12311": {
    "title": "Primbon",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12311",
    "scope": "Punika sĕrat Primbon Palintangan Palindon Pakĕdutan . on f. 2v: punika wirasat lamun grahana wulan sami. ... A text on physiognomy, astrology, etc. Described in Niemann, 1870, p. 136. In Javanese and Arabic (pegon) script.",
    "physical": "Dimensions: 200 x 130 mm. 140 ff; Javanese paper ( dluwang ). Various hands and inks: ff. 1-111r mostly in Javanese script; ff. 111v-134r in Arabic ( pegon ) script, upside down. Binding: Full brown leather Javanese binding, with four stamped frame and ornaments, with envelope flap and metal clasps, with red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12313": {
    "title": "Sĕrat Sĕjarah Dĕmak",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12313",
    "scope": "A: f.1r. A list of 45 MSS (kang 45 buk), which seems to be an inventory of a part of the Crawfurd collection. Some of the items are identifiable as volumes now in the British Library collection. B: ff. 2v.-31r. Sĕrat Sĕjarah Dĕmak, beginning with Adam and ending with Sultan Pajang's visit to Ratu Kalinyamat. A copy of the same text as Add. 12333 (A). Dated A.J. 1712 [A.D. 1785]. In verse; 14 cantos. C: ff. 32r-36v. Incomplete Panji story. Begins, Sira Panji Wau Jaya, which is the title of text no. 2 in the list in Add. 12313 (A). In verse; 5 cantos.",
    "physical": "Dimensions: 270 x 210 mm. 37 ff; Javanese paper ( dluwang ). Various hands, black ink. Binding: Full brown leather binding, with stamped frame and ornaments, in emulation of the Javanese style, probably bound in the British Museum bindery, but perhaps with original red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12314": {
    "title": "Fiqh",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12314",
    "scope": "Work of fiqh. Niemann, 1861, p. 480, comments briefly on its contents. In Javanese in Arabic script ( pegon ).",
    "physical": "Dimensions: 265 x 185 mm. 145 ff; Javanese paper ( dluwang ). 13 lines per page, black ink with some words and lines in red ink. Binding: Full brown leather Javanese binding, with six stamped frames, corner pieces and a central medallion, and ornaments on the spine, with envelope flap and metals clasps, and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12315": {
    "title": "Primbon",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12315",
    "scope": "Assorted texts on religious subjects, legends of Muslim religious heroes, physiognomy, etc.; i.e. a Primbon . In Javanese and Arabic (pegon) script.",
    "physical": "Dimensions: 225 x 185 mm. 213 ff; Javanese paper ( dluwang ). Various hands, black ink with rubrication. The volume has been foliated from right to left, and in sequence, but ff. 1-22, and ff. 89v-213v are upside down. Binding: Full brown leather binding, with stamped frame and ornaments, in emulation of the Javanese style, probably bound in the British Museum bindery, but perhaps with original green, red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12316": {
    "title": "Legendary Javanese history",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12316",
    "scope": "A: f. 1r. A piagĕm of Kangjĕng Raden Tumĕnggung Sumadiningrat. B: ff. 2r.-161r. Legendary Javanese history. Begins, awiwit duk lagi duryat/sapanginggil dĕmugi Pajang Mĕtawis. On f. 2r. are mentioned Gusti Allah and Jabrail. Notes at the top of several pages give the contents of the text: carita Manik Maya (f. 10r), carita Sĕmar (f. 16r), carita dewa ngusung ardi (f. 17v), carita Bĕtara Guru parentah ḍatĕng dewa sami gaḍah anak lanang wadon (f. 25r), carita Kaneka Putra rĕsi Nĕrada (f. 31r), carita jaman karta yoga nyaritakĕn pĕrmana (f. 36v.), carita Watu Gunung (f. 38v), carita Sultan Ngrum (f. 40r), carita tanah Jawi katiban wahyu ning Pangeran (f. 42r), carita Ratu tanah Jawi jumĕnĕng karatone malih (f. 44r), carita Kangjĕng Rasul sineba sahabat gangsal (f. 46r.), carita malaekat Ijajil anggoda marang Bu Saka (f. 47r), carita Nabi Kilir nunḍung Ji Saka saking Balhum (f. 48v), carita Aji Saka angripta kidung kakawin lan sĕngkala (f. 50r), carita Ronda Sĕngkĕran lan Ji Saka (f. 52v.), carita ratu ḍahar jalma nama Dewata Cĕngkar (f. 56r), carita Dewata Cĕngkar kĕndih karatone (f. 57r), carita putrane Dewata Cĕngkar kabuya-buya (i. 58v), carita dyan Daniswara tapa guwa Tĕrusan (f. 60r.), carita dyan Daniswara kagoḍa widadari (f. 62r), carita dyan Iswara [sic] katurunan Raja Siḍula (f. 64r.), carita dyan Daniswara pa[ng]geh lan kang garwa (f. 65r), carita Ranḍa Panungkul lan anake Jugul Muḍa (f. 67r), carita Daniswara panggih lan Ronda Panungkulan Jugul Muḍa (f. 69v), carita Aji Saka gawe jalma (f. 70v), carita sabate Aji Saka ḍana [sic] caraka data sawala pada jayanya (f. 72v), carita Aji Saka nganggit sastra Jawi (f. 74r.), carita Aji Saka pa[ng]gih lan naga linglung (f. 75v), carita baya putih pĕrang lan naga linglung (f. 77r), carita ula li[ng]lung pinatenan sirna lan ragane (f. 81r), carita Prabu Sinḍula nuruni kang wayah (f. 82v), carita den Daniswara gĕbyar kali (f. 85r), carita Prabu Daniswara pa[ng]gih ratu atinatina (f. 86r,), carita raden Daniswara jumĕnĕng nata aneng Panungkulan (f. 89r.), carita balane Prabu Daniswara pĕrang lan balane Aji Saka (f. 93r), carita kalahe Aji Saka sirna lan nĕgarane (f. 97r), carita Jugul Muda katriman anake Ronḍa Sĕngkĕran (f. 99r), carita Prabu Daniswara muksa (f. 101r), carita konḍa ratu Jawi wĕkasan Prabu Banjaran Sari (f. 101v), carita Prabu Banjaran Sari tilar nĕgara Jĕnggala (f. 103r), carita ngardi lanang pandita suwignya (f. 106r), carita ngardi lanang pandita sudigbya (f. 107r), carita buyut Sĕtama upados nata (f. 108r), carita Bajaran Sari tapa pra [?] neng kajil kĕcana tinurunan Raja Siḍula (f. 110r.), carita Prabu Kenya rĕna Suprabawati (f. 112r.), carita prang ĕjim lan manungsa (f. 118v.), carita Banjaran Sari ngadĕg ratu maleh (f. 120r), carita Prabu Banjaran Sari prang lan Prabu Wanodya (f. 123v), carita kawon prange prajurit wanodya (f. 134v), carita Prabu Banjaran Sari krama lan Prajurit Wanodya (f. 135v), carita Prabu Banjaran Sari tĕtĕp madĕg Ratu Galuh (f. 142r), carita kang sederek Prabu Banjaran Sari papat samya prapti (f. 145r), carita Prabu Bali kĕlĕpahkan kang sĕtana bang wetah [sic] (f. 147v.), carita pra[ng] Galuh lan bang wetan (f. 158r.). The text breaks off in midline on f. 161r. Dated netra roro pandita buda [A.D. 1722/A.D. 1795]. In verse; 34 cantos. C: ff. 162-228. Yusup, bound upside down. Begins, wontĕn carita winarni / tumrap ing dĕlancang Jawa / kang tinutur sajarahe / andikanira Yang Sukma / aneng sajroning Kuran / ya Muhammad srĕngĕn iku / caritane Yusup ika. Ends abruptly. Dated putra kalih nitih jalma [A.D. 1721/A.D. 1794]. In verse; 15 cantos. In Javanese language and script.",
    "physical": "Dimensions: 280 x 185 mm. 230 ff; Javanese paper ( dluwang ). 18-19 lines per page, cursive script, black ink. Ff. 162-228 ( Serat Yusup ) are bound upside down. Decoration: double frames in black ink at the start of Yusup on ff. 228r-227v. Wayang-style sketches in black ink on ff. 228v-230v. Binding: Full black leather binding, with stamped frame and ornaments, bound in Java, with white (now brown) head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12317": {
    "title": "Sĕrat Babad Pati",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12317",
    "scope": "Sĕrat Babad Pati . Begins with the rebellion of Pati against Sultan Agung; ends with the expedition of Prawiratruna against the Makasarese during the Trunajaya war. Incomplete at end. Copyist ( sĕratanipun ) abdidalĕm ‘Tiyangsĕpuh' (cf. Add. 12297, 12302, 12332). In Javanese language and script. In verse; 28 cantos. See Ricklefs, 1969. p. 250.",
    "physical": "Dimensions: 250 x 190 mm. 83 ff. English paper: ‘Budgen &amp; Wilmott 1808'."
  },
  "Add MS 12318": {
    "title": "Sĕrat Babad Pakunĕgaran",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/FullDisplay.aspx?index=0&amp;ref=add_ms_12318",
    "scope": "Sĕrat Babad Pakunĕgaran . Another copy of Add. 12283. Dated in Surakarta in A.J. 1705 [A.D. 1779], the same as Add. 12283. In Javanese language and script. In verse; 90 cantos. See Ricklefs, 1969, p. 251.",
    "physical": "Dimensions: 320 x 190 mm. 418 ff. European paper."
  },
  "Add MS 12319": {
    "title": "Panji",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12319",
    "scope": "Panji story, apparently Panji Kuda Waneng Pati. In Javanese language and script. In verse; 51 cantos.",
    "physical": "Dimensions: 315 x 220 mm. 205 ff of text; Javanese paper ( dluwang ). 18 lines per page, squarish script, black ink. There are a further 120 blank folios, of which only the first has been digitised. These blank folios are numbered in Javanese numerals in the top left corner of the verso of each folio, from 203 to 300, followed by a further 22 completely blank folios. Binding: Full brown leather Javanese binding, with six stamped frames, and corner pieces and central medallion and ornaments, with green, red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum. Top and bottom edges of text block coloured green (but not fore edge)."
  },
  "Add MS 12320": {
    "title": "Babad Kraton",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12320",
    "scope": "Babad , described in Ricklefs 1972 as Babad Kraton , from a reference on f. 715v. Author Raden Tumenggung Jayengrat. Begun in Yogyakarta in 'damar muluk wiku jagat' [AJ 1703 / AD 1777]; finished in 'catur musna pandita gade' [AJ 1704 / AD 1778]. A note in Crawfurd's hand says, 'History of Java found in the Kraton [at the deposition of Hamengkubuwana II in 1812] containing the real and fabulous history of the present dynasty.' It begins with Adam and ends with the fall of Kartasura. In verse form. Ruled decorative text frames in black ink on ff. 1v-2r, also on ff. 398v-399r (with only one line of text on f. 398v), and on ff. 715v-716r.",
    "physical": "Dimensions: 415 x 250 mm. 717 ff.; European paper. Black ink; 19 lines per page. Full brown leather binding with stamped frames and ornaments, in emulation of the Javanese style, probably bound in the British Museum bindery in the 19th century. Some fragments of paper with text (perhaps from original endpapers or enclosures) are tipped in at the end of the book."
  },
  "Add MS 12321": {
    "title": "Undang Wangsul Kutara Manawa Sastra, extracts from the Ramayana in Old Javanese and Javanese, and and eye-copy of the Old Javanese Cane charter",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12321",
    "scope": "A: ff. 1r.-36r. Undang Wangsul KutaraManazva Sastra . The note on the MS saying this is ‘from a copy on palm leaves given to me [Crawford] in 1814 by the Raja of Blilling [Boleleng]’ actually belongs on Add. 12336 and the note on that MS belongs here. According to Jonker, 1885, p. 33, this is a sort of elucidation or paraphrase of Add. 12277 in ‘MadureseJavanese', but it is of little value. Dated at the end in Sumĕnĕp, A.J. 1742 [A.D. 1814]. B: ff. 37r.-47r. Cariosi Sri Rama . ‘Extracts from the Ramayana . . ' In Old Javanese. C: ff. 48r.-62v. Jarwanipun Rama saking Bali . ‘Translation of the Ramayana from Bali furnished by the Prince of Sumanap [Sumĕnĕp] on Madura.' Dated A.J. 1742 [A.D. 1814]. D: ff. 63r.-70r. Jarwanipunpapĕtikan Ramayana . Dated A.J. 1742 [A.D. 1814]. E: ff. 70v.-83v. Punika artosipun kang sampun depunjawiakĕn cariosi Sri Rama Sayun Mantun Jaya Aprang lan Dasa Muka. ‘Extracts from the Cawi Ramayana rendered into Modern Javanese.' Dated at the end in Sumĕnĕp, A.J. 1742 [A.D. 1814]. F: ff. 85r.-94r. ‘Copy of an inscription on stone.’ This is an eye-copy of the Cane charter (Brandes 1913: 120-125 = OJO LVIII); cf. also Bodleian MS Jav. c. 2. Old Javanese. Engl. paper: ‘Budgen &amp; Wilmott 1812’ See Ricklefs, 1969, p. 251.",
    "physical": "Dimensions: 235 x 180 mm. 94 ff. European paper."
  },
  "Add MS 12322": {
    "title": "Sĕrat Babad Sĕngkala",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12322",
    "scope": "A: ff. 1r.-39v. Sĕrat Babad Sĕngkala, concerning, among other things, words used in chronograms. This is not a sĕngkala list. V: 5. Engl paper: ‘B &amp; W 1809'. B: ff. 40r.-69r. Kagungandalĕm Sĕrat Wiwaha utawi Mintaraga. Copyist (sĕratanipun) Wong¬sayuda (cf. Add. 12282, 12286, 12292, 12323). Begins (f. 41v., Canto I: 2), kang anurun srat pusakeng uni / mring Jĕng Arya Dyan Purwakusuma j patih Madurĕtna kaot J nĕnggih dyan panji luhung j Nata Adiningrat Sĕmawis / kang putra Jĕng Panger an ing Yugya wit dangu \\ mangke dados Kartabasa \\ kinasihyan mring Tuwan Idler Sĕmawis .... Dated netra tri saptaning rat [AJ. 1732/A.D. 1805]. In Javanese language and script. In verse; 8 cantos. See Ricklefs, 1969, pp. 251-2.",
    "physical": "Dimensions: 225 x 180 mm. 69 ff. Eur paper."
  },
  "Add MS 12323": {
    "title": "Kagungandalĕm Sĕrat Surya Ngalam kalih Salokatara",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12323",
    "scope": "A: ff. 1r.-30v. Kagungandalĕm Sĕrat Surya Ngalam kalih Salok atara. Copyist ( sĕratanipun ) Wongsayuda (cf. Add. 12282, 12286, 12292, 12322). Engl and Dutch paper: ‘J Ansell 1810', ‘J Honig &amp; Zoonen'. A copy of this text by S. Keyzer is Leiden Or 1910 (7). B: ff. 30v.-59v. Sĕngkala list. Punika lamenipun panjĕnĕngan kita kawit Ratu Panjajaran etang lajĕngipun dumugi Kangjĕng Susuhunan Pakubuwana kaping 4 . The last date is A.J. 1743 [A.D. 1815]. Javanese script with roman numerals. Cf. Add. 30353. Employed in Ricklefs, 1974. C: ff. 60r.-65v. Said to be a translation of an inscription. At the beginning is the date śāka 845 [A.D. 923]; a king Bramawijaya and Kahuripan are mentioned. This text dated A.J. 1740 [A.D. 1813]. D: ff. 66r.-74r. Again, a translated inscription. Dated śāka 863 [A.D. 941], mentioning a Sri Maharaja. At the beginning a note, sela kang mawi gambar, punika artosipun . In Javanese and Old Javanese language and script. See Ricklefs, 1969, p. 252.",
    "physical": "Dimensions: 250 x 190 mm. 75 ff. European paper."
  },
  "Add MS 12324": {
    "title": "Sĕrat pĕpujanepun tiyang Tĕnggĕr ingkang kina-kina",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12324",
    "scope": "Sĕrat pĕpujanepun tiyang Tĕnggĕr ingkang kina-kina . Also called Babad pĕpujan ing Tĕnggĕr . Apparently copied from RAS Javanese 48. Annotated by Crawfurd on f.1r: 'Sacred book of the Hindoos of the mountain of Tangar'. In Javanese in Javanese script.",
    "physical": "Dimensions: 265 x 17 mm.34 ff.; Javanese paper (dluwang); black ink; 18 lines per page.Binding: dark brown full leather European binding, with stamped frame bands and ornaments in emulation of the Javanese style."
  },
  "Add MS 12325": {
    "title": "Bĕksa jĕmparing text",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12325",
    "scope": "A: ff. 1r.-9v. Begins, kawarnaha ingkang mulih ki Dĕmang Astrawijaya. Perhaps a Panji text? In verse; 7 cantos. B 1: ff. 10r.-25r. Bĕksa jĕmparing text, taken from kagĕngan-dalĕm Sĕrat Surya Raja. Also called Sĕrat Konḍa and Sĕrat Gĕnḍing Bĕksan. The reference in Ricklefs, 1969, p. 252, to Sĕrat Purwa Raja is a mistake. Discussed in Ricklefs, 1974, pp. 192-3. Cf. MSS Jav. 58. B 2: ff. 26v.-43r. Bĕksa jĕbĕng text, taken from kagĕngan-dalĕm Sĕrat Surya Raja. Included with B I under the titles Sĕrat Konḍa and Sĕrat Gĕnḍing Bĕksan. Discussed in Ricklefs, 1974, pp. 192-3. Cf. MSS Jav. 58. C: ff. 44v.-49v. Sĕngkala-list. The first date is śāka 1018 [A.D. 1096], the last is A.J. 1741 [A.D. 1813]. Engl paper: ‘Budgen &amp; Wilmott 1809'. Employed in Ricklefs, 1974. D: f. 50v. Sajarahipun ing para nata ingkang luluhur ing para ratu ing nusa Jawi sadaya awit saking Kangjĕng Nabi Adam. A list of sixty-three names, the last being Hamĕngkubuwana IV [A.D. 1814-22]. The bottom of the page has been cut off in binding and more lines have been lost thereby. English paper: ‘Budgen &amp; Wilmott 1809'. In Javanese language and script. The whole volume is probably from Yogyakarta.",
    "physical": "Dimensions: 310 x 195 mm. 50 ff; English paper, watermarked 'Budgen &amp; Wilmott 1809', 'B&amp;W 1809'; ff. 2-3 watermarked '1814'. Endpapers of Javanese paper ( dluwang ). Various hands, squarish script, black ink. Binding: Full brown leather binding, with stamped frame and ornaments, in emulation of the Javanese style, probably bound in the British Museum bindery, but possibly with original green, red and white head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12326": {
    "title": "Sĕrat Bratayuda",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12326",
    "scope": "Sĕrat Bratayuda Inscribed on f. 1r: ‘The Brata Yuda, in modern Javanese, from a manuscript supplied by one of the princes at Djocjakarta\n[Yogyakarta]’ In verse; 63 cantos. In Javanese language and script. Some marginal pencilled annotations (by Crawfurd?), eg. on ff. 41r, 45r, 54v.",
    "physical": "Dimensions: 240 x 200 mm.74 ff.; English paper, watermarked: ‘Budgen &amp; Wilmott 1808', except for f. 1 of Javanese paper ( dluwang ); brown ink; 17 lines per page; very small neat hand.Decorated canto markers in brown ink. Binding: dark brown\nfull leather European binding, with stamped frame bands and ornaments in\nemulation of the Javanese style."
  },
  "Add MS 12327": {
    "title": "Sĕrat Rama Wijaya",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12327",
    "scope": "Sĕrat Rama Wijaya . Dated nir catur syaraning jalmi [A.J. 1740/A.D. 1813]. Anotated on f. 1r: 'The Ramayana in modern Javanese'. In Javanese language and script. In verse; 60 cantos.",
    "physical": "Dimensions: 245 x 195 mm.147 ff.; English paper, watermarked: ‘Budgen &amp; Wilmott 1808'; dark brown ink; 16 lines per page.ff. 1 and 147 originally constituted a wrap-around cover made up of a piece of paper with lines in Javanese in Arabic (pegon) script.Binding: dark brown full leather European binding, with stamped frame bands and ornaments in emulation of the Javanese style."
  },
  "Add MS 12328": {
    "title": "Sajarah ing Narendra",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12328",
    "scope": "Sajarah ing Narendra , a\nlegendary history. Dated pandita tlu\nnunggang jalmi [A.J. 1737/A.D. 1810] and [A.J.] 1743 [A.D. 1815], the\nlatter date presumably being the date of this copy. Begins with Adam ruling in\nMĕkah, with his wife Babu Awa and his four children. Ends abruptly in the midst\nof a battle involving Abiyasa and Dewahrata. In Javanese language and script. In verse; 48 cantos.",
    "physical": "Dimensions: 250 x 190 mm.123 ff.; English paper, watermarked: ‘C Wilmott 1814’; brown and black ink; 17 lines per page; hand changes on f. 87r. Binding: dark brown\nfull leather European binding, with stamped frame bands and ornaments in\nemulation of the Javanese style."
  },
  "Add MS 12329": {
    "title": "Surya Ngalam",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12329",
    "scope": "Surya Ngalam , a legal text in Javanese. Prose.",
    "physical": "Dimensions: 245 x 155 mm. 43 ff; Javanese paper ( dluwang ), some pages very darkened. Black ink; 15 lines per page, in a cursive, sloping hand. Full brown leather binding with stamped frames and ornaments, in emulation of the Javanese style, probably bound in the British Museum bindery in the 19th century."
  },
  "Add MS 12330": {
    "title": "Babad Bĕḍah ing Ngayogyakarta",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12330",
    "scope": "Babad Bĕḍah ing Ngayogyakarta , by Pangeran Arya Panular. A history of the British deposition of Sultan Hamĕngkubuwana II of Yogyakarta (1812), including the installation of Pangeran Adipati Pakualam I (1813). In the text the title is given as Sĕrat Babad Ngengreng kaping kalih , also called Sĕrat Babad ngengreng ing sapunika tĕdakan ingkang amĕsti ngengreng kaping kalih . [This title makes little sense.] Dated at the beginning trus guna pandit eng bumi and A.J. 1739 (in words) [A.D. 1812]. Some cantos are dated separately, the last being A.J. 1743 [A.D. 1815] In verse; 56 cantos.",
    "physical": "Dimensions: 285 x 190 mm. 182 ff.; Javanese paper ( dluwang ), many folios with untrimmed edges. Some blank pages. 18 lines per page; black ink. Some decorative canto headings. Paste-down correction on f. 101r. Binding: Full brown leather binding with stamped frames and ornaments, in emulation of the Javanese style, probably bound in the British Museum bindery in the 19th century."
  },
  "Add MS 12331": {
    "title": "Babad",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12331",
    "scope": "Babad . A history of the rebellions of Mangkubumi\nand others from Kartasura times to c. 1749, ending before the death of\nPakubuwana II. The beginning and the end are abrupt, and part of the text is\napparently missing, at least at the beginning. In Javanese language and script. In verse; 70 cantos.",
    "physical": "Dimensions: 375 x 230 mm. Some sections of the MS are smaller sized folios, 320 x 200 mm.129 ff.; laid European paper, with chainline shadows; black ink; 21-23 lines per page.NB the MS was originally arranged and foliated upside down, but was refoliated in 1989. Binding: dark brown\nfull leather European binding, with stamped frame bands and ornaments in\nemulation of the Javanese style."
  },
  "Add MS 12332": {
    "title": "Jaya Lĕngkara",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12332",
    "scope": "Jaya Lĕngkara ,\nbeginning with discussion of king Sonya Wibawa. Copyist ( sĕratanipun ) abdidalĕm\n‘Tiyangsĕpuh' (cf. Add. 12297, 12302, 12317). Dated mantri nata sapta atma \n[A.J. 1713/A.D. 1786], perhaps for the original? In Javanese language and script. In verse; 42 cantos.",
    "physical": "Dimensions: 225 x 175 mm.149 ff.; the main text (ff. 3-149) is of European paper with no laid or chain lines; f. 2r, which is annotated 'Jaya Lancara, recd. Dec. 20th 1815', is on English paper watermarked: ‘B &amp; W 1809'; f. 1a is of Javanese paper ( dluwang ). Binding: dark brown\nfull leather European binding, with stamped frame bands and ornaments in\nemulation of the Javanese style."
  },
  "Add MS 12333": {
    "title": "Sĕrat Sĕjarah Dĕmak , Sĕrat Kuntara and Sĕrat Pauji Kuda Narawongsa",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12333",
    "scope": "A: ff. 1r-48v. Sĕrat Sĕjarah Dĕmak , beginning with Adam and\nending with Sultan Pajang's visit to Ratu Kalinyamat. A copy of the same text\nas Add. 12313 (B), with somewhat different canto divisions and without the date\nat the beginning. In verse; 26 cantos. Engl paper: ‘Budgen &amp; Wilmott 1808'. Old number: Javanese 65. B: ff. 49r-73r. Sĕrat Kuntara , legal text. Written by ( ingkang nĕrai ) Pun Ranawijaya (cf. Add. 12300).In verse; 5 cantos. Dutch paper: ‘J Honig &amp; Zoonen'. Old number: Javanese 66. C: ff. 74r-126v. Sĕrat Pauji Kuda Narawongsa . In verse; 35 cantos. Engl\npaper: ‘Budgen &amp; Wilmott 1808’. Old number: Javanese 73. In Javanese language and script.",
    "physical": "Dimensions: 245 x 185 mm.126 ff.; various European papers: English paper watermarked 'Budgen &amp; Wilmott 1808' and Dutch paper watermarked 'J Honig &amp; Zoonen'. Brown ink; 13-20 lines per page.Binding: full brown leather binding with stamped frame bands and ornaments in emulation of the Javanese style."
  },
  "Add MS 12334": {
    "title": "Various texts in Javanese",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12334",
    "scope": "A: ff. 1r.-15r. ‘Javanese Airs' on Western musical staff. Old number: Javanese 67. B: ff. 16r.-34v. Sĕrat Pawukon . Beginning missing. In verse; 13 cantos. Old number: Javanese 70. Thereafter a series of didactic texts in the same hand as B, containing: C: ff. 34v.-36r. Punika pakĕkĕdutan saking Sek Adam ngalei salam . See Niemann, 1870, p. 136. D: ff. 36r.-38v. Punika awisandalĕm ing Surakarta Adiningrat . E: ff. 38v.-39r. Punika awisandalĕm ing Ngayogyakarta Adiningrat . F: ff. 39r.-v. Listing of various synonyms. G: ff. 39v.-40r. Text beginning lur ing dewek kakang tunggal. H: ff. 40r.-43r. Punika masalah pangipenipen saking Nabi Yusup . I: ff. 43r.-44v. Punika masalah ing lindu . J: ff. 44v.-45r. Punika masalah itungan lare lair . K: ff. 45r.-48v. Punika angawikani ing tanggal 30 . L: ff. 48v.-50r. Punika patamban tiyang sakit. M: ff. 50r.-51r. Punika esmu lamun ayun kinasiyan ing wong agung. N: ff. 51r.-53r. Begins, padedewan ingkang wuku tigang dasa . O: ff. 53r.-54v. Katuranggan ing pĕksi prakutut. P: ff. 54v.-56v. Katuranggan ing kucing sangking Nabi Suleman . Q: ff. 56v.-58v. Punika katuranggan ing wong. R: ff. 58v.-59v. Punika ngelmu pirasat. S: ff. 59v.-60r. Punika katuranggan ing wanita. T: ff. 60r.-63r. Pratikĕle jalma nitih kuda. U: ff. 63r.-64r. Begins, Asmaragapa tĕmbangan mijil, ingkang winiraos, malah mandar wontĕn nata bĕte. V: ff. 64r.-v. Katuranggan ing wanita . W: ff. 64v.-66v. Esmu wirasat. X: ff. 66v.-69v. Sewaka . Begins, layang Sewaka manira angawi / jalma sasra kang winayang jagat / carita kala ginawe . [Unclear date. Perhaps jalma swara . . .‚ i.e. A.J. 1671/A.D. 1746.] Y: ff. 69v.-71r. Sang Ratu Taju Sulatin. In Javanese language and script. Z: ff. 72r.-87r. Separate from texts B to Y. Rama Kawi, saking Bali . Also called Rama Wangsul Kawi . In Old Javanese. ‘From a copy on Palm leaves given to J. C. [Crawfurd] by tbe Rajah of Blilling [Buleleng] on Bali.’ Dated A.J. 1742 [A.D. 1814]. Cf. Add. 12278. Old number: Javanese 71.",
    "physical": "Dimensions: 225 x 185 mm.85 ff.; various European papers, including English paper watermarked, 'B &amp; W 1809'. Brown and black ink.Binding: Full brown leather binding with stamped frame bands and ornaments, in emulation of the Javanese style."
  },
  "Add MS 12335": {
    "title": "Sĕrat Suluk",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12335",
    "scope": "Sĕrat Suluk. Begins, Punika masalah ngilmu\nlarangan ingkang ginĕdong para wali ing tanah jfawa sĕday a. Incomplete at end. Annotated on f. 1r: 'A Suluk, or treatise on Medicine and other Arts'. In Javanese language and script.",
    "physical": "Dimensions: 225 x 175 mm.39 ff.; Dutch paper, watermarked 'J Honig', 'J H &amp; Z'; black ink; 11 lines per page.Binding: Half brown leather binding with marbled paper boards."
  },
  "Add MS 12337": {
    "title": "The teachings of Sultan Hamengku Buwana I",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12337",
    "scope": "18 cantos of verse, the first beginning, kocap wulangira Sri Bupati Sinuhun Swarga Ngayogyakarta ḍumatĕng putra wayahe prituwin mring wadya gung, i.e. the teachings of Sultan Hamĕngkubuwana I of Yogyakarta, to his offspring and officials. The MS also contains a number of short lyric poems. In Javanese language and script. Labelled on the front: ‘Collection of Songs, from the Prince Pakualam.’, i.e. given to John Crawfurd by Paku Alam I.",
    "physical": "Dimensions: 200 x 155 mm. 20 ff; English paper, watermarked J Whatman 1812', 'C Ansell'. Flyleaf of Javanese paper ( dluwang ). 12 lines per page, squarish script, brown ink. Illumination: double frames on ff. 1v-2r with architectural candi style wadana in gold, blue, red, yellow, green and black ink. Binding: Full brown leather binding, with stamped frame and ornaments, in emulation of the Javanese style, probably bound in the British Museum bindery, with traces of green head and tailbands. Red leather on spine with shelfmark and title added in British Museum."
  },
  "Add MS 12338": {
    "title": "Pawukon",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12338",
    "scope": "'A Pawukon , or Treatise on Judicial Astrology, in Javanese. A miscellaneous collection of items on dating, sengkalas, etc., part in verse, part in prose. Between ff. 79r and 135r are depicted 29 coloured figures of the gods and goddesses associated with the wukus , such as Yang Kuwera, Yang Brama, Betara Siwah, Yang Durga, Dewi Sri, etc., with a short note dedicated to each. The text begins, Lambang wuku taun Alip sarta amawi sengkala derapon aja kasupen daweg Alip sirah tiga tanggal [sic, i.e. tenggak ?] kalih punika [perhaps AJ 1723 / AD 1796]. The canto beginning on f. 25r is dated rupa ardi guna papat [AJ 1734 / AD 1807]. The regular progression of dates at the beginning of other cantos suggests number-games rather than dating, but it is difficult to be certain. They progress from AJ 1724 [AD 1797] to AJ 1738 [AD 1811], but reach AJ 1736 [AD 1809] immediately before the date AJ 1724 / AD 1807 is clearly given as the date of writing on f. 25r. On ff. 139v-140r are doodled images of wayang figures in black ink. There are a considerable number of blank folios in this volume. Mostly these have been digitised, but those between ff. 77v and 78r (35 blank folios) and between ff. 135v-136r (26 blank folios) have not been included in this digital record of the book.",
    "physical": "Dimensions: 270 x 210 mm. 140 ff; Javanese paper ( dluwang ); many blank pages have been left unfoliated. Black ink; 17 lines per page; small neat quadratic hand; evidence of dry-ruled guide lines, including on blank pages. Binding: Full brown leather Javanese binding, with stamped frames and ornaments. The front cover bears a metal clasp fitting in the middle, suggesting there was once an envelope flap, but this is no longer present. Similar bindings are found on Add. 12312 and Add. 12307."
  },
  "Add MS 12339": {
    "title": "Sĕrat Jaya Lĕngkara",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12339",
    "scope": "Sĕrat Jaya Lĕngkara. Dated murti nĕmbah syara jalma [A.J. 1720/A.D. 1793]. Incomplete at end. It seems that this is the same as Add. 12332 after the opening formalities, although a quick examination revealed many copyist's errors. Both MSS were probably taken from some third MS, for although this MS has a later date it is actually longer than Add. 12332 and contains materials beyond the last canto of the latter. In Javanese language and script. In verse; 47 cantos.",
    "physical": "Dimensions: 220 x 180 mm. 142 ff. English paper, watermarked ‘C Wilmott 1814'. Illuminated double frames at beginning on ff. 1v-2r, nicely decorated in colours and gilt. Binding: full black leather binding with dluwang endpapers."
  },
  "Add MS 12340": {
    "title": "Facsimile of a Kawi inscription",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12340",
    "scope": "‘Fac-simile, in pencil, of an ancient manuscript in the Kawi character, found at Tagala, in the province of Cheribon [Cirĕbon].’ Crawfurd, 1820, vol. ii‚ pp. 216-17 says, ‘from the figures, signs of the zodiac, and other characters painted upon it, it is conjectured to be a treatise on astrology’. Dr. J. Noorduyn says of this MS, ‘as far as it can be understood, the language is chiefly Javanese (or old Javanese) but with some influence of Sundanese’, and he suggests it may relate to divination for agrarian purposes. It seems to be pre-Muslim, and the original might therefore have been 16th century or earlier. Comprising three sheets of paper, labelled a, b and c. Cf. MSS Jav. 96, which is apparently a copy of the same MS.",
    "physical": "Three sheets of European paper: (a) 365 x 95 mm, folded into 13 folios; (b) 365 × 100 mm, folded into 14 folios; (c) 395 x 100 mm, folded into 21 folios."
  },
  "Add MS 12341": {
    "title": "Yogyakarta court records",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12341",
    "scope": "Records from the kraton of Yogyakarta apparently taken from the court at the deposition of Hamengkubuwana II in 1812. A collection of original letters, documents, grants of land, etc., written in Javanese language and script, ranging in date from AJ 1713 to 1739 (AD 1786 to 1812). F.89r contains text in Chinese; f. 146v is written in Javanese in Pegon (Arabic) script; a few documents are in Dutch.",
    "physical": "Dimensions: 380 x 265 mm. Various European and Javanese papers, and in various sizes, many with red ink seals. Black ink; f. 315 has some words in red ink. Binding: brown leather European binding with stamped and tooled borders and medallions emulating the Javanese style."
  },
  "Add MS 12342": {
    "title": "Yogyakarta court records",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12342",
    "scope": "Records from the kraton of Yogyakarta, apparently taken from the court at the deposition of Hamengkubuwana II in 1812. A collection of original letters, documents, grants of land, etc., written in Javanese language and script, dating from AJ 1698 to 1738 (AD 1772 to 1811). Includes lists of dusuns under various individuals, with taxes, cacahs , and the b ĕk ĕls of each village. At least one such item is in Dutch.",
    "physical": "Dimensions: 380 x 265 mm. Various European and Javanese papers of various sizes; black ink. Many red wax seals from ff. 185 onwards. Binding: brown leather European binding, with stamped and tooled borders and medallions in emulation of the Javanese style."
  },
  "Add MS 12344": {
    "title": "A dictionary of the Javanese language",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12344",
    "scope": "‘A dictionary of the Javanese language, compiled by the learned natives of Java for J. Crawfurd, Esq., during his official residence in Java'. Javanese-Javanese dictionary, in Javanese script, containing approximately 10,000 items (Ricklefs, 1969, p. 255, is an underestimate), with a supplement containing an additional 800 items. Some entries are incomplete. Apparently this is one of the dictionaries used by von Humboldt, 1836-9 (see vol. i, p. v).",
    "physical": "Dimensions: 245 x 195 mm. 157 ff.; European paper. Binding: full brown European leather binding, with blind-stamped frame bands in emulation of the Javanese style. The dictionary is presented in two columns, with the dictionary terms written in black ink, and the explanations in red ink."
  },
  "Add MS 12345": {
    "title": "Sĕrat Panji Murdaningkung",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_12345",
    "scope": "Sĕrat Panji Murdaningkung. Beginning dated rasa\nwiyat pandita wani [A.J. 1706/A.D. 1780]; end dated Alip angrasa lĕngit pandita\nning bumi [A.J. 1706; probably an error for A.J. 1707/A.D. 1780]. In Javanese language and script. In verse; 13 cantos. NB the manuscript has been foliated, and bound, upside down; thus the text commences on f. 89v.",
    "physical": "Dimensions: 225 x 180 mm.89 ff.; English paper, watermarked 'B &amp; W 1809', without laid or chain lines. Brown ink; 15 lines per page.Binding: full black leather binding with stamped frame bands and ornaments, with Javanese paper ( dluwang ) endpapers."
  },
  "Add MS 12377": {
    "title": "Hikayat Muhammad Hanafiah",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12377",
    "scope": "In Malay in Jawi script. Colophon on f.186r mentioned the copyist Te'ku [sic] Kecil bin Te'ku Itam. Ff.1r-7v consist of rough jottings, short pieces of Malay text, and (ff.1r-4v) a Javanese letter in Javanese script to the translator at Yogyakarta ( juru basa ing luji dalem ing Ngayujakarta Adiningrat ). The Hikayat text begins on f.9v.",
    "physical": "186 ff. Dimensions: 210 x 150 mm. 17 lines per page, black ink. Thin yellowish laid paper with brush marks, prob. Chinese. End papers of dluwang . Full brown leather binding, with ruled frames and a zig-zag pattern in the outer frame."
  },
  "Add MS 12387": {
    "title": "Hikayat Mesa Taman Sira Panji Jayeng Kusuma",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_12387",
    "scope": "Hikayat Mesa Taman Sira Panji Jayeng Kusuma , in Malay in Jawi script. A note in Javanese on f.2r identifies this as the property of one 'Pangeran Sarip Surya'. The text ends with a syair on ff.113r-114v; the colophon on f.114v gives the date 15 Syaaban, a Friday, but no year.",
    "physical": "Dimensions: 255 x 175 mm. 115 ff. Javanese paper ( dluwang ). 17 lines per page, black ink with rubrication. Binding: Full brown leather original Javanese binding with stamped frames and medallions, and remnants of a metal clasp."
  },
  "Add MS 14397": {
    "title": "Yogyakarta court records",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Add_MS_14397",
    "scope": "A collection of original letters, grants of land, etc., together with copies of two pieces in verse, written in Javanese in Javanese script, dating from AJ 1725 to 1739 (AD 1798-1812). A note by John Crawfurd (f. 1r) says: 'I send the Javanese MSS which I promised, one of them is a good piece of penmanship and consists of a scarce poem which I had copied ...'. There are two pieces in verse: (a) ff. 68r-73r, called artinepun aksara sela kang saking siti L ĕngkir can[d]I tilasi Panji , apparently a translation of an inscription, dated saka 865 (AD 943); (b) ff. 74r-77v, called titi wiwitan s ĕrat , the first stanza ending tan ana liyan kaetung among r ĕtna ning kusuma (? date saka 873/AD 951).",
    "physical": "Dimensions: 330 x 250 mm. Various European and Javanese papers, in various sizes; some red wax seals. Binding: brown leather European binding, with stamped and tooled borders and medallions in emulation of the Javanese style."
  },
  "Add MS 14851": {
    "title": "Anbiya",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_14851",
    "scope": "Anbiya. 'History of all the prophets from the Creation including the history of the island of Java’. The beginning has a date, but the year is omitted. Begins with Allah Tangala . Approximately the first 200 ff. concern the angels, Nabi Yusup, the Prophet Muhammad, etc. Thereafter the story moves to Java, at the time of the fall of Majapahit and the conversion to Islam. It ends shortly after Senapati marries the princess of Madiun. At the end the text is dated with imperfectly formed Western numerals for [A.J.] 1746 [A.D. 1818]. On f. 308v is annotated 'Samarang'. In Javanese language and script. In verse; 87 cantos.",
    "physical": "Dimensions: 310 x 200 mm. 308 ff.; cream Chinese paper, with the paper merchant's red ink stamps on f. 81r. Black ink; 22 lines per page; rubrication in red; elaborate coloured canto headers. Written in a rather difficult hand. Binding: full brown leather European binding."
  },
  "Add MS 18397": {
    "title": "Layang Wiwaha",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_18397",
    "scope": "Layang Wiwaha . Old Javanese text with Modern Javanese interpretation. In Javanese and Old Javanese language and Javanese script. In verse; 6 cantos.",
    "physical": "Dimensions: 310 x 205 mm.38 ff.; European watermarked paper with Javanese paper (dluwang) endpapers. Black ink; 9 lines of text with commentary per page.Binding: full brown leather original Javanese binding with flap, with 3 stamped frame bands and ornaments."
  },
  "Add MS 18398": {
    "title": "Pĕpakĕm",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_18398",
    "scope": "'The Pepakum or Javanese Code of Laws peculiar to the province of Cheribon [Cirĕbon].' Keyzer, 1854, p. 339, says this is probably the Cirĕbon Pĕpakĕm which in 1768 the Dutch East India Company made into a law book for Cirĕbon. In Javanese language and script.",
    "physical": "Dimensions: 315 x 190 mm.95 ff.; English paper, watermarked: ‘S &amp; C Wise 1811'. Pale black ink; 17 lines per page; ruled pencil guidelines. Binding: full brown leather original Javanese binding, with 5 stamped frame bands and ornaments."
  },
  "Add MS 18577": {
    "title": "Javanese dictionary and grammar, by John Crawfurd",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_18577",
    "scope": "Javanese dictionary, grammar, etc. This volume includes, in Crawfurd's hand, a Javanese grammar, a description of Javanese literature including summaries of Bratayuda , Arjuna Wiwaha , etc., descriptions of poetical metres and of various texts (many of them represented in his collection now in the British Library), and a number of translated selections from texts. He also writes on the Malay language and on the archipelago in general. Much of this material was used in Crawfurd, 1820, particularly in the sections on language and literature in vol. ii. On ff. 117r.-244v. there is an English-Javanese dictionary, with the Javanese entries in Javanese script. Approximately 6,000 entries, but not all of them are complete. Many pages are damaged, now repaired. Apparently this is one of the volumes used in von Humboldt, 1836-9 (see vol. i, p. v).",
    "physical": "Dimensions: 310 x 205 mm. 244 folios; thin yellowish Chinese paper. Binding: full European dark brown leather binding, with simple ruled frame bands and blind tooled medallion and bud ornaments in emulation of the Javanese style, and marbled paper doublures."
  },
  "Add MS 18578": {
    "title": "Javanese-English dictionary",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_18578",
    "scope": "Javanese-English dictionary, by John Crawfurd. Containing approximately 12,000 entries. Javanese entries in Javanese script, the English entries in a very faint red ink. Apparently this is one of the volumes used in von Humboldt, 1836-9 (see vol. i, p. v).",
    "physical": "Dimensions: 255 x 195 mm. 131 ff.; European paper, watermarked; f. 1r inscribed 'John Crawfurd, Athenaeum, Pall Mall, London' on English paper watermarked 'S Wise &amp; Patch 1824'. Brown and red ink. Binding: full brown leather binding with stamped frame bands and ornaments."
  },
  "Add MS 19413": {
    "title": "Arabic texts with Javanese glosses",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=add_ms_19413",
    "scope": "Eight Arabic texts with Javanese glosses. The Arabic texts are fully described in Catalogus, 1838-71. vol. ii, no. DCCCLXXI. They are Islamic religious works and commentaries, some anonymous, others by ‘Abd al-Karĩm ibn Ibrāhīm, Abu al-Layth Muhammad ibn Abī Naṣr ibn Ibrahim as-Samarkandī, Aḥrnad ibn al-‘Abbās al-Zāhid, Muḥarnrnad ibn Yūsuf al-Sanusī, and Muhammad ibn 'Umar ibn Ibrāhīm al-Tilimsānī. In Arabic and Javanese languages, in Arabic script.",
    "physical": "Dimensions: 310 x 224 mm. 383 ff.; Javanese paper ( dluwang ). Black ink with rubrication in red ink.Binding: full brown leather original Javanese binding with flap, with stamped frame bands and ornaments. Housed in a maroon buckram box."
  },
  "IO Islamic 2446": {
    "title": "Collection of texts in Arabic and Javanese",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100177198637.0x000001",
    "scope": "This manuscript contains texts in Arabic and Javanese. The Arabic texts have been catalogued in Loth, 1877 (Loth 1047), and see child records for further details. The contents are also described in Ricklefs &amp; Voorhoeve (1977: 56) as follows: Ff. 1-124: Arabic texts with interlinear Javanese\ntranslations in Arabic script ( pegon )\nand some marginal annotations in Javanese in Javanese script: A: ff. 1-3. Various notes in Arabic, Javanese, and Malay\n(with Javanese pronunciations, e.g. talapan \nfor dĕlapan ). B: ff. 4-24. Baḥr al-mushāhada \nby Ahmad ibn Aḥmad as-Samṭarānī. C: ff. 25-33v. Baḥr al-lāhūt \nby 'Abd Allāh al-‘Ārifīn. Cf. Voorhoeve, 1957, p. 37. D: ff. 33v.-51r. On repentance ( tauba ), etc. E: ff. 51v.-55r . al-Bāb\nfī ‘l-dhāti ‘l-muṭlaq . F: ff. 55v.-64r. Anonymous treatise on the merits of\nperforming ṣalāt . Javanese title: Kitab bab ga[n]jar[a]ne wong sambahyang .\n G: ff. 64v.-66r. Various traditions. H: ff. 66v.-107v. Traditions on the excellence of some\nmonths ( Fadīlat shahr Ramaḍān ‚ Rajab, Sha‘ban , etc.). I: ff. 107v.-110r. A short treatise, ending abruptly, on ten\npresents which the soul should carry at death. J: ff. 110v.-124. Kitāb\nMajnūn Allāh . Cf. Voorhoeve, 1957, p. 178. Ff. 125-336: Javanese mystical texts in Arabic script ( pegon ), with diagrams and marginal\nnotes, including some titles in Javanese script (see Voorhoeve, 1956): K: ff. 125-160v. Martabat\npitu, Dā'irat Parabu Mangkurat (f. 135v.), God's attributes, etc. L: ff. 160v.-168v, Caritanira\nSeh Samsu Tabarez (and Molana Rum), in prose. M: ff. 168v.-170v. Traditions. N: ff. 170v.-179v. Partingkah\ning sambahyang , from Kitab Ma‘ānī taḥqiq .\n O: ff. 179v.-180r. Explanation of man ‘arafa nafsahu , etc. P: ff. 180r-181r. Sayings of Kĕyahi Sayid of Daha and Kiyahi\nPangulu of Carĕbon. Q: ff. 181r.-188v. Kitab\ntahrir , abstracts from Sufi works. R: ff. 188v.-19ov. On the confession of faith. S:ff. 190v.-201r. ‘ Ilmuingatas\nangen (mysticism). T: ff. 201v.-205r. Javanese translation of Kitāb inzāl al-rūḥ . Cf. Voorhoeve, 1957,\np. 131. U: ff. 205v.-207r. On the meaning of uṣallī . V: ff. 207r.-211v. On ṣalāt .\n W: ff. 211v.-214r. Tapsir\ning Fātihat . X: ff. 214r.-217r. On shari‘ā,\nṭarīqa, haqīqa and ma‘rifa . Y: ff. 217r.-218v. Kitab\nSupi , explanation of a mystic tradition. Z: ff. 218v.-222r. Kitab\nroron-roron , on kawula-gusti . AA: ff. 222v.-226r. Kitab\npatakonan . AB: ff. 226v.-228v. Kitab\nrasa (title in Javanese script). AC: ff. 229r.-252v. Javanese translation from the Malay Kitāb Sharāb al-‘āshiqīn by Ḥamzah Fanṣūrī.\n AD: ff. 252v.-255v. Riwayat\nsaking kangjĕng Susunan ing Giri . AE: ff. 255v.-258v. Kitab\n‘ibarat ing pandita ahli suluk . AF: ff. 259r.-261v. On ‘ishq,\n‘āshiq, mashūq . AG: ff. 262",
    "physical": "Dimensions: 250 x 200 mm.336 folios. European paper, with chainlines, watermarked 'I H'; endpapers of Javanese treebark paper ( dluwang ).Binding: modern India Office binding of quarter leather with blue buckram boards."
  },
  "IO Islamic 2617": {
    "title": "[Various texts in Javanese and Arabic]",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=IO_Islamic_2617",
    "scope": "[Various texts in Javanese and Arabic] A: ff. 1v-10v. Various prayers, in Javanese and Arabic with Javanese titles. B: ff. 11v-69v. Arabic text on the qualities and use of stones and jewels, with an interlinear version in Javanese. The Arabic text and Javanese translation have many errors. For instance, aṣfar (yellow) becomes aṣghar (smallest) and is translated into Javanese as cilik (small). The beginning of the text is the same as the Berlin MS Ahlwardt 6218; the ending is different. C: ff. 70v-88v. Javanese text on medicines and amulets. D: ff. 89v-96r. Javanese text on sĕmbahyang (ritual prayer). E: ff. 97v-99v. A genealogy, beginning with Majapahit. Ending with Kanjĕng [sic] Gusti Pangeran Dipati Yuja [probably the Crown Prince of Yogyakarta, later Sultan Hamĕngkubuwana II]. At the end the date Je and a sĕngkala which, however, cannot be made out. F: ff. 106v-108v. A genealogy, beginning with Brawijaya of Majapahit. Dated at the end Jimawal A.H. 1203 [A.D. 1788, but that was Alip]. G: f. 111r. Jottings in Javanese script. Arabic script (pegon), except for G. 111 ff.",
    "physical": "Dimensions: 205 x 135 mm. 111 folios. 10-11 lines per page, black ink, with some rubrication. Javanese paper ( dluwang ). Binding: rebound in the India Office Library after 1955 in a quarter leather binding with blue buckram boards. The original back cover, of brown Javanese leather with stamped frames and ornaments, is now bound in to the inside back cover."
  },
  "MSS Jav 1": {
    "title": "Niti Praja",
    "language": "",
    "link": "",
    "scope": "Niti Praja. Presented to Mackenzie by Sura Adimanggala at Sĕmarang on 15 Rabingulawal A.J. 1739 [29 March A.D. 1812]. In Javanese language and script.",
    "physical": "Dimensions: 270 x 195 mm. 76 ff, thick European paper. Brown ink; 5 lines per page, set in ruled pencil frames. The MS has been bound with the writing only on the verso of each folio. Binding: Modern brown quarter leather and buckram binding."
  },
  "MSS Jav 10": {
    "title": "Sĕjarah sagung ing para Ratu",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_10",
    "scope": "Sĕjarah sagung ing para Ratu ff. 2v-273v. A romanized Malay note at the top of the first page describes this as ‘Cherita tana Jawa dari Adam sampe Mataram’. The text is identical to MSS Jav. 33, ending at exactly the same point in Senapati's career. Either MSS Jav. 10 was copied from MSS Jav. 33, which is thirty years older, or both were copied from the same original. This text is dated 7 Ramĕlan nir panĕmbah ing pandita aji [A.J. 1720/8 April A.D. 1794]. An English translation of this MS is in Mackenzie 1822 collection 20 (Blagden, 1916, p. 14). Three loose folios at the end of the volume: f. 274: Document in Javanese, ending in roman script: atau tulis ... Mr Colonel Mackenzie jikaloo ada suka pada saya . f. 275: Small fragment in Malay in vocalised Jawi script: Al-salam 'alaykum wa-rahmat Allah wa-barakatahu. Wa-ba'adahu. Sahaya bermaklumkan kiranya abang Abdul Kadir jikalau ada suka hari Ahad pagi abang boleh dating ke rumah juru tulis karena apa Abdul Karim hendak dating ke sana begitu kalau suka ... f. 276: Note in English: My adorations &amp; respects to the Panumbahi or Holy Men, on Monday (soma) the 7th of the month Ramalan the year Nubbeh - the season of himang sa casuma. Containing Particulars of the different Governments &amp; Dynasties that existed in the Island of Java ... from the creation of Adam &amp; going on until King Sallah Challah. In Javanese language and script. In verse; 42 cantos.",
    "physical": "Dimensions: 270 x 210 mm. 276 folios, with ff. 274-276 loose at end. Dutch paper, watermarked 'J H &amp; Zoonen'. 13 lines per page; black ink; quadratic script. Binding: rebound in the British Library bindery in 1993 using original Javanese brown leather covers, with stamped frames and ornaments; endpapers of dluwang ."
  },
  "MSS Jav 100": {
    "title": "Punika atur pratela kawula Adipati Sura Adinagara Bupati ing Lasĕm",
    "language": "",
    "link": "",
    "scope": "Punika atur pratela kawula Adipati Sura Adinagara Bupati ing Lasĕm. ‘Account of the family of the late regent of Tuban'. In Javanese script.",
    "physical": "Dimensions: 380 x 245 mm. 4 folios (comprising 2 bifolia). European paper. Black ink. Binding: Unbound. Stored in a buckram box."
  },
  "MSS Jav 101": {
    "title": "Punika wiwitipun Tanah Jawa",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_101",
    "scope": "Punika wiwitipun Tanah Jawa wontĕn karaton agĕng ingkang rumiyin Raja Kano . ‘Supposed to be a Javan Cherita or story from Solo [Surakarta].' In Javanese script.",
    "physical": "Dimensions: 215 x 155 mm. 7 folios; thin Chinese paper, with outer covers of Javanese paper ( dluwang ), all wormholed. Black ink. Binding: Unbound. Stored in a buckram box."
  },
  "MSS Jav 102": {
    "title": "Carita Wali",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_102",
    "scope": "Carita Wali. In Javanese script. In verse; 4 cantos.",
    "physical": "Dimensions: 210 x 175 mm. 18 folios; Dutch paper, watermarked 'LVG' and 'IV', with chainline shadows. 13 lines per page; brown ink; with red ink floral stanza indicators. Binding: Unbound. Stored in a buckram box."
  },
  "MSS Jav 103": {
    "title": "Caritanipun Urut Kanda",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_103",
    "scope": "Caritanipun Urut Kanda A brief fragment or abstract from a Sĕrat Kanda, beginning with Nurcaya and ending with Pandu Dewanata. From Yogyakarta; dated A.J. 1742 [A.D. 1816]. In Javanese language and script.",
    "physical": "Dimensions: 325 x 205 mm. 18 folios; English paper, watermarked 'J Whatman 1812'. Black ink. Unbound; two sewn quires of 12 and 8 ff. Housed in red buckram flapcase."
  },
  "MSS Jav 104": {
    "title": "Sejarah wali",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/FullDisplay.aspx?index=0&amp;ref=MSS_Jav_104",
    "scope": "An English note describes this as ‘Account of the proceedings of the Wali-Wali or Apostles who first established the faith of Islam on Java', while a Malay note says Ini kitab sĕjarah nabi-nabi dan doa-doa . A: ff. 1v.-32r. The first part is a sĕjarah (written sejerah ) of prophets and wali in Danḍanggula metre. Then follows a text on sipat rong puluh , followed by an account of the proceedings of the meeting of the wali ; various ngelmu , donga (in Javanese), and martabat pitu . B: ff. 40-39. A Javanese text on ‘ilmu firasat (physiognomy). In Javanese language in Arabic ( pegon ) script, with the same peculiar orthography as in MSS Jav 43 (E).",
    "physical": "Dimensions: 300 x 220 mm. 43 folios; Javanese paper ( dluwang ). Ff. 33-8 and 41-3 are blank. 12 lines per page; black ink; in a large hand with a thick pen nib. Binding: Unbound. Stored in a buckram box."
  },
  "MSS Jav 11": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_11",
    "scope": "Carita Yusup , fragment ending abruptly in the fourth canto. This occupies ff. 10v-39v (RV pp. 36-74). Most of the pages in this volume are blank, with the exception of ff. 30v-33r (written in the volume upside down) (RV pp. 98-103 and 378-83), Qur'ānic sūras; and f. 40v (p. 402), a letter beginning sĕrat pratanda Raden Tumĕnggung Mĕrtanĕgara ing kapalĕnggah nĕgaridalĕm ing Wirasaba and dated 19 Jumadilakir A.J. 1730 [6 Oct. A.D. 1803]. In Javanese language and script. In verse; 42 cantos.",
    "physical": "Dimensions: 255 x 190 mm. 41 numbered folios; Javanese paper ( dluwang ). 13 lines of cursive script; black ink. In addition there are 176 unnumbered blank folios of dluwang which have not been digitised. Decoration: Doodled wayang figures on f. 1v; double frames in black ink around empty text boxes on ff. 38v-39r; sketches of a tree on f. 39v, and of a figure on f. 40r. Binding: rebound in the British Library in 1993 in a full brown leather binding, with on the front one original Javanese brown leather cover, with stamped frames and ornaments, and with the back cover decorated in emulation of the Javanese style."
  },
  "MSS Jav 12": {
    "title": "Sukma Ngumbara",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_12",
    "scope": "A: ff. 1v-106v. Described in the 2nd verse as Jaya Lĕngkara Wulang . The story in which the didactic passages are embedded, however, narrates the story of Sukma Ngumbara . The story corresponds to the second part of Leiden Or 1801 as summarized in Vreede, 1892, pp. 277-80. Weatherbee says that the MS is not specifically connected with the Java Lĕngkara of MSS Jav. 24, but it does confirm as suggested at the end of MSS Jav. 24 that the Sukma Ngumbara text was literarily independent of the first part of the Jaya Lĕngkara. A pencilled note on the flyleaf indicates that MSS Jav. 12 was copied by Rawijah. In verse; 40 cantos. A very poor English translation is in Mackenzie 1822 collection 26 pt. 1 (Blagden, 1916, p. 23). B: ff. 109r-119r. Punika sĕrat sĕjarah Rasulullah Muhammat . A history of Sunan Giri in Javanese with an interlinear romanized Malay translation. Received from the Adipati of Grĕsik in April 1812. See van der Tuuk, 1849, p. 400. A transcription of the Malay text in Arabic script is in Leiden Or 3302, and was published and translated in Cabaton, 1906. An English translation is in Mackenzie 1822 collection 25 pt. 1 (Blagden, 1916, p. 21). In Javanese language and script, and Malay in Romanised script.",
    "physical": "Dimensions: 225 x 140 mm. 119 ff.. A: European paper. Black ink; 15 lines per page; decorative canto markers; quadratic script. B: Probably Chinese paper. Brown ink; 13 lines each of Javanese and Malay per page; sloping cursive script. Binding: Brown half leather binding with marbled paper boards."
  },
  "MSS Jav 13": {
    "title": "Sĕrat Rama",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_13",
    "scope": "Sĕrat Rama . Apparently complete. Apparently not the original of the English translation in Mackenzie 1822 collection 27 (Blagden, 1916, p. 26) according to Weatherbee. In Javanese language and script. In verse; 46 cantos.",
    "physical": "Dimensions: 275 x 200 mm. 161 folios; Javanese paper ( dluwang ). 15-16 lines per page; black ink. Binding: rebound in the British Library in 1993 using original Javanese black leather covers with stamped frames and ornaments."
  },
  "MSS Jav 14": {
    "title": "Sewaka",
    "language": "",
    "link": "",
    "scope": "Sewaka. Dated rĕtu nawa kawayang jalma [A.J. 1696/A.D. 1770]. The MS is decorated throughout and has illuminated double frames in gold, red, blue, green and orange on ff. 9v-10r and ff. 57v-58r. In Javanese language and script. In verse.",
    "physical": "Dimensions: 198 x 160 mm. 68 folios; European paper (ff. 7-62), with Javanese paper ( dluwang ) at beginning and end. 10 lines per page; black ink rubricated with red and gold. Binding: original brown leather Javanese binding with three frame bands, corner pieces and central medallion."
  },
  "MSS Jav 15": {
    "title": "Bratayuda kawi miring",
    "language": "",
    "link": "",
    "scope": "Bratayuda kawi miring. Incomplete, ending at Canto XXI: 10. Described in Cohen Stuart, 1862, p. 149. When this MS was catalogued in Ricklefs and Voorhoeve (1977: 59), they noted: \"Loose in the volume is a short summary in Malay written in Javanese script beginning, ini sri Bratayuda kĕtika Raja Pandawa . Also loose in the volume is an envelope containing a leaf which begins, pengĕt ing sĕrat parentah Mas Panji Jayengasmara , dated 19 Bĕsar A.J. 1729 [12 April A.D. 1803].\" Unfortunately both those inserts are no longer present in the volume, perhaps lost during rebinding ca. 2000. In Javanese language and script.",
    "physical": "Dimensions: 260 x 205 mm. 170 folios; Dutch paper, watermarked 'J Honig' (f. 170). Black ink, 13 lines per page. Binding: new half brown leather with old marbled paper boards, rebound in the BL in ca. 2000."
  },
  "MSS Jav 16": {
    "title": "Sĕrat Rama",
    "language": "",
    "link": "",
    "scope": "Sĕrat Rama. Ornamented manuscript with elaborate opening double decorated frames on ff. [i]v-1r. In Javanese language and script. In verse; 57 cantos.",
    "physical": "Dimensions: 310 x 190 mm. 140 folios; thin Chinese paper. Black ink, with rubication, 20 lines per page. The text begins one page before f. 1r. Binding: original Mackenzie Ferris 1815 Calcutta binding of brown half-leather with marbled paper boards, front cover now loose."
  },
  "MSS Jav 17": {
    "title": "Panji Angreni",
    "language": "",
    "link": "",
    "scope": "A: pp. 14-257 [ff. 7v-128r]. Panji Angreni . In verse; 50 cantos. Black ink; 21 lines per page. B: pp. 279-555 [ff. 138v-277r]. Angling Darma . In verse; 90 cantos. Brown ink; 29 lines per page. The original from which this MS was copied was done in Sĕmarang by Mĕrtadirana and was begun on 8 Ruwah sapta guna ratu jalma . This gives A.H. 1137 [A.D. 1724], but Weatherbee believes this is too early and moreover is inconsistent with the other elements of the date; perhaps it is a mistake for A.J. 1731 [11 Nov. A.D. 1804]. Both texts are profusely illustrated with outline sketches in wayang style; text and images in Angling Darma are embellished with red ink. In Javanese language and script.",
    "physical": "Dimensions: 260 x 230 mm. 278 folios; Chinese paper with evident brushstrokes, with two red ink stamps of the paper merchant on f. 10v, one depicting a man, and one inscribed ‘Guangdong … superior paper … city, Gate of Supreme Peace … ’. A loose leaf of Javanese paper with writing has been numbered f. 279. Binding: new half brown leather with old marbled paper boards, rebound in the BL in ca . 2000; probably a refurbished Mackenzie Ferris 1815 binding from Calcutta, with the original marbled paper boards."
  },
  "MSS Jav 18": {
    "title": "Paniti Sastra",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_18",
    "scope": "Paniti Sastra , a compilation of synonyms. Each page is ruled with pencil into 35 small squares. The text begins one page before f. 1r. On flyleaf: sangking cariyos pitutur sĕrat Paniti Sastra . Given to Mackenzie by Sura Adimanggala (of Sĕmarang) and dated A.J. 1739 [A.D. 1812]. An English translation dated March 1820 is in Mackenzie 1822 collection 26 pt. 2 (Blagden, 1916, p. 25). In Javanese language and script.",
    "physical": "Dimensions: 300 x 215 mm. 75 folios; thick cream paper with no evident chain lines. Brown ink. Binding: new half brown leather with new marbled paper boards, rebound in the BL in ca . 2000; probably replaces a Mackenzie Ferris 1815 binding from Calcutta, also originally half brown leather with marbled paper boards."
  },
  "MSS Jav 19": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_19",
    "scope": "Wayang texts: A: ff. 3v-29v (RV pp. 2-53). Anĕnggih punika nĕgari ing Dwarawati . B: ff. 30r-46r (RV pp. 54-95). Punika nĕgari Ngastina ; there are many amendments and additions on small pieces of paper stitched on. (NB f. 40 was originally stitched over the underlying f. 40a to obsure and replace it, but was separated to enable f. 40a to be digitised in 2018). ff. 47r-48v. Text written parallel to the spine. C: ff. 49r-67r (RV pp. 102-37). Anĕnggih punika wadyabala ing Ngastina . This text is preceded by the note, punika pemut kala Kangjĕng Gusti Pangeran Adipati Anom Amĕngkunĕgara ingkang sudibya raja putra Narendra Mataram [the Crown Prince, probably of Yogyakarta, later Sultan Hamĕngkubuwana II] and the date 10 Bĕsar bĕrmana sirna . . . jagat [AJ. 1707/17 Nov. A.D. 1781]. D: ff. 68r-121r (RV pp. 141-247). Punika jĕjĕr Wirata . On Javanese paper. E: ff. 122r-153v (RV pp. 251-328). Punika garwanira Raden Klana Jayakusuma . F: ff. 154r-175v (RV pp. 330-72). Punika nĕgari ing Ngastina . A colophon dates the finishing of the copy on 17 Sura A.J. 1709 [2 Jan. A.D. 1782]. A badly faded pencilled note on the flyleaf reads ‘Col W . . . n' and Weatherbee suggests this confirms a Yogyakarta origin. In Javanese language and script.",
    "physical": "Dimensions: 290 x 220 mm. 176 folios; Dutch paper, watermarked ' ... Zoonen'. C is on Javanese paper. Various number of lines; black ink. Many small amendments and corrections are made to the text, with small pieces of paper glued or stitched to the appropriate position. Binding: half brown leather binding with marbled boards."
  },
  "MSS Jav 2": {
    "title": "Sewaka",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_2",
    "scope": "Sewaka Presented to Mackenzie by Sura Adimanggala at Sĕmarang on 15 Rabingulawal A.J. 1739 [29 March A.D. 1812]. In Javanese language and script.",
    "physical": "Dimensions: 270 x 195 mm. 152 pp; thick European paper. Brown ink; 5 lines per page, set in ruled pencil frames. The MS has been bound with the writing only on the verso of each folio. Binding: Modern brown quarter leather and buckram binding."
  },
  "MSS Jav 20": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_20",
    "scope": "Wayang texts, in Javanese language and script. Containing at least seven sections: A: ff. 1-49 (RV pp. 4-100). Punika kagĕngan-dalĕm kanḍa jĕjĕr Giling Wĕsi saditĕnipun . B: ff. 50-105 (RV pp. 104-208). Punika jĕjĕr Giling Wĕsi . C: ff. 107-148 (RV pp. 212-300). Punika jĕjĕr Giling Wĕsi . D: ff. 149-152 (RV pp. 307-34). Punika kawin jĕjĕr Ngastina . E: ff. 153-196 (RV pp. 339-86). Punika kawin jĕjĕr Ngambar Kumala . F: ff. 198-222 (RV pp. 392-438). Punika kawin Ratu Wirata . G: ff. 225-262 (RV pp. 448-60). Punika kagĕngandalĕm kanḍa jĕjĕr Ngambar Kumala .",
    "physical": "Dimensions: 275 x 215 mm. 263 ff.; Javanese paper ( dluwang ), but with English endpapers, watermarked 'S &amp; C Wise' '1811'. 15 lines per page, in a cursive hand, black ink. Dry-ruled guidelines. Very many folios have textual corrections and additions, either marked onto the page itself, or when necessary, added on a separate piece of paper that has then been sewn with thread to the precise spot of the textual amendment. Each of these small pieces of paper has been foliated with the letter 'a' (etc.) added to the folio number to which it is attached. Binding: Modern full leather binding (one original dark brown leather board, with stamped ornamental frames and medallions, is stored alongside the MS in the box)."
  },
  "MSS Jav 21": {
    "title": "Sajarah ing Para Nabi",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_21",
    "scope": "A: ff. 8v-9r (RV pp. 18-19). A badly smudged poem dated 28 Rabingulawal tri jalma syaraning rat [A.J. 1713/18 Jan. A.D. 1787]. B: ff. 9v-159v (RV pp. 20-324). Sajarah ing Para Nabi . A Malay note in Javanese script at the top of the first page says, inilah cĕrita dari sĕgala turun turunanya para nabi samuwah, dinamakĕn cĕrita sĕjarah namanya, dimulakĕn dari kutikanya Nabi Adam diturunkĕn dari dalĕm swarga turun di dunya . In verse; 40 cantos. ff. 160v-161r: sketches of wayang figures, in black ink. [Upside down]. C: f. 161v (RV p. 502). A fragment beginning babad tutur sĕkar Madumanis, Pangeran Dipati Mĕngkunĕgara , dated 2 Sura ardi tu[ng]gal kuda ngrat [AJ. 1717/12 Sept. A.D. 1790]. [Upside down]. In Javanese language and script.",
    "physical": "Dimensions: 210 x 220 mm. 161 numbered folios; Javanese paper ( dluwang ). 15 lines per page of Central Javanese cursive script; black ink, with rubrication. Between ff. 159 and 160 are 88 blank unnumbered folios, which have not been digitised. Binding: refurbished in the British Library bindery in 1993, in half brown leather binding, with original marbled boards."
  },
  "MSS Jav 22": {
    "title": "Babad Mataram",
    "language": "",
    "link": "",
    "scope": "Babad Mataram , ending abruptly during Senapati's siege of Pasuruhan. Dated 26 Sapar A.J. 1735 [25 April A.D. 1808]. The text is on ff. 5v-102r. Endpapers of Javanese paper with many notes (ff. 2-3 written upside down) and sketches on ff. 104r, 104v, 105v. On one of the Javanese endpapers is a fragment beginning angguguk denira miyarsa, sang sri maha nurwan ngadil , and dated A.H. 1225 [A.D. 1810]. In Javanese language and script. In verse; 38 cantos.",
    "physical": "Dimensions: 300 x 200 mm. 106 folios; Italian paper, watermarked 'Gior Magnani' and 'Almasso', with Javanese paper ( dluwang ) endpapers. Binding: new half brown leather with old marbled paper boards, rebound in the BL in ca. 2000, probably renovating an early Mackenzie Ferris 1815 Calcutta binding also of half brown leather, keeping the original marbled paper boards."
  },
  "MSS Jav 23": {
    "title": "A wayang gĕdog text and Bratayuda kawi miring",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_23",
    "scope": "A: ff. 1v-105v. A wayang gĕdog text, with many editorial emendations, including on extra pieces of paper sewn into the appropriate place in the text. B: ff. 107v-124r. Bratayuda kawi miring , containing six\ncantos. In Javanese language and script. In verse.",
    "physical": "Dimensions: 265 x 210 mm. 124 folios; European paper, with some Javanese paper ( dluwang ) inserts. Black ink, 16-17 lines per page. Binding: original Mackenzie 1815 Ferris binding from Calcutta, half brown leather with marbled paper boards."
  },
  "MSS Jav 24": {
    "title": "Serat Jaya Lengkara Wulang",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_24",
    "scope": "The story of Jaya Lengkara Wulan. The narrative ends with Jaya Lengkara ascending the throne of Sonya Wibawa with the title Prabu Surya Dipaningrat. In a kind of epilogue it is stated that the kanda Sukma Ngumbara is the sequel (see MSS Jav 12). Handsomely ornamented with an elaborate frontispiece, ornate polychrome frames setting off the didactic passages, and gold and red filling of the interpunctuation throughout. In Javanese language and script. In verse; 93 cantos. Written in the court of the Sultan [Hamengkubuwana II] of Yogyakarta ( Kanjeng Sultan ing Ngayogya ) on 22 Rejeb A.J.1730 (7 Nov. 1803).",
    "physical": "Dimensions: 325 x 200 mm. 17 lines per page, black ink with red diacritics, and illuminated canto and stanza markers. Dutch paper, watermarks 'D &amp; C Blauw', 'Pro Patria'. Finely illuminated frames in colours and gold, with double frames on ff.2v-3r, ff.30v-31r, ff.171v-172r (unfinished) and ff.203v-204r (unfinished), and many other half-page frames. Half leather binding with marbled paper boards."
  },
  "MSS Jav 25": {
    "title": "Bhāratayuddha",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_25",
    "scope": "Bhāratayuddha , in Old Javanese in Balinese script written in black ink, with an interlinear Modern Javanese version written in red ink. Text on ff. 6v-110v. Dated at the beginning 8 Rabingulakir muka tri mahapandita buwana, sir ah 9, tĕnggĕk 3 [A.J. 1739/21 April A.D. 1812], and at the end 19 Saban A.J. 1739 [28 Aug. A.D. 1812]. Sent to Mackenzie ‘by the son of the Panamhehan [Panĕmbahan] of Samanap [Sumĕnĕp], vide letter from [Robert C.] Garnham [Resident of Sumĕnĕp], Sept. 1812’.",
    "physical": "Dimensions: 315 x 190 mm. 122 folios; English paper, watermarked 'T Edmonds 1809'. 9 lines in black ink and 9 lines in red ink per page. Stamped foliation. Binding: new half brown leather with old marbled paper boards, rebound in the BL in ca . 2000; probably a refurbished Mackenzie Ferris 1815 binding from Calcutta, with the original marbled paper boards."
  },
  "MSS Jav 26": {
    "title": "Asmara Supi",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_26",
    "scope": "A: ff. 6v-51v (RV pp. 10-100). Asmara Supi , incomplete. The text was copied under the patronage of the Yogyakarta crown Prince ( raja putra ning nalendra sinuhun ing ngayogyakarta adiningrat mataram ) [later Sultan Hamĕngkubuwana II], and is dated 1 Jumadilakir buta sanga ngoyag jagat [A.J. 1695/2 Oct. A.D. 1769]. In verse; 23 cantos. B: ff. 53r-84v (RV pp. 104-64). Sandi sastra, sandi sutra , etc., fragments. In Javanese language and script.",
    "physical": "Dimensions: 270 x 210 mm. 86 ff; Dutch paper: ‘D &amp; C Blauw'. 15 lines of cursive script; black ink. Binding: half brown leather binding with marbled boards."
  },
  "MSS Jav 27": {
    "title": "Jati Kusuma",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_27",
    "scope": "A: ff. 6v-63v (RV pp. 10-124). Jati Kusuma , incomplete. Dated 5 Jumadilawal karna trusta ngayog jagad [A.J. 1692/9 Oct. A.D. 1766]. In verse; 23 cantos. B: ff. 69v-166v (RV pp. 138-332). Sĕrat jantur Ringgit Purwa ; ff. 149-159 bound upside down. In Javanese language and script.",
    "physical": "Dimensions: 280 x 200 mm. 166 folios; Javanese paper ( dluwang ). Initial flyleaves of English paper, 'W &amp; T Chandler 1809'. 15-16 lines per page of quadratic script; black ink, with some rubrication in B. Binding: modern half brown leather binding with buckram boards."
  },
  "MSS Jav 28": {
    "title": "Serat Selarasa",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_28",
    "scope": "Sela Rasa. Dated 24 Sapar AJ. 1731 [4 June A.D. 1804]. The original owner of the MS is noted at the top of the first page: punika sĕrat kagunganipun nyonya Sakebĕr [ gezaghebber , or perhaps Madame Schaber of Surabaya]. Javanese language and script. In verse; 41 cantos. The text is distinguished by many fine polychrome wayang-style illustrations throughout, with an elaborate frontispiece. Mackenzie received the MS from Rothenbühler at Surabaya in Feb. 1812. In origin, format, and style it is identical to MSS Jav. 68.",
    "physical": "Dimensions: 310 x 200 mm. Dutch paper, watermarks: 'J Honig &amp; Zoonen', 'J H &amp; Z', 'ProPatria'; well-thumbed. 19 lines per page; black ink with gold highlights. Modern half-calf binding."
  },
  "MSS Jav 29": {
    "title": "Babad Jawi",
    "language": "",
    "link": "",
    "scope": "Babad Jawi. Ending in the Kartasura period. Dated (for the original) 23 Ramĕlan suci kadya panditaning nata [A.J. 1734/24 Nov. A.D. 1807]. The MS was presented to Mackenzie by Kyahi Dipati Lasĕm Yudanagara, whose meeting with Mackenzie is dated in the text 11 Rabingulakir AJ. 1739 [24 April A.D. 1812]. In Javanese language and script. In verse.",
    "physical": "Dimensions: 285 x 190 mm. 556 folios; thin Chinese paper. Black ink, 19 lines per page. Some textual corrections in the margins of the pages have been carefully cut and folded over to preserve them, probably during the trimming of the pages for rebinding in Calcutta. Binding: original Mackenzie 1815 Ferris binding from Calcutta of half brown leather with marbled paper boards; front cover now loose."
  },
  "MSS Jav 3": {
    "title": "Nagara Krama",
    "language": "",
    "link": "",
    "scope": "Nagara Krama Presented to Mackenzie by Sura Adimanggala at Sĕmarang on 15 Rabingulawal A.J. 1739 [29 March A.D. 1812]. In Javanese language and script.",
    "physical": "Dimensions: 270 x 195 mm. 152 pp; thick European paper. Brown ink; 5 lines per page, set in ruled pencil frames. The MS has been bound with the writing only on the verso of each folio. Binding: Modern brown quarter leather and buckram binding."
  },
  "MSS Jav 30": {
    "title": "Suluk and other texts",
    "language": "",
    "link": "",
    "scope": "Suluk and other texts. [This description from Ricklefs &amp; Voorhoeve (1977: 61), before the volume was foliated; current folio numbers have now been added to the description of contents.] A: pp. 6-109 [ff. 1v-52r]. A suluk dated 6 Ruwah A.J. 1665 [26 Oct. A.D. 1740]. European paper. B: pp. 110-72 [ff. 52v-83r]. A suluk . European paper. C: pp. 176-86 [ff. 84r-90v]. Described by Mackenzie as ‘List of all the kreeses [kriscs] and the names of the people who made them'. Dated, but without the year. Dutch paper, watermarked '[Ho]nig' (f. 84) and 'Z[oon]' (f. 91). C1: ff. 96r-103r. Described by a Dutch note as histories of the first keris named Kie Pengarit and other old kerises of the Susuhunan [this description not included in RV]. D: pp. 190-236 [ff. 104r-127v]. Described by a Dutch note as a list of the gifts given by the Susuhunan and his family on the occasion of the marriage of Raden 'Soema Widjaya'. The text begins, punika pemut dawĕg kramanipun Bĕndara Raden Sumawiwaha . Javanese paper. E: pp. 245-60 [ff. 132r- 140v]. A primbon containing rajah and tamba ; a tract on medicine and magic in antique script. European paper, with writing parallel to the spine of the book; many magical diagrams. In Javanese language and script.",
    "physical": "Dimensions: 220 x 150 mm. 140 folios; various papers. Original MS of parts A and B evidently much damaged, now repaired and re-margined with paper. Binding: half brown leather with marbled paper boards, rebound in the BL in ca. 2000, probably replacing an early Mackenzie Ferris 1815 Calcutta binding also of half brown leather with marbled paper boards."
  },
  "MSS Jav 31": {
    "title": "Sajarah Sumĕnĕp",
    "language": "",
    "link": "",
    "scope": "Sajarah Sumĕnĕp. Begins, punika sajaranira wong agung Sumĕnĕp . Said to be ‘from the Panambahan's\n[Panĕmbahan's] son at Sumanap [Sumĕnĕp] in Madura March 1812'. F. 2 is a fold-out genealogical chart descending from Brawijaya Majapahit , in Arabic (pegon) script. In Javanese language and script. In verse.",
    "physical": "Dimensions: 240 x 165 mm. 147 folios; Javanese paper (dluwang). Black ink, 13 lines per page, set within text frames of three ruled black lines. Some doodles on first and last folios. Binding: refurbished Mackenzie 1815 Ferris binding from Calcutta, with new half brown leather with original marbled paper boards."
  },
  "MSS Jav 32": {
    "title": "Damar Wulan",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_32",
    "scope": "Damar Wulan . Incomplete, both beginning and end being missing. The first complete verse mentions Ratu Ayu Kĕncanawungu and Raden Kudasuwarna. In Javanese language and script. In verse; 13 cantos.",
    "physical": "Dimensions: 255 x 185 mm. 79 folios; thick European paper, watermark (a crown) visible near gutter. Very stained pages. Initial flyleaves of English paper, 'S Wise &amp; Patch 1808'. 21 lines per page of cursivescript; black ink. Binding: half brown leather binding with marbled paper boards, refurbished in the British Library bindery in 1992; fore edge, head and tail are stained blue"
  },
  "MSS Jav 33": {
    "title": "Sajarah sagung ing para Ratu",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_33",
    "scope": "Sajarah sagung ing para Ratu . The text is identical to MSS Jav. 10. It begins with Adam and ends with Senapati's suppression of the Pati revolt. MSS Jav. 33 is, however, older by three decades than MSS Jav. 10, being dated 11 Sawal gapura naga kawayang jalma [AJ. 1689/12 May A.D. 1764]. This makes it the oldest babad in the Mackenzie collection and one of the oldest extant. Weatherbee suggests that this MS is probably from Yogyakarta. In Javanese language and script. In verse; 42 cantos.",
    "physical": "Dimensions: 265 x 140 mm. 188 folios; thick European paper, watermark 'SCK'. Very stained pages. Initial flyleaves of English paper, 'Budgen &amp; Willmott 1808'. 18 lines per page of small Central Javanese script; black ink. Mistar lines can be seen on ff. 7-8. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head band (now broken)."
  },
  "MSS Jav 34": {
    "title": "Wayang Gĕdog texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_34",
    "scope": "Wayang Gĕdog texts. There seem to be at least two texts, on ff. 5v-111r (RV pp. 8-217), and ff. 112v-144v (RV pp. 220-84). A note on the flyleaf mentions Mr. Krijgsman, which would indicate a Yogyakarta provenance. texts. In Javanese language and script.",
    "physical": "Dimensions: 265 x 210 mm. 144 folios; thick Dutch paper, watermark 'C &amp; I Honig'. Initial flyleaves of English paper, 'J Whatman', '1812', '1807'. 16-17 lines per page of quadratic script; black ink. Many textual additions, on various papers of various sizes, sewn or glued onto folios. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands."
  },
  "MSS Jav 35": {
    "title": "Ahmad-Muhammad",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_35",
    "scope": "Ahmad-Muhammad. Beginning and end are missing and the remaining text is damaged and badly stained. Marginal insertions outside the text indicate that the MS came from Yogyakarta, mentioning for example the full title of the crown prince of Yogyakarta. There is an incomplete date outside the text (on p. 128) mentioning 13 Mulud in the year Dal. Weatherbee suggests that this gives a terminus ad quern for the MS of A.J. 1711 [A.D. 1785], but this is based upon an assumption that the crown prince mentioned was the first crown prince (later Sultan Hamĕngkuhuwana II), which was not necessarily the case. The Dal year referred to could he as late as A.J. 1735/A.D. 1808. In Javanese language and script. In verse; 20 cantos.",
    "physical": "Dimensions: 260 x 175 mm. 67 folios; thick European paper, very severely stained. Initial flyleaves of English paper, 'S &amp; C Wise, '1811'. 15 lines per page; black ink. Decoration: wayang doodles on f. 5r; belt buckle ( pending ) ornaments on f. 21r; floral marginal ornaments on f. 56r. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped red and white head and tail bands."
  },
  "MSS Jav 36": {
    "title": "Babad Mataram and Babad ing Sangkala",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_36",
    "scope": "In two volumes: A: vol. i, ff. 1-216; vol. ii, ff. 217-348v. Babad Mataram . The text begins with Senapati and Sultan Pajang. According to Kouznetsova (2002: 64), MSS Jav 36 A 'presents a consistent and uninterrupted narrative in 63 cantos about the history of Mataram from Senapati's appointment as the ruler of Mataram to the fall of the kraton of Mataram in Plered in 1677', and the ending is complete. It ends with the fall of Mataram in A.J. 1600 [A.D. 1677]. In verse. Pages are missing at the beginning. The MS is misbound; some folios are bound upside down; and on ff. 17r.-17v. is found the episode concerning the death of Kyai Agĕng Mataram (the father of Senapati). Still earlier portions may also be found in the MS on ff. 67 and 68, but it has not been possible to locate a beginning of the text. According to Kouznetsova, ff. 31 and 42 should be interchanged, and also ff. 212 and 223. B: vol. ii, ff. 349v-373v. Babad ing Sangkala . A babad sĕngkala , ending with the date buta warna rasa tunggil [A.J. 1645/A.D. 1720]. It is dated Dal, guna ning nami kawayang ing sujalma [A.J. 1663/A.D. 1738]. An edition and translation of this text has been published by M. C. Ricklefs (1978). C: vol. ii, ff. 374r-381v. Illustrations from a pawukon , in gold, red, blue, green, yellow and black. A pencilled note on the flyleaf of vol. i by Mackenzie reads, ‘Djogjakarta MS examined by Mr. Krygsman June 1812’. In Javanese language and script.",
    "physical": "Dimensions: 260 x 175 mm. 386 folios; Dutch paper, 'LVG'. Flyleaves (ff. 2-5, 212-6, 217-221, 382-6) of English paper, 'W &amp; T Chandler 1809', 'S &amp; C Wise', '1810'. 15 lines of cursive script per page, black ink, ff. 6-162, 236-243 set in ruled frames of black ink (one outer line and two inner lines). Decoration: ff. 374r-381v contain full page polychrome illustrations from a pawukon . Binding: two volumes, in modern half brown leather binding with backram boards and marbled endpapers, rebound in the IOL bindery probably in the 1970s. Ff. 2r and 220f contain a note: 'Bound by Mr Ferris January 1815', but no trace of the original binding is found. Edges of folios stained blue."
  },
  "MSS Jav 37": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_37",
    "scope": "Wayang texts, at least four sections: A: ff. 2v-23r (RV pp. 6-44). Punika kawinipun Ratu Dwarawati . B: ff. 23v-51v (RV pp. 52-100). Punika kawinipun Ratu Ngastina . C: ff. 54v-95v (RV pp. 106-90). Punika kawin ing Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . D: ff. 112v-158v (RV pp. 228-319). Punika kawin Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . In Javanese language and script.",
    "physical": "Dimensions: 215 x 130 mm. 160 folios; Dutch paper, 'J Honig &amp; Zoonen'. 13 lines of quadratic script per page; black ink. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands (head band now lost)."
  },
  "MSS Jav 38": {
    "title": "Wayang and other texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_38",
    "scope": "Wayang and other texts A: ff. 4r-174v (RV: pp. 5-353). Punika kagĕngandalĕm kawin wiwit jĕjĕr Giling Wĕsi . Wayang text. B: ff. 176r-232v (RV pp. 356-481). Punika kawin Ratu Wirata . Wayang text. The contents of this manuscript do not agree with the description in RV 1977: 62-63, based on Weatherbee [1973]: 18, as there are only 233 folios with writing on in this volume. Further contents listed in RV: C: pp. 490-564. Arjuna Sasrabahu (?), dated 2 Ramĕlan A.J. 1689 and A.H. 1177 [5 March A.D. 1764]. D: pp. 565-97. Niti Sruti , dated at the end 21 Ramĕlan A.J. 1689 [March A.D. 1764]. In Javanese language and script.",
    "physical": "Dimensions: 200 x 155 mm. 236 folios; European paper, watermarked 'Pro Patria'. 11-12 lines of various scripts per page; black ink. Decoration: black ink sketches of wayang figures on ff. 176r-178r. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands. Front board now detached; secured with string."
  },
  "MSS Jav 39": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_39",
    "scope": "Wayang and other texts A: ff. 2r-79v (RV pp. 5-160). Punika kagĕngandalĕm kawin purwa lampahan Danu Asmara . B: ff. 83r-166v (RV pp. 167-334). Wayang gĕdog text. C: ff. 168r-182r (RV pp. 337-61). Punika Sĕrat Agung Ringgit Gĕdog jĕjĕr Kadiri. D: ff. 182r-240v (RV pp. 363-486). Wayang gĕḍog text. In Javanese language and script.",
    "physical": "Dimensions: 205 x 160 mm. 240 folios; Dutch paper, 'Pro Patria'. English paper fly leaves, 'J Whatman'. 10-13 lines of quadratic script per page; black ink. Binding: modern half brown leather binding with marbled paper boards, rebound in the British Library in 1990s. Folios are bound on guards. Original marbled paper boards are stored alongside."
  },
  "MSS Jav 4": {
    "title": "Bratayuda kawi miring and other texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_4",
    "scope": "A: ff. 2v-71v (RV pp. 2-138). Bratayuda kawi miring . Complete. Copyist Wongsadirana of Tanggung. The original owner of the MS was Kangjĕng Raden Tumĕnggung Natayuda, a prominent noble of the Yogyakarta court. Dated Ehe, but without the year. Weatherbee suggests that the terminus ad quem is A.J. 1724 [A.D. 1797]. In verse; 52 cantos. Illuminated initial double frames on ff. 2v-3r in red, green, black and yellow. f. 71. Drawing of a wayang -style figure, two birds, building and tree, probably associated with a wuku ? The following contents are wayang texts: B: ff. 74v-169r (RV pp. 146-331). Punika pemut kagĕngan-dalĕm Sĕrat Kondo Purwa lampahan Danu Asmara . The text has two dates: 27 Sura bĕrmana ngĕmbara rĕsi buwana [A.J. 1708/12 Jan. A.D. 1782], and the date of this copy 12 Ruwah A.J. 1731 [16 Nov. A.D. 1804]. Ff. 82-85 are other documents bound in. C: ff. 177r-188v (RV pp. 346-69). Punika kagĕngandalĕm Sĕrat Konda bĕksan lawung ringgit . D: ff. 190v-275r (RV pp. 374-557). Punika kagĕngandalĕm Sĕrat Kanda Ringgit Purwa lampahan Prabu Wanodya . In Javanese language and script.",
    "physical": "Dimensions: 300 x 190 mm. 275 ff. Dutch paper, 'D &amp; C Blauw'; 'IV' (f. 127). 17 lines per page; black ink. Decoration: ff. 2v-3r illuminated double frames; f. 25 rubrication in yellow; ff. 26, 29 rubrication in red; f. 71r monochrome black ink drawing. Binding: half brown leather binding, with marbled paper boards; front cover now detached. Endpapers watermarked '1812'. Headbands of blue and white thread."
  },
  "MSS Jav 40": {
    "title": "Babad Kartasura",
    "language": "",
    "link": "",
    "scope": "Babad Kartasura Described by Mackenzie as ‘history of the Prince Truno Jaya [Trunajaya] and the Weerapatty [Surapati] until the elevation of Pangerang Pooger to the Emperor [Pangeran Pugĕr, Pakubuwana I (170319)]’. Begins, after a poem, carita babad tinĕlad nusya Jawa duk bĕdah ing Mĕtawis . Dated 26 Sapar guna pinaka turongga jalma [A.J. 1723/ 31 Aug. A.D. 1796]. An entry on the flyleaf states that the MS came from Rothenbuhler at Surabaya. This may be the original of the English translation in Mackenzie 1822 collection 21 (Blagden, 1916, p. 16). In Javanese language and script. In verse; 39 cantos.",
    "physical": "Dimensions: 200 x 160 mm. 406 pp; Dutch paper, watermarked 'Pro Patria', with endpapers only of Javanese paper (cf. Ricklefs &amp; Voorhoeve 1977: 63, where it is stated that this manuscript is written on Javanese paper). 13 lines of script per page; black ink. Decoration: illuminated opening double frames on ff. 4v-5r in red, blue, yellow and black ink; rubricated in red ink, with some elaborate floral or zoomorphic canto markers. Binding: half brown leather binding with marbled paper boards."
  },
  "MSS Jav 41": {
    "title": "Primbon",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_41",
    "scope": "A collection of primbon , bound together to make a single volume. The description of the contents below is taken from Ricklefs &amp; Voorhoeve 1977: 63-64. At the time the MS was unfoliated, and so in this catalogue entry the current foliation is given first, with reference to the RV foliation in brackets. A: ff. 4v-40v (RV: E, 37 ff.). A Javanese tract with Arabic texts of prayers and formulae to be recited in ṣalāt . European paper, watermarked '...DARY'[?]. Black ink, with rubrication. Mackenzie's annotation: 'Manner of performing ablutions', but no Mackenzie number. B: ff. 42r-43r (RV: E, 4 ff.). A Javanese tract with Arabic texts of prayers and formulae to be recited in ṣalāt . Javanese paper. Mackenzie's annotation: 'Manner of performing ablutions', but no Mackenzie number. Thick European paper, watermarked '... ONGN' C: ff. 46v-146r (RV: D, 103 ff.). A copy of Sifat al-nabī in Arabic, Paras Nabi , amulets, etc. There is a note on f. 46r saying punika kagungan primbon Raden Tumĕnggung , but the name is not given. European paper. Mackenzie’s no. ‘p’. D: ff. 150v-158r (RV: C, 11 ff.). Sifat al-nabī in Arabic, cf. Voorhoeve, 1957, p. 336. Mackenzie’s no. ‘n’. Javanese paper; decorated frames in black ink on ff. 150v-151r; text set in double-ruled frames of black ink. E: ff. 160r-174v (RV: B, 16 ff.). The main text is a Javanese translation of Kitab Sittīn in Asmaradana metre, (cf. Voorhoeve, 1957, p. 342.) Javanese paper. Mackenzie's no. ‘u’. F: ff. 178v-236r (RV: A, 61 ff.). Various texts in various hands, the longest text is in Arabic ( salawāt ) with an incomplete interlinear Javanese translation. European paper. Mackenzie’s no. ‘t’. In Arabic and Javanese language and pegon (Arabic) script.",
    "physical": "Dimensions: 210 x 130 mm. 236 ff; various European and Javanese ( dluwang ) papers. Black ink. Binding: half brown leather binding with marbled paper boards. Outer edges stained blue. Red and white striped head and tail bands."
  },
  "MSS Jav 42": {
    "title": "Primbon",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_42",
    "scope": "A collection of primbon , bound together to make a single volume. This volume has been foliated as if it reads from left to right. The description of the contents below is taken from Ricklefs &amp; Voorhoeve 1977: 63-64. At the time the MS was unfoliated, and so in this catalogue entry the current foliation is given first, with reference to the RV foliation in brackets. A copyist named Kyahi Ngabehi Rĕsasĕntika of Yogyakarta is named, as well as Kangjĕng Gusti Pangeran Dipasana ingkang matĕdani sĕrat . A: ff. 16r-1r (RV: 16 ff.), bound upside down. Various notes, e.g. sirĕp , secret names of animals ( aran ing macan, aran ing kidang ). Mackenzie's no. ‘f'. B: ff. 26v-17v (RV: 12 ff). A Malay fragment on sĕmbahyang and puasa . C: ff. 36r-29v (RV: 8 ff). Mysticism; explanation of the name Muhammad (its letters being connected with those of the word Allah ). Mackenzie's no. ‘z’. D: ff. 53r-38v (RV: 16 ff), with a cover of Javanese paper. ‘Primbone’ [sic], containing texts on mysticism, etc. Mackenzie's no. ‘y’. E: ff. 65v-57r (RV: 10 ff). A text on chronology, and on the confession of faith. Mackenzie's no. ‘w’. F: ff. 106r-68v (RV: 38 ff)‚ with a cover of Javanese paper. ‘Primbone’, e.g. the magic names of iron and steel. At the end, the first part of a Shaṭṭārīyah silsilah in perpendicular Javanese script. Mackenzie's no. ‘v'. G: ff. 123r-113r (RV: 16 ff). ‘Primbone'. Mackenzie's no. 'r'. H: ff. 139v-127r (RV: 16 ff). ‘Primbone', e.g. donga and jimat . Mackenzie's no. ‘fs'. In Arabic, Malay and Javanese language and pegon (Arabic) script.",
    "physical": "Dimensions: 200 x 155 mm. 139 ff. The individual sections are written on Dutch paper, watermarked 'Pro Patre' (f. 3), 'Vryhyt' (f. 109), and have mostly been provided with title pages of Javanese paper ( dluwang ). Black ink, with rubrication in parts. Many mystical diagrams in black ink. Binding: half brown leather binding with marbled paper boards. Outer edges stained blue. Red and white striped head and tail bands."
  },
  "MSS Jav 43": {
    "title": "Primbon",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_43",
    "scope": "A collection of primbon , bound together to make a single volume. This volume has been foliated as if it reads from left to right. The description of the contents below is taken from Ricklefs &amp; Voorhoeve 1977: 63-64. At the time the MS was unfoliated, and so in this catalogue entry the current foliation is given first, with reference to the RV foliation in brackets. A: ff. 23r-1r. Javanese paper. Notes on various religious subjects, mainly about rūḥ ; a faṣl al-mudda‘ā ‘alayhi ; on ṣalāt ; an Arabic prayer; on laylat al-qadr . Mackenzie's no. ‘a’. B: ff. 24-74 (RV: 49 ff). Mackenzie's no. ‘b’. Eur paper: B 1: ff. 72v-71v (RV: ff. 4r.-3r). Fragment in Ḍanḍanggula metre. B 2: ff. 71r-54r (RV ff. 4v.-21v). Bayān mā lā budda minhu min alfurūḍ al-wājibāt, i.e. Kitab Sittīn (cf. MSS Jav. 41). Arabic text with Javanese translation. B 3: ff. 54r-42r (RV: ff. 21v-33v). A Javanese tract beginning wajib ingatas anak Adam tatkala manjing ngakil balig arĕp angucapakĕn ing kalimat sahadat roro. B 4: ff. 41v-21r (RV: ff. 34-48 and the last two leaves of A above). A juz’ of the Qur’ān in Arabic. C: ff. 75-89 (RV: 15 ff). Mackenzie's no. ‘g'. Eur paper: C 1: ff. 89v-81v (RV: ff. 1-9r). Incomplete Samarqandi in Arabic with interlinear Javanese translation. Cf. Voorhoeve, 1957, p. 44 (Bayān ‘aqīdat al-uṣūl). C 2: ff. 81r-75v (RV: ff. 9v-15r). Fifteen verses from the Qur’ān in Arabic with the Javanese title punika ayat gangsal wĕlas sarta do’ane. D: ff. 90-118 (RV: 29 ff). Coarse Chinese paper. Javanese text mostly on ṣalāt and the sayings of the walis. Mackenzie's no. ‘h‘. E: ff. 119-159 (RV: 41 ff). Javanese texts in pegon , but with strange orthography (cf. MSS Jav. 104). Mackenzie's no. ‘i’: E 1: f. 157v. Beginning punika qitab [sic] sampurnaneng iman. E 2: f. 152r (RV: f. 8v). Punika sajatineng wĕruh wahyāning idĕp. E 3: f. 145v (RV: f. 15r). Punika carita sakatah ing para wali sadaya sami ipagulĕman ana ing Giri Gejah. E 4: f. 138r (RV: f. 22v). Punika kitab sĕmpurnaning mangrifat anyatakĕn iku sadurungi ana jagat kabeh. E 5: f. 128r (RV: f. 32v). Dairahs. E 6: f. 126r (RV: f. 34v). Punika mas’alah dikir napas. E 7: f. 125r (RV: f. 35v). About kun payakun. The text ends on f. 41 r. F: ff. 160-172. Mackenzie's no. ‘m’, 'Primbone'. Text on ff.172r-166v. [Not listed in RV.] In Arabic and Javanese language and pegon (Arabic) script.",
    "physical": "Dimensions: 205 x 150 mm. 172 ff. The individual sections are mostly written on Dutch paper, with title pages of Javanese paper ( dluwang ). Black ink, with rubrication in parts. Some mystical diagrams in black ink. Binding: half brown leather binding with marbled paper boards. Outer edges stained blue. Red and white striped head and tail bands."
  },
  "MSS Jav 44": {
    "title": "Wayang gĕdog texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_44",
    "scope": "Wayang gĕdog texts: A: (RV: pp. 5-178). Wayang gĕdog text which begins after the invocation, anĕnggih punika wong agung ing Ngurawan . B: (RV: pp. 182-252). Wayang gĕdog text. C: (RV: pp. 255-326). Wayang gĕdog text, punika jĕjĕr Ngurawan . D: (RV: pp. 331-64). Punika sĕrat kagung ringgit gĕdog yen kala wiyosan Ratu wiwit sĕkar gangsal . In Javanese language and script.",
    "physical": "Dimensions: 215 x 130 mm. 143 folios; European paper, with one larger folio loose at the end. 13-14 lines of quadratic script per page; black ink. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands."
  },
  "MSS Jav 45": {
    "title": "Menak Amir Hamza",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_45",
    "scope": "Menak Amir Hamza. Copyist Mas Ajĕng Wongsaleksana of Jipang. Dated 9 Rabingulakir panca tri pandita jalma [AJ. I735 / 4 June A.D. 1808]. In Javanese language and script. In verse; 85 cantos. Text of Menak Amir Hamza on ff. 3v-201r; first two unnumbered folios, ff. 1r-3v, and ff. 205v-208r are filled with doodles in Javanese and Arabic (pegon) script, some upside down, including talismanic drawings of sanggar Siti Fatimah . On f. 2r there is a note by Mackenzie that the MS was received from Major Johnson, 21 June 1812 (the day after the fall of the Yogyakarta kraton). A beginning of an English translation is to be found in Mackenzie Private Collection 25 (Blagden, 1916, p. 21).",
    "physical": "Dimensions: 270 x 200 mm. 208 folios. Javanese paper ( dluwang ). 15-18 lines per page, black ink. Binding: rebound in the British Library in 1992 in a full brown leather binding, reusing the original Javanese brown leather back cover, with stamped frames and ornaments; front cover also with stamped frames and ornaments in emulation of the Javanese style."
  },
  "MSS Jav 46": {
    "title": "Arjuna Sasrabahu",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_46",
    "scope": "Arjuna Sasrabahu Copied in Yogyakarta by Raden Prawira Atmaja, dated 6 Rabingulakir prawata karni turangga rupa [A.J. 1727/27 Aug. A.D. 1800]. In verse; 59 cantos. On pp. 405-16 is a fragment of a katuranggan ing pĕksi also by Raden Prawira Atmaja, dated 4 Rabingulakir A.J. 1727 [25 Aug. A.D. 1800]. In verse; 4 cantos. In Javanese language and script.",
    "physical": "Dimensions: 260 x 200 mm. Javanese paper ( dluwang ). Black ink; 17 lines per page. Binding: original Javanese binding of dark brown leather, with six stamped frames, corner pieces and central medallion. If it ever had an Islamic style envelope flap, this is no longer present. Modern BL brown leather spine."
  },
  "MSS Jav 47": {
    "title": "Babad ing Narendra",
    "language": "",
    "link": "",
    "scope": "Babad ing Narendra. Begins with the mythical ancestors of the Mataram dynasty, Jaka Tarub and Nawang Wulan, Ends in the reign of Amangkurat I (A.D. 1666). In Javanese language and script. In verse; 43 cantos.",
    "physical": "Dimensions: 275 x 215 mm. 248 folios; European paper, watermarked 'L V G'. Black ink, 13 lines per page. Binding: new plain brown full leather binding, bound in the British Library in 1995. Housed in a brown buckram box together with the original Javanese binding, with two covers with five stamped frame bands, corner piece and central medallions; original sewn head and tail bands and spine; and original doublure, with text in Javanese in Javanese script on one side and Arabic script on the other side, all encased in melinex."
  },
  "MSS Jav 48": {
    "title": "Kidung Lalĕmbut",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_48",
    "scope": "A version of Kidung Lalĕmbut occupies ff. 2v.-19v. In verse. Thereafter, fragmentary texts, with some diagrams, mostly of a religious nature; some chronological notes. The text on ff. 20v-36r is written upside down. The main volume comprises 90 ff.; there are also five detached pieces of Javanese paper with notes, now numbered ff. 91-95. In Javanese language and script; ff. 35v-36r in Arabic ( pegon ) script.",
    "physical": "Dimensions: 170 x 100 mm. 95 ff, Javanese paper (dluwang). Black ink; 10-13 lines per page, in a variety of different hands. Binding: in poor condition, covers detached. Original Javanese binding of dark brown leather, with four stamped frame bands, top and bottom pieces and central medallion."
  },
  "MSS Jav 49": {
    "title": "Babad Kartasura",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_49",
    "scope": "Babad Kartasura. Begins early in the reign of Amangkurat II. c. 1678-80, and ends with the battle of Kalĕpu (1720). Copyist Raden Pringgakusuma, according to a note external to the text. Dated at the beginning 20 Jumadilakir boma taka saptaneng pratiwi [A.J. 1700/28 Aug. A.D. 1774], and in the colophon 27 Muharram panĕmbah ing boma gora bantala [AJ. 1702/18 March A.D. I776]. Annotated: 'History of Amanakourat Soosoohoonan of Souracarta in Java'. An English translation is in Mackenzie 1822 collection 23 (Blagden, 1916, p. 18). In Javanese language and script. In verse; 58 cantos.",
    "physical": "Dimensions: 270 x 210 mm. 301 ff, heavy cream Dutch paper, watermarked: ‘JH &amp; Zoon'. Black ink, in a clear, strong, hand; 17 lines per page. Back end papers of dluwang . Binding: in poor condition, all parts detached. Original Javanese front cover of dark brown leather, with five stamped frame bands, corner pieces and central medallion; back cover is very abraded."
  },
  "MSS Jav 5": {
    "title": "Vocabulary in Javanese, English, and Dutch",
    "language": "",
    "link": "",
    "scope": "‘Vocabulary or dialogues Javanese, English, and Dutch'. Heading on f. 1r: 'Woorden der Hollandsche en Javaansche Taale'. Approximately 7,000 entries. The first 3 pages give Dutch, English, and two registers of Javanese in both Javanese and Roman script; thereafter only Javanese script is used, while the English ends on p. 89. ‘Present from Mr. Princen, Aug 12th 1812, to Colin Mackenzie.'",
    "physical": "Dimensions: 315 x 195 mm. 189 ff.; thick Dutch paper, watermarked 'D &amp; C BLAUW'. Binding: full red leather binding. Printed coloured floral paper doublures and endpages."
  },
  "MSS Jav 50": {
    "title": "A collection of primbons",
    "language": "",
    "link": "",
    "scope": "A collection of primbons bound together to make a single volume: A: 24 ff. Texts in Malay with vowel signs; the language shows some Javanese peculiarities, owner Baba Salihin kampung Mataram(an). Eur paper. Beginning: do‘a , dairah , etc., some in red ink. On f. 6v. are three fish with one head, as in Pigeaud, 1967-70, plate 8. On f. 7v. begins a Shaṭṭārīya pedigree of masters, beginning bĕrmula inilah kitab pada mĕnyatakakĕn turun-turun jalan Shaṭāriyah yang tĕdak dari Rasulullah . It ends with Shaikh Abdurrauf yang anak ‘Ali yang bangsa Shaikh Hamzah Fanṣūr dĕngan Singkil nĕgĕrinya— Haji ‘Abdulmuḥyi, Karang—his son Shaikh Haji ‘Abdullah, Karang—his grandson Panambahan Mas Nida Muhammad Maḥyā, Karang— Tuan Haji Nur Ahmad, Tĕgal—Ĕnci’ Salihin Batawiyah nĕgĕrinya Mataraman kampungnya . Various texts, e.g. the signs of approaching death and the colours seen by a dying man; Arabic formulae to be used in rice cultivation, cf. MSS Jav. 77. B: 30 ff. Eur. paper. Mackenzie's no. ‘j’. Javanese texts in Arabic script (pegon), e.g. punika sharah du‘a ismu’l-a‘ẓam patang puluh, punika tartantune asmā'u’l-ḥusnā sangang puluh sanga saking Shaikh Barīzī, rong puluh sipat . C: 38 ff. Arabic litanies in praise of saints (Haji ‘Abdulmuhyi and others), niat formulae for ritual purification, continued in Javanese, with Arabic formulae. At the end an unidentified Javanese text. Eur paper. Mackenzie's no. ‘k’. D: 28 ff. Mostly Arabic texts on du‘ā’, risāla ‘an ta’wīl ar-ru’ya ; Qur’ānic verses, some with interlinear Javanese versions; a Javanese text on niat . Javanese paper. Mackenzie's no. ‘c’. E: 32 ff. Correctly described in a note as verses from the Qur’ān for children to learn. Javanese paper. F: 63 ff. Eur paper. Mackenzie's no. 'd': F 1: Arabic text on the pilgrimage, beginning al-ḥamdu lillāhi ‘lladhī farrada ‘alainā ‘l-hajja wa’l-‘umrata , partly with an interlinear Javanese translation. At the end are drawings of holy places in Medinah. F 2: Javanese texts on a‘yān thābitah , etc., at the end called Rūḥ ; on the chapters of the Qur'ān; on the three ‘ālam ; on the alphabet, identified with the Prophet; on do‘a; niat manjing Shaṭṭārīyah . In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 215 x 125 mm. 214 ff, various European and Javanese paper ( dluwang ) . Black ink. Several folios have been re-margined. Binding: Ferris 1815 Calcutta half brown leather binding with marbled paper boards."
  },
  "MSS Jav 51": {
    "title": "Sĕrat Ambiya",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_51",
    "scope": "Sĕrat Ambiya. Complete Anbiya text. In Javanese in Arabic script ( pegon ).",
    "physical": "Dimensions: 315 x 190 mm. 125 ff.; Dutch paper, watermarked 'R Zevenhuisen' and 'R Z', with chainline shadows. 16 lines per page; black ink, with rubrication and red circle verse markers. Binding: original marbled paper boards of the type used by Mackenzie's binder Ferris in Calcutta in 1815, but rebound in the British Library in ca. 2000 with new brown leather spine and cornerpieces. Brief notes in ?Persian in the top left corners of ff. 1 and 2 may derive from the binding process in Calcutta."
  },
  "MSS Jav 52": {
    "title": "Jaya Lĕngkara",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_52",
    "scope": "Jaya Lĕngkara Copied in Yogyakarta by Darpayuda. Mentions the Crown Prince and his mother Kangjĕng Ratu Kadipatyan. Dated 6 Ramalan, RĕspatiWage, Be, Julungpujut wuku, masa Kasanga , but without the year, which Weatherbee deduces to be March A.D. 1763. v: 24. In Javanese language and script.",
    "physical": "Dimensions: 330 x 210 mm. 86 ff.; Dutch paper, watermarked 'VOC'. Black ink; 17 lines per page. Handwriting: ff. 2v-36v, small neat hand with delicate and elaborate canto markers; ff. 37r-70v quadratic cursive hand. On f. 70v a few lines of the first hand, and a marginal note in red ink, 'the intermediate section wanting'; ff. 71r-86v quadratic hand. Binding: modern BL half brown calf binding with marbled paper boards."
  },
  "MSS Jav 53 a": {
    "title": "Balinese redaction of the Tantri",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191626784.0x000001",
    "scope": "Identified on the\nbasis of a brief examination by Dr. C. Hooykaas as a Balinese redaction of the\nTantri. In Balinese.",
    "physical": "Dimensions: 35 x 385 mm. 86 ff.; palm leaves. 4 lines of text per page, in two columns. Leaves missing, both at the beginning and the end. Many soiled and damaged leaves. Covers: endboards missing. This MS is currently unstrung, with the leaves stored between two plexiglass supports."
  },
  "MSS Jav 53 aa": {
    "title": "Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191671665.0x000001",
    "scope": "Fragment of a Modern Javanese text on ethics.",
    "physical": "Dimensions: 35 x 240 mm. 13 ff.; palm leaves ( lontar ). 4 lines of text per page, in very small neat script. Three holes at ends and middle. All the leaves are badly damaged and broken. Covers: no original boards; currently provided with two plexiglass boards. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 b": {
    "title": "Tutur",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191634499.0x000001",
    "scope": "Probably a tutur ;\nmany names of Hindu gods are mentioned. In Old Javanese.",
    "physical": "Dimensions: 35 x 415 mm. 35 ff.; palm leaves. 5 lines of text per page, in two columns. Three holes at ends and middle. Leaves missing at the beginning. Many soiled and damaged leaves; brittle along edges Covers: two wooden covers, varnished and bevilled on the outer sides; one large hole in the middle and two narrow holes at each ends. This MS is currently unstrung."
  },
  "MSS Jav 53 bb": {
    "title": "Unidentified Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191627110.0x000001",
    "scope": "Unidentified Modern\nJavanese text, in what seems perhaps to be a rather old pasisir style script, with fine decorative text dividers. Both beginning and end are missing. Many ff. broken at beginning and end.",
    "physical": "Dimensions: 35 x 515 mm. 150 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some of the leaves are damaged, with some old repairs. Covers: no original boards; currently provided with two plexiglass boards. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 c": {
    "title": "Sadanayoga",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191671692.0x000001",
    "scope": "There seem to be two texts: A: ff. 1-13. In Old Javanese.\nApparently a collection of mantras. Perhaps titled Sadanayoga. B: ff. 15-38.\nModern Javanese text, incomplete. In Javanese script.",
    "physical": "Dimensions: 35 x 370 mm. 38 ff.; palm leaves. 4 lines of text per page, written across the leaf. Three holes at ends and middle. Many soiled and damaged leaves; brittle along edges. All the leaves have been fully laminated on both sides. Covers: two wooden covers; three holes, at ends and in the middle. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 cc": {
    "title": "Unidentified Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100192853058.0x000001",
    "scope": "A: ff. 1-10: thinner leaves in buda or gunung script with 3 lines of text per page. B: ff. 11-99: Yudisṭira is mentioned at the beginning; later other names\nfrom the Bratayuda also appear. 4 lines of text per page. Leaves out of order, and many leaves are broken. There may be some folios from other MSS included here.",
    "physical": "Dimensions: 35 x 475 mm. 99 ff.; palm leaves ( lontar ). 3 or 4 lines of text per page. Three holes at ends and middle. Some of the leaves are damaged, with many laminated repairs. Covers: no original boards; currently provided with two plexiglass boards. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 d": {
    "title": "Story of Ki Amad",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191671760.0x000001",
    "scope": "Story of Ki Amad, in Modern Javanese. Perhaps there are\nsome leaves from a second text also bound in. In Javanese script.",
    "physical": "Dimensions: 35 x 380 mm. 57 ff.; palm leaves. 4 lines of text per page, written across the leaf, in a very small hand. Three holes at ends and middle. Many ff. have unblackened script. Decoration: ornamental frame on the first page, surrounding two lines of text. Many soiled and damaged leaves. All the leaves have been fully laminated on both sides. Covers: two wooden covers, with bevilled surfaces; three holes, at ends and in the middle. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 dd": {
    "title": "Unidentified Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191671808.0x000001",
    "scope": "Unidentified; apparently two different Modern Javanese texts. In buda or gunung script. This MS described with the assistance of Andrea Acri. and arranged in order by Ben Arps.",
    "physical": "Dimensions: 40 x 420 mm. 20 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. All the leaves are fully laminated on both sides. Covers: two wooden boards. The manuscript is strung."
  },
  "MSS Jav 53 e": {
    "title": "Níti Sāra",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191671853.0x000001",
    "scope": "Old Javanese Níti\nSāra ( Nīti Śāstra ), according to Dr. C. Hooykaas. There are some broken ff. and\nthe MS has been exposed to smoke, but the text seems to be largely intact. In Javanese script.",
    "physical": "Dimensions: 35 x 400 mm. 60 ff.; palm leaves. 4 lines of text per page, written across the leaf, in a neat hand. Three holes at ends and middle. Some damaged leaves. All the leaves have been fully laminated on both sides. Covers: two bamboo covers;one hole in the middle. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 ee": {
    "title": "Unidentified Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191628502.0x000001",
    "scope": "Unidentified Modern Javanese text, which may be a tutur or a collection of mantras. The colophon has vija samasta tlas (‘here ends the Vija Samasta’); the word śudhamala occurs in the text. The text is complete. This MS described with the assistance of Andrea Acri.",
    "physical": "Dimensions: 35 x 420 mm. 101 ff.; palm leaves ( lontar ). 4 (sometimes uneven) lines of text per page. Three holes at ends and middle. Original foliation in Javanese on the verso of each leaf. The edges of the leaves are very blackened; there are some modern repairs. Some fragments of old string are found with the manuscript. Covers: two wooden boards. The manuscript is currently strung."
  },
  "MSS Jav 53 f": {
    "title": "Unidentified text in Javanese",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191671953.0x000001",
    "scope": "Unidentified text, in which several Hindu divinities are named. In Modern Javanese. In Javanese script.",
    "physical": "Dimensions: 40 x 340 mm. 48 ff.; palm leaves. 4 lines of text per page, written across the leaf, in a cursive hand. Three holes at ends and middle. Some damaged leaves, brittle along edges. Some leaves have been laminated on both sides. Covers: two wooden covers; three holes, at the ends and in the middle. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 ff": {
    "title": "Unidentified Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191672038.0x000001",
    "scope": "Perhaps a Middle Javanese tutur .",
    "physical": "Dimensions: 40 x 320 mm. 11 ff.; palm leaves ( lontar ). 4 (sometimes uneven) lines of text per page. Three holes at ends and middle. Original foliation in Javanese on the verso of each leaf. The edges of the leaves are very blackened, and some leaves are damaged. Covers: two bamboo boards. The manuscript is currently strung, but the leaves may be out of order."
  },
  "MSS Jav 53 g": {
    "title": "Tutur",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100192853285.0x000001",
    "scope": "Probaby a tutur . First leaf present, but incomplete at end. In Old Javanese, in Javanese script.",
    "physical": "Dimensions: 35 x 390 mm. 56 ff.; palm leaves ( lontar ). 4 lines of text per page, written in two columns. Three holes at ends and middle. Original foliation in Javanese in the left margin. Some damaged leaves, brittle along edges, or with parts missing; some repaired. Covers: two wooden covers; three holes, at the ends and in the middle. This MS is currently strung, with the leaves in order."
  },
  "MSS Jav 53 gg": {
    "title": "Tutur and other texts",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100192853574.0x000001",
    "scope": "Composed probably of three separate manuscripts. A: Tutur . 6 ff., palm leaf, 41 ☓ 3.5 cm. B: Fragment of unidentified text divided into sargas (one is tantri wiwāha ), Old Javanese with one or more ślokas . 3 ff., palm leaf, 41 x 3.5 cm. C: Version of the Sang Hyang Hayu, a tutur of west Javanese provenance. 52 ff., palm leaf, 48.5 ☓ 3.5 cm. This MS described with the assistance of Andrea Acri.",
    "physical": "Dimensions: 35 x 485 mm (maximum). 61 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. The edges of the leaves are very blackened, and many leaves are very damaged. Current collation: 5 ff, 35 x 480 mm, 3 lines of text3 ff, 35 x 465 mm, 4 lines of text1 ff, 40 x 390 mm, 4 lines of text50 ff, 35 x 410 mm; 4 lines of text, with original Javanese foliation on the verso, with original blackened outer leaves at beginning and end. Covers: one wooden board, 30 x 480 mm. The manuscript is currently unstrung."
  },
  "MSS Jav 53 h": {
    "title": "Sanghyang\nKalimahosadha",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191672059.0x000001",
    "scope": "Sanghyang\nKalimahosadha. Colophon: iti Sanghyang dharmma ajñāna kapanditan\nSanghyang Kalimahosadha. . . . The text is in three sections, each with new original foliation in the left margin. In Old Javanese, in Javanese script.",
    "physical": "Dimensions: 35 x 420 mm. 33 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Original foliation in Javanese in the left margin. Some leaves brittle along edges, otherwise in good condition. Covers: two wooden boards, with traces of black pigment; three holes, at the ends and in the middle. This MS is currently unstrung."
  },
  "MSS Jav 53 hh": {
    "title": "Unidentified Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191629522.0x000001",
    "scope": "Unidentified Modern Javanese text, which might be a tutur ; the words kabhuyutan trisak warṇna appear in the text. This MS described with the assistance of Andrea Acri.",
    "physical": "Dimensions: 30 x 420 mm. 18 ff.; palm leaves ( lontar ). 4 (sometimes uneven) lines of text per page. Three holes at ends and middle. The edges of the leaves are very blackened, and some leaves are badly damaged. Covers: no original boards. The manuscript is currently strung."
  },
  "MSS Jav 53 i": {
    "title": "Mantras",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191629620.0x000001",
    "scope": "Perhaps mantras. Various Hindu deities are named; there are two magical illustrations on pp. 3, 71. In Modern Javanese, in Javanese script.",
    "physical": "Dimensions: 40 x 400 mm. 39 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves brittle along edges; the whole MS is fully lamintaed on both sides. Covers: two wooden boards, with traces of black pigment; three holes, at the ends and in the middle. This MS is currently unstrung."
  },
  "MSS Jav 53 ii": {
    "title": "Unidentified Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191629835.0x000001",
    "scope": "Unidentified Modern Javanese text in buda or gunung script, which seems to be a story, featuring a wiku and a certain Kirtthi , but also mentioning jati paramārtha niṣkala , suggesting instead a religious text/ tutur . This MS described with the assistance of Andrea Acri.",
    "physical": "Dimensions: 40 x 600 mm. 78 ff. plus fragments; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. The edges of the leaves are very blackened, and some leaves are badly damaged and warped. Some damaged leaves are now enclosed in melinex. Covers: no original boards. The manuscript is currently unstrung."
  },
  "MSS Jav 53 j": {
    "title": "Text in Javanese",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191630188.0x000001",
    "scope": "Unidentified text; incomplete. In Modern Javanese, in Javanese script.",
    "physical": "Dimensions: 35 x 335 mm. 38 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves badly soiled and brittle along edges. Covers: two wooden boards, with black pigment; three holes, at the ends and in the middle. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 k": {
    "title": "Tutur",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191630370.0x000001",
    "scope": "Tutur and aji Contains a tutur , with explanations on mantras and religious doctrines, and a number of aji texts relating to magical and amuletic formulae, including Aji Kalalangan, Kaprajuritan and Mahapadma Pagĕsĕngan . This manuscript described with the assistance of Agung Kriswanto, Aug. 2023. In Modern Javanese, in buda or gunung script. Two folios (pp. 67-70) are on a lighter leaf and in a different hand, and may derive from a different MS.",
    "physical": "Dimensions: 35 x 370 mm. 44 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves badly soiled, brittle and broken; the whole MS has been fully laminated on both sides. Covers: two wooden boards; three holes, at the ends and in the middle. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 l": {
    "title": "Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191630607.0x000001",
    "scope": "Unidentified text. Colophon: iti ricik ing rare\ncilik. In Modern Javanese, in Javanese script.",
    "physical": "Dimensions: 35 x 315 mm. 35 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Many leaves badly damaged. Covers: two wooden boards; three holes, at the ends and in the middle. The back board is very brittle and damaged. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 n": {
    "title": "Javanese text on magic or mysticism",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191630822.0x000001",
    "scope": "Unidentified text, probably on mysticism, and apparently\nIslamic. At the beginning there seem to be both awignam astu and hasmala . In Modern Javanese, in buda or gunung script.",
    "physical": "Dimensions: 35 x 465 mm. 24 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Many leaves badly damaged on the left hand side, and missing part of the leaf (containing the original foliation). Covers: two wooden boards, bevelled and ridged; three holes, at the ends and in the middle. This MS is currently strung."
  },
  "MSS Jav 53 o": {
    "title": "Rasayajna",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191630933.0x000001",
    "scope": "Two texts: Rasayajna, and Darma Kamulaning Dadi a) Rasayajna, dated AJ 1550 (AD 1628). The colophon is dated with a chronogram: Ø Ø iti rasayajnān• bwat Śiwā / jnāna Ø Iśaka 'nora buttha maṙgganiṅ woṅ', dina, saptawara, wṛs[pa]ti, pañcawara, kaliwon, wukiṙ, wukunya, rasayajṇā prantusakna de saṅ śudyamaca, muha saṅ makeken•, lwi lwangana, kiraṅ wĕhana// 'Ø Ø thus Rasayajna bwat (berat?) Śiwa / jnana. In the Śaka year, 'not of monsters is the path of humans' (‘bukan raksasa jalannya manusia’, equivalent to 1550 Ś/ 1628 AD) on Thursday in the seven day week, on Kaliwon in the five day week, in the wuku Wukir, Rasa[ya]jna, for the understanding of those you may read it, and for those who request it, where it is overlong please reduce it, and where it is too short please extend it'. b) Darma Kamulaning Dadi Colophon: Iti ḍaṙmma kamulaniṅ dadi magĕḥhanī tumuwuḥ yen aṛm• wruḥha hayo wera tmĕn•//o// 'Thus Darma Kamulaning Dadi provides instruction to living creatures, who in silence will understand, and never let (the secrets) leak out'. [Readings by Agung Kriswanto, 15.8.2023] In Javanese, in buda or gunung script; in two different hands.",
    "physical": "Dimensions: 35 x 415 mm. 27 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Many leaves badly damaged, with some recent repairs. Covers: two wooden boards, blackened on outside, with one hole in the middle; the end board is fragile and badly damaged. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 p": {
    "title": "Unidentified old\nJavanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191631140.0x000001",
    "scope": "Unidentified old\nJavanese text. Among the words and names found in it are Paramasiwa, Kawiswara,\nTrikundalaksana. Probably a tutur .",
    "physical": "Dimensions: 30 x 335 mm. 39 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Towards the end of the MS some leaves are badly damaged, with some recent repairs. Covers: two bamboo boards, with a mottled pattern on the outside, with one hole in the middle. This MS is currently strung."
  },
  "MSS Jav 53 q": {
    "title": "Balinese religious\ntext",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191675932.0x000001",
    "scope": "Balinese religious\ntext, with tables, diagrams, and illustrations.",
    "physical": "Dimensions: 35 x 450 mm. 45 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Decoration: many illustrations, some drawn across several leaves. Some leaves badly damaged. Covers: two wooden boards, with a mottled pattern on the outside, with three holes. This MS is currently strung, but the leaves may be out of order."
  },
  "MSS Jav 53 r": {
    "title": "Tutur",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191631362.0x000001",
    "scope": "Modern Javanese text,\nprobably a tutur .",
    "physical": "Dimensions: 35 x 400 mm. 42 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves badly damaged and blackened; edges brittle and exposed to smoke. Sticky residue from old laminated repairs has caused some leaves to adhere together. Covers: two wooden boards, with three holes. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 s": {
    "title": "Tutur",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191631589.0x000001",
    "scope": "Balinese text,\nprobably a tutur .",
    "physical": "Dimensions: 35 x 445 mm. 29 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. The MS has been exposed to smoke, and the edges of the leaves are blackened and brittle. Covers: two wooden boards, with black pigment around the edges; with one hole. This MS is currently strung."
  },
  "MSS Jav 53 t": {
    "title": "Sang Hyang Hayu",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100192926810.0x000001",
    "scope": "There appear to be two or three texts, in different hands and sizes of leaf: A: Sang Hyang Hayu , in Old Javanese in Buda script; complete. According to the colophon, this manuscript was copied in the hermitage (batur) of Kasinoman, Ketralingga, in the Javanese Śaka year 1415, equivalent to 1493 AD. This manuscript identified by Agung Kriswanto, Aug. 2023. 43 ff.; 4 lines per page. B: Unidentified text, in Javanese script. 13 ff.; 3 lines per page. C: Unidentified text, in Javanese script. 10 ff.; 4 lines per page.",
    "physical": "Dimensions: 35 x 470-515 mm. 66 ff.; palm leaves ( lontar ). 3-4 lines of text per page. Three holes at ends and middle. The MS has been fully laminated on both sides, and the sticky residue may cause some leaves to adhere to each other. Covers: one wooden board, bevelled and ridged on the outside; with three holes. This MS is currently unstrung, and the leaves are out of order."
  },
  "MSS Jav 53 u": {
    "title": "Tutur",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191631712.0x000001",
    "scope": "Modern Javanese text, probably a tutur .",
    "physical": "Dimensions: 35 x 405 mm. 36 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves are badly damaged, with some laminated recent repairs. Covers: two wooden boards; with three holes. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 v": {
    "title": "Unidentified Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191631916.0x000001",
    "scope": "Unidentified Modern Javanese text, Nabi Ngisa, Nabi Musa, and Nabi Muhammad are named. The MS is badly soiled and much of it is illegible; it has been exposed to smoke.",
    "physical": "Dimensions: 30 x 285 mm (leaves), 330 mm (covers). 13 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves are badly damaged, with some laminated recent repairs, which cause some leaves to adhere to each other. Covers: two dark wooden boards, slightly bevelled on the outsides; with one hole; the covers are considerably longer than the leaves. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 w": {
    "title": "Unidentified Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191634667.0x000001",
    "scope": "Unidentified Modern Javanese text, Pun Sĕmar is mentioned several times. A note attached to the MS says ‘tutur’, but the basis for this identification is unclear. Many ff. seem to be missing, including the beginning and the end of the MS; many ff. insect damaged and broken.",
    "physical": "Dimensions: 35 x 355 mm (leaves), 390 mm (covers). 16 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves are badly damaged. Covers: two dark wooden boards, which do not match; one is bevelled on the outsides, and both are damaged at one end; the covers are considerably longer than the leaves. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 x": {
    "title": "Unidentified Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100192853907.0x000001",
    "scope": "Unidentified Modern Javanese text. Some Hindu divinities are named. A note attached to the MS says ‘Suluk. Proper Name: Mangunsari’, but the basis for this identification is unclear (NB this note is no longer present). Many ff. seem to be missing; some ff. soiled; MS has been exposed to smoke.",
    "physical": "Dimensions: 30 x 355 mm (leaves and front cover), 385 mm (back cover). 17 ff.; palm leaves ( lontar ). 4 lines of text per page. Three holes at ends and middle. Some leaves are badly damaged. Covers: two dark wooden boards, which do not match: one is bevelled on the outside, with 3 holes, and is the same length as the leaves; the other is smooth, with one hole, and considerably longer than the leaves. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 y": {
    "title": "Old Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191684069.0x000001",
    "scope": "Old Javanese text, perhaps\nmantras, with some magical illustrations.",
    "physical": "Dimensions: 35 x 260 mm. 108 ff.; palm leaves ( lontar ). 4 or 5 lines of text per page. Three holes at ends and middle. Some leaves are badly damaged; others have recent repairs. Decoration: incised illustrations coloured with black ink. Covers: two dark wooden boards, bevelled and ridged on the outsides. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 53 z": {
    "title": "Modern Javanese text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100191632017.0x000001",
    "scope": "Modern Javanese text, with leaves out of order. A colophon calls it iti dudukatan Parimbon and mentions the dukuh ing Purwasari. Various Hindu divinities are mentioned in the text. A note added to the MS, in a different hand from the text, in uninked script, says Layang kuna. Saking Kyahi Tumĕnggung Puger, katur datĕng Tuwan Kur . . . \n[the leaf is broken here; probably this refers to Colonel (Kuronel) Mackenzie]\n... is kukus [?] isi 18 iji 17-2-39 [in western numerals; presumably A.J.\n1739/A.D. 1812].",
    "physical": "Dimensions: 30 x 260 mm. 39 ff.; palm leaves ( lontar ). 3 lines of text per page. Three holes at ends and middle. Some leaves are badly damaged. Covers: two bamboo boards, with mottled patterns on the outsides. This MS is currently unstrung, and the leaves may be out of order."
  },
  "MSS Jav 54": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_54",
    "scope": "Wayang texts In Javanese language and script.",
    "physical": "Dimensions: 215 x 130 mm. 160 folios; Dutch paper, 'J Honig &amp; Zoonen'. 13 lines of quadratic script per page; black ink. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands (head band now lost)."
  },
  "MSS Jav 56": {
    "title": "Mystical speculation, in Javanese",
    "language": "",
    "link": "",
    "scope": "Mystical speculation, on the cover a label saying agama . Pages missing at the beginning; initial pp. badly stained. In Javanese language and script.",
    "physical": "Dimensions: 135 x 105 mm. 56 ff.; Dutch paper, watermarked 'Honig'. Black ink. Binding: bound with a piece of plain brown leather wrapped around and attached to the textblock with stitching through the spine. Suede finish on the outside covers and smooth finish on the inside covers."
  },
  "MSS Jav 57": {
    "title": "Raja Siyudana ing Astina",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_57",
    "scope": "On the flyleaf a note, Raja Siyudana [Suyudana] ing Astina In Javanese language and script.",
    "physical": "Dimensions: 275 x 195 mm. 53 ff., Javanese paper ( dluwang ), flyleaves of English paper, watermarked ‘Hall 1812’. Black ink; 15 lines per page. Some pages written upsided down (ff.35-36); textual amendments sewn in (ff. 51, 53). Binding: half leather binding with marbled paper boards; both covers now loose."
  },
  "MSS Jav 58": {
    "title": "Punika kagĕngan-dalĕm Sĕrat Sinḍenipun Bĕḍaya-dalĕm",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_58",
    "scope": "Begins, punika kagĕngan-dalĕm Sĕrat Sinḍenipun Bĕḍaya-dalĕm . On f. 8r (RV: p. 16) begins a text taken from Sĕrat Pusaka Surya Raja (see Ricklefs, 1974, Chap. VII, on the Surya Raja). In Javanese language and script.",
    "physical": "Dimensions: 285 x 195 mm. 17 folios; Javanese paper ( dluwang ). 20-21 lines of various scripts per page; black ink. Binding: modern BL half brown leather binding with marbled paper boards. MSS Jav 58 is bound in a single volume with MSS Jav 62 and MSS Jav 65, and the volume has been foliated continuously: MSS Jav 58: ff. 1-17 MSS Jav 62: ff. 18-26 MSS Jav 65: ff. 27-58."
  },
  "MSS Jav 59": {
    "title": "Wayang text",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_59",
    "scope": "Wayang text. Kagĕngandalĕm Sĕrat Konda Ringgit Purwa lampahan Jaya Asmara sarĕng wiwit saditĕn jĕjĕr ing Ngastina. In Javanese language and script.",
    "physical": "Dimensions: 340 x 205 mm. 90 ff.; Dutch paper, watermarked 'C &amp; I HONIG'. 17 lines per page; black ink; quadratic script. F. 26 is an textual addition written on Javanese paper ( dluwang ) and sewn onto f. 25; ff. 90a and 90b, now loose at the end of the volume, were probably also originally attached to certain (as yet unidentified) folios. Binding: half brown leather binding with marbled paper boards, now detached from the spine and secured with string. Housed in a brown buckram box."
  },
  "MSS Jav 6": {
    "title": "Babad Pacina",
    "language": "",
    "link": "",
    "scope": "Babad Pacina. Beginning and end missing, some confusion in the binding. An English translation of\nthis MS is in Mackenzie 1822 collection 24 (Blagden, 1916, p. 19). In Javanese language and script. In verse.",
    "physical": "Dimensions: 280 x 200 mm. 213 folios; Javanese paper ( dluwang ). Black ink, 20 lines per page. Binding: new full brown leather binding, rebound in the BL in ca . 2000."
  },
  "MSS Jav 60": {
    "title": "Panji text and others",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_60",
    "scope": "At least four sections: A: ff. 1r-10v (RV pp. 1-20). Fragment of a Panji text. B: ff. 11r-25v (RV pp. 21-50). Punika nĕgari ing Ngastina . C: ff. 27r-49r (RV pp. 53-97). Census statistics, the same text as MSS Jav. 71. ff. 50r-51v. A folded sheet with Javanese text ff. 50v-51r, and wayang-style sketches of a figure and a naga on f. 50av. D: ff. 53r-56r (pp. 105-11). A text in Malay in Javanese script, summarizing a Carita Panji Kuripan . In Javanese script.",
    "physical": "Dimensions: 320 x 200 mm. 58 folios. 17-20 lines per page, black and brown ink; various hands. Various European papers: A: European paper, watermarked 'VI'. B: English paper, watermarked 'J WHATMAN 1809', 'V E I C'. C: English paper, watermarked 'HARRIS 1810'. D: English paper, watermarked 'PHIPPS &amp; SON 1810' Flyleaves of English paper, watermarked 'HALL 1812'. Binding: half brown leather binding with marbled paper boards, now detached from spine, and held together with string. Housed in a brown buckram box."
  },
  "MSS Jav 61": {
    "title": "Collection of Alphabets and MSS in the Javanese and other languages and characters of Java 1811 and 1812",
    "language": "",
    "link": "",
    "scope": "‘Collection of Alphabets and MSS in the Javanese and other languages and characters of Java 1811 and 1812’: A: ff. 2r-20r. ‘The Javanese alphabet used at Cheribon [Cirĕbon] by Ravidjah [Rawijah, Mackenzie’s translator]’ B: ff. 23r-26r. ‘The Javanese alphabet and numerical characters by Rothenbuhler of Sourabaya [Surabaya], April 29 1812’ C: ff. 27r-28v. ‘Capala Hooroof [kĕpala huruf]: the Javanese alphabet ancient and modern from the Pangeran of Samanap [Sumĕnĕp], April 1812’ D: f. 29r. ‘Ancient Javanese alphabet received from the 2nd son of the Panumbahan at Sarnanap [Panĕmbahan of Sumĕnĕp], April 1812.' E: ff. 30r-30ar. ‘Pali alphabet from Mr. Couperus, copied November 1812.’ F: ff. 31r-31ar. 'Aanthoning ...' note in Dutch with chart of Javanese letters. (Not listed in RV 1977). G: ff. 32r-52r. ‘The Javanese alphabet by Johannes Gabriel Vincent (February 1812).’ In Javanese language and script, with notes in English and Dutch.",
    "physical": "Dimensions: 330 x 220 mm. 52 ff. according to original foliation; various European papers and watermarks, eg. 'A Gleerup' (f. 28a); flyleaves watermarked ‘Hall 1812’. Binding: half leather binding with marbled paper boards; both covers now loose."
  },
  "MSS Jav 63": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_63",
    "scope": "Wayang texts, at least four sections: A: ff. 2v-23r (RV pp. 6-44). Punika kawinipun Ratu Dwarawati . B: ff. 23v-51v (RV pp. 52-100). Punika kawinipun Ratu Ngastina . C: ff. 54v-95v (RV pp. 106-90). Punika kawin ing Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . D: ff. 112v-158v (RV pp. 228-319). Punika kawin Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . In Javanese language and script.",
    "physical": "Dimensions: 215 x 130 mm. 160 folios; Dutch paper, 'J Honig &amp; Zoonen'. 13 lines of quadratic script per page; black ink. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands (head band now lost)."
  },
  "MSS Jav 64": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_64",
    "scope": "Wayang texts, at least four sections: A: ff. 2v-23r (RV pp. 6-44). Punika kawinipun Ratu Dwarawati . B: ff. 23v-51v (RV pp. 52-100). Punika kawinipun Ratu Ngastina . C: ff. 54v-95v (RV pp. 106-90). Punika kawin ing Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . D: ff. 112v-158v (RV pp. 228-319). Punika kawin Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . In Javanese language and script.",
    "physical": "Dimensions: 215 x 130 mm. 160 folios; Dutch paper, 'J Honig &amp; Zoonen'. 13 lines of quadratic script per page; black ink. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands (head band now lost)."
  },
  "MSS Jav 65": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_65",
    "scope": "Wayang texts, on the flyleaf: Punika kawin Giling Wĕsi ditĕnipun . A: ff. 28r-45r (RV: pp. 1-38). Punika kawin Ratu Giling Wĕsi . B: ff. 46r-v (RV: pp. 39-41). Fragment of a Panji tale. C: ff. 47v-48r (RV: pp. 43-4). Fragment beginning, punika kagĕngandalĕm Babad Mangkunĕgaran . D: ff. 49v-58v (RV: pp. 45-64). Fragment, jĕjĕr Ratu Astina . In Javanese language and script.",
    "physical": "Dimensions: 270 x 220 mm. 32 folios (numbered as ff. 27-58); Javanese paper ( dluwang ), except for C, on European paper. 16 lines per page, variety of scripts; black ink. Binding: modern BL half brown leather binding with marbled paper boards. MSS Jav 65 is bound in a single volume with MSS Jav 58 and MSS Jav 62, and the volume has been foliated continuously: MSS Jav 58: ff. 1-17 MSS Jav 62: ff. 18-26 MSS Jav 65: ff. 27-58."
  },
  "MSS Jav 66": {
    "title": "Wayang texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_66",
    "scope": "Wayang texts, at least four sections: A: ff. 2v-23r (RV pp. 6-44). Punika kawinipun Ratu Dwarawati . B: ff. 23v-51v (RV pp. 52-100). Punika kawinipun Ratu Ngastina . C: ff. 54v-95v (RV pp. 106-90). Punika kawin ing Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . D: ff. 112v-158v (RV pp. 228-319). Punika kawin Ringgit Purwa sarĕng wiwitan jĕjĕr Ratu Ngastina . In Javanese language and script.",
    "physical": "Dimensions: 215 x 130 mm. 160 folios; Dutch paper, 'J Honig &amp; Zoonen'. 13 lines of quadratic script per page; black ink. Binding: half brown leather binding with marbled paper boards; fore edge, head and tail are stained blue. Striped blue and white head and tail bands (head band now lost)."
  },
  "MSS Jav 67": {
    "title": "Papakĕm Watu Gunung",
    "language": "",
    "link": "",
    "scope": "Papakĕm Watu Gunung . By Kyahi Adipati Sura Adimanggala. With painted illustrations of the attributes of wukus done by Sura Adimanggala himself. Dated European style ( taun Wĕlanda ) 21 Feb. A.D. 1812. This is the original text of which MSS Jav. 55 is a copy. In Javanese language and script.",
    "physical": "Dimensions: 430 x 270 mm. 71 ff., Dutch paper, watermarked 'J Honig &amp; Zoonen'. Brown ink; 9 lines per page. Fine watercolour illustrations of the 30 wuku and their attributes: tree, building, bird and banner. Binding: half brown leather binding with marbled paper boards; front cover now loose."
  },
  "MSS Jav 68": {
    "title": "Panji Jaya Kusuma",
    "language": "",
    "link": "",
    "scope": "Panji Jaya Kusuma. Its contents seem to be the same as the first third of the Panji Jaya Kusuma epitomized in Poerbatjaraka, 1940, pp. 103-17. Dated 29 Bĕsar A.J. 1701, but Weatherbee argues that this must be a mistake for A.J. 1731 [24 March A.D. 1805]. According to the flyleaf the MS came from Rothenbuhler of Surabaya, Feb. 1812. At the top of the first page is a note, punika sĕrat kagunganipun nyonyah Sakebĕr ing panĕgri Surapringga [ gezaghebber ]; Peter Carey has suggested that nyonyah Sakebĕr was probably Rothenbuhler's wife. Throughout the text are handsome polychrome illustrations in wayang gĕdog style. In origin, script, art style, etc., this MS seems to be connected with MSS Jav. 28. An English translation by L. R. Burke done in June 1820 is in Mackenzie 1822 collection 28 pt. 2 (Blagden, 1916, p. 29). In Javanese language and script.",
    "physical": "Dimensions:320 x 210 mm. 104 ff., Dutch paper, watermarked 'J Honig &amp; Zoonen'. Black ink with gold rubrication; 17 lines per page. Finely illustrated throughout in gold and colours. Rebound with edges of all folios laminated and mounted on guards in the India Office in ca . 1970s. 'Mackenzie Collection' stamps in purple ink have bled through pages wherever applied. Binding: half quarter leather binding with buckram boards."
  },
  "MSS Jav 69": {
    "title": "Religious texts in Javanese",
    "language": "",
    "link": "",
    "scope": "Religious texts. Including discussions of roh Nahi Muhammad , a Shaṭṭārīya salsilah , two Arabic texts with interlinear Javanese translations, a text on dikir , a text beginning sipat ing murid iku patang perkara , a text beginning wiridnya Kangjĕng Rahatu ing Kudus , a text on sahadat , texts on shaī‘at, on the martabat , etc. Several sets of diagrams (eg. ff. 7r, 12v, 13r, 25v, 40v, 52v). In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 260 x 195 mm. 92 ff, Dutch paper, watermarked 'VOC', and Javanese ( dluwang ) endpapers . Black and red ink. Many mystical diagrams. Binding: Original Javanese full brown leather binding with five stamped frame bands, corner pieces and central medallion."
  },
  "MSS Jav 7": {
    "title": "Babad Pajajaran",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_7",
    "scope": "Babad Pajajaran Ending with Raden Ngabehi Saloring Pasar (i.e. Senapati). Copyist Kyahi Ngabehi Gunapangrawit, a dependent of the Yogyakarta Crown Prince. The date is confused, but Weatherbee suggests a terminus ad quem of A.J. 1713 [A.D. 1786] can be assigned. A note on the flyleaf says the MS was received from Rothenbuhler (Surabaya). A fragment of a panggugat bound in at the end of the text is from Dr. Studzee, Yogyakarta, 6 July 1812. In Javanese language and script. In verse; 36 cantos.",
    "physical": "Dimensions: 280 x 200 mm. Javanese paper ( dluwang ). 141 numbered folios; text on ff. 3v-139 v. Between 16-22 lines per page, black ink. On ff. 3v-9r tails of letters and dots have been rubricated. Between ff. 139 and 140 there are 81 blank folios which have not been digitised. Half brown leather binding (refurbished in the British Library bindery in 1992), with old marbled paper boards, and endpapers of English paper, watermarked 'J Whatman 1811'."
  },
  "MSS Jav 70": {
    "title": "Various tracts in Javanese on religious ethics",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_70",
    "scope": "Various tracts on religious ethics: A: ff. 2v.-40r. A tract in three chapters with Arabic titles. Bāb 1, on neglecting ṣalāt (ritual prayer). Bāb 2 on disobedience to parents. Bāb 3 on wine drinking. B: ff. 40v.-46r. After a new basmala, a mystical and ethical interpretation of salāt . C: ff. 46v.-63r. After another basmala, a piece of moral advice beginning with a conversation of Moses with God. D: ff. 63r.-v. After another basmala , a short note on the origin of the human body. E: ff. 63v.-68v. After another basmala , on colours seen in sakarat al-maut . F: ff. 68v.-70v. After another basmala , an explanation of allegories such as tunjung tanpa talaga (a lotus without a pond). G: ff. 70v.-75r. After another basmala , on knowledge of self, with (on f. 75r) a schematic table of 'ishq, ‘āshiq, ma‘shūq . Similar texts follow these, e.g. explanations of the letters of the shahāda (confession of faith) and (on f. 85v) a bāb niat . In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 210 x 160 mm. 94 ff, Dutch paper, watermarked ‘Honig', ‘JH &amp; Z', ‘Pieter de Vries', and Javanese ( dluwang ) endpapers. Black ink; 9 lines per page. Some mystical diagrams. Binding: Original Javanese full brown leather binding with five stamped frame bands, corner pieces and central medallion."
  },
  "MSS Jav 71": {
    "title": "Manik Maya and other texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_71",
    "scope": "A: ff. 1v-55r (RV pp. 1-114). A melange of cosrnogenic myth and legendary history; a Manik Maya text which ends before the story of Ken Tisnawati, a Catur Yoga , and an Islamically tinged Aji Saka , all treated as a single text. J. G. Vincent's original Dutch translation among the uncatalogued Mackenzie ‘Miscellaneous' MSS in IOL identifies the text as being extracts from Javanese MSS found in the court of the Sultan of Yogyakarta in Aug. 1812. This MS appears to be a copy made in Sĕmarang of the missing original(s). The beginning of the text translated by Vincent is missing in this copy. A colophon in the translation but missing from this copy dates the work (the Aji Saka ?) in Yogyakarta, 16 Puwasa A.J. I708 [26 Aug. A.D. 1782]. An English translation of Vincent's Dutch translation is in Mackenzie Private collection 69 (Blagden, 1916, p. 206). B: ff. 58r-73r (RV pp. 116-47). Wayang text, with a note by Mackenzie, 'A Section of the History of Indraw Sampoorna of the Country of Husteenah'. Begins, punika kagengandalem kanda Ringgit Purwa lampahan Endrasampurna jĕjĕr Ngastina . C: ff. 74r-81v (RV pp. 149-62). Census statistics, with a note by Mackenzie, 'Part of a statement of the Population of Different Villages'. Beginning missing: ing watu gajah gawening wong walu . This is the same text as in MSS Jav. 60. In Javanese language and script.",
    "physical": "Dimensions: 440 x 270 mm. Dutch paper, watermarked 'J Honig &amp; Zonen', 'I H &amp; Zonen'. Black ink; 25 lines per page. Decoration: unfinished black ink decorative page frame on f. 16r. Binding: modern BL full brown leather binding, ca . 1995. Striped blue and white head and tail bands."
  },
  "MSS Jav 72": {
    "title": "Menak Amir Hamza",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_72",
    "scope": "Menak Amir Hamza. Dated Dal, A.J. 1735 [A.D. 1808], in Yogyakarta, baituhu (Arabic, ‘his house was in‛) Pĕgambiran. Copyist ( kang anurat ) Ki Ngabdul Zahid. Correctly described on a torn English note pasted on the inside back cover as ‘Soorat A ... a or account of Ameer Hamza'. The name Dawud in a note on f. 2v is a misreading of the Prophet's title Aji Kangjĕng Nahi Dutaningrat. In Javanese in Arabic script ( pegon ). In verse; 104 cantos.",
    "physical": "Dimensions: 320 x 200 mm. 404 folios. 13 lines per page, black ink, set within text frames of three ruled black lines. Double frames on ff. 4v-5r, with ruled lines in black ink. Decorative floral verse markers of balagh , in red and black ink. Dutch paper, watermarks 'M SCHOUTEN &amp; COMP' (cf. KS 55.0, [ Serat Klempakan ], Surakarta, ca. 1800; Florida 1993: 80). Initial flyleaves (ff. 1-3) of Javanese paper ( dluwang ). Evidence of a mistar between f. 3 and f. 4. Binding: rebound in the British Library in 1993 in a full brown leather binding, with stamped frames and ornaments in emulation of the Javanese style. One original Javanese brown leather cover, with stamped frames and ornaments, and with separated inner cardboard support, is now detached, and is stored in the box alongside the manuscript."
  },
  "MSS Jav 73": {
    "title": "Javanese account of the Prophets &amp; their wars",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/FullDisplay.aspx?index=0&amp;ref=MSS_Jav_73",
    "scope": "A note in English correctly describes this text as ‘Account of the Prophets &amp; their wars'. The first part is a Carita satus . Then follows, with the opening text set in ruled frames on ff. 5v-6r, an account of the life of Muhammad and his descendants, ending abruptly with the marriage of Husain and Sĕribanun. In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 315 x 205 mm. 400 ff, Dutch paper, watermarked ‛M Schouten &amp; Comp', and Javanese ( dluwang ) endpapers. Black ink with red rubrication; 13 lines per page; decorative canto headings in red ink. Binding: Original Javanese brown leather front cover only, with gilded central medallion, bud-shaped ornament and two corner pieces still evident, scuffed and in poor condition; back cover is plain brown leather, perhaps a European addition."
  },
  "MSS Jav 74": {
    "title": "Sĕrat Anbiya.",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_74",
    "scope": "Sĕrat Anbiya. Begins on f. 4v with mention of the owner: Hādhā (Arabic, ‘this is') surat Anbiya kagungan-dalĕm Kangjeng Ratu [written ĕratu ] Agĕng [the great-grandmother of Dipanĕgara?]. Ending with the story of Muhammad Hanafiah. In Javanese in Arabic script ( pegon ). In verse.",
    "physical": "Dimensions: 320 x 205 mm. 574 folios. 19 lines per page, black ink. Decorative floral verse markers in black ink. Dutch paper, watermarks 'J HONIG &amp; ZOONEN'. Initial and end flyleaves are of Javanese paper ( dluwang ). Evidence of a mistar between f. 3 and f. 4. Binding: rebound in the British Library in ca . 1993 in a full brown leather binding, with stamped frames and ornaments in emulation of the Javanese style. The original Javanese brown leather covers, with stamped frames and ornaments, are now detached, and are stored in the box alongside the manuscript."
  },
  "MSS Jav 75": {
    "title": "Babad",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_75",
    "scope": "Babad , in three volumes. Begins in vol. 1 with Adam. Sixteen pages before the end of vol. 3 the text ends, but after one blank page it abruptly begins anew, ending with the death of one Wirawongsa in the year sirna tata rasa janma [A.J. 1650/A.D. 1725]. Dated at the beginning 9 Rabingulawal, Ehe, but without the year. In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 260 x 190 mm. Bound in 3 volumes: vol. 1: 287 pp (paginated); vol. 2: 143 ff.; vol.3: 154 ff. Evidently originally created as a single volume and written continuously, but bound in three volumes with title pages provided for each volume provided by Mackenzie. European paper; title pages of each volume are of English paper, watermarked 'I Budgen 1805'. Black ink and red rubrics, with finely ornamented canto headings; 13 lines per page. Decorated double frames in red ink at the beginning, vol. 1, pp. 1-2. Refurbished Ferris 1815 Calcutta bindings of half brown leather and the original marbled paper boards."
  },
  "MSS Jav 76": {
    "title": "Layang tatamba",
    "language": "",
    "link": "",
    "scope": "Called Layang tatamba by a note inside the cover. Contains various short texts, mostly donga and jimat . In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 135 x 105 mm. 100 numbered ff, of a mixture of Javanese paper ( dluwang ) and Dutch paper, watermarked 'Pro Patria' (cf. f. 28). Black ink. There are 44 blank folios between ff. 72 and 73 which have not been digitised. Binding: original brown leather Javanese binding; only the front cover board is present, with four blind stamped frame bands and central medallion."
  },
  "MSS Jav 77": {
    "title": "Primbon",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_77",
    "scope": "From the beginning to p. 19: al-Samarkandiya (cf. Voorhoeve, 1957, p. 44), Arabic text with interlinear Javanese version. Thereafter notes, among others a Shaṭṭārīya salsilah in Malay, exactly as in MSS Jav. 50 (A), but the name of Nur Ahmad's dwelling-place is written with vowel signs as Tĕgil. His pupil lived in kampung Mataraman, Batavia, as in MSS Jav. 50 (A), but was called Khatib Sa'īd. This was in A.H. 1205 [A.D. 1790]. In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 290 x 200 mm. 43 ff, of Javanese paper ( dluwang ) with writing. Black ink. Several folios at the beginning have been torn and damaged, now repaired. There are 86 blank folios of dluwang between ff. 38 and 39 which have not been digitised. Binding: the covers are made of thick pieces of dluwang ."
  },
  "MSS Jav 78": {
    "title": "Sĕrat Ambiya",
    "language": "",
    "link": "",
    "scope": "Sĕrat Ambiya. Dated Bĕsar, Jimakir, but without the year. In Javanese in Arabic script ( pegon ) and in Arabic. Original India Office number: IO 2901",
    "physical": "Dimensions: 275 x 185 mm. 233 ff.; Javanese paper ( dluwang ). 16 lines per page; black ink; cursive hand. Simple floral verse markers. Full brown leather Javanese binding with stamped frames, corner ornaments and central medallion; front and back covers are now loose and secured with string. If there was ever originally an Islamic-style envelope flap, it is not present now. Housed in a brown buckram box."
  },
  "MSS Jav 79": {
    "title": "Caritanya Nabi Muhammad",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_79",
    "scope": "Caritanya Nabi Muhammad but according to a note by van der Tuuk in Leiden Cod. Or. 3260t, the MS is about Nabi Sulaiman, and inside the back cover is inscribed 'hikayat nabi Suliman'. In Javanese in Arabic script ( pegon ). At the end of the MS is a fragment on ff. 294-298, perhaps from an unrelated MS, in Malay in Jawi script on European paper, all folios torn except for ff. 294 and 298. Contains a text on prescriptions to mark the death of a wife, and for a wedding feast ( jamuan mempelai ). Original India Office number: IO 2902",
    "physical": "Dimensions: 270 x 200 mm. 298 ff.; Javanese paper ( dluwang ). 15 lines per page; black ink with rubrication up to f. 276r; cursive hand. Ff.176v-177r not vocalised. Dashing red sail-like verse markers, and elaborate canto markers in red. Fragment on ff. 294-298 on Dutch paper, watermarked 'I G' with shield. Full brown leather Javanese binding with six rows of stamped frames, corner ornaments and central medallion; front and back covers are now loose and secured with string. If there was ever originally an Islamic-style envelope flap, it is not present now. Blue, red and white head and tail bands. Housed in a brown buckram box."
  },
  "MSS Jav 8": {
    "title": "Sandi Sastra",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_8",
    "scope": "Sandi Sastra, Sandi Sutra, Dasa Nama , etc. On f. 17r (RV p. 33) the Sandi Sutra dated netra gatra kar asa jalmi [A.J. 1692/A.D. 1766]. On p. 79 dates for the births of Mas Bagus Sĕmar and Mas Bagus Togog in A.J. 1693 and 1695 [A.D. 1767 and 1769]; on f. 137r (RV p. 273) ringkĕl ing wuku with a table, on ff. 138v-142v (RV pp. 275-84) a babad sangkala extending from Majapahit to A.J. 1636 [A.D. 1712]. Thereafter texts on divination. ethics, etc., including Kidung rumĕksa ing wĕngi (beginning on p. 284). Ff. 89-135 (RV pp. 175-270) ripped out [at least before Weatherbee saw this in 1970-71]. Rough notes at the front of the MS in pencil, 'Col Wij. .l .n', suggest it is from Yogyakarta. On p. 57 owner given as Mas Cakrawijaya. In Javanese language and script.",
    "physical": "Dimensions: 255 x 200 mm. European paper. 15 lines per page; black ink. 159 ff., but ff. 89-135 ripped out, probably in the 19th century, as reflected in the foliation on the verso of each folio. Binding: half brown leather binding with marbled paper boards. Endpapers watermarked '1811'."
  },
  "MSS Jav 80": {
    "title": "Primbon",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_80",
    "scope": "A primbon , mostly on\namulets and medicine. Many separate short texts. Several soiled or damaged pages, but\nthe text is mostly intact. In Javanese and Arabic language, all in Arabic script ( pegon ).",
    "physical": "Dimensions: 240 x 170 mm. 195 folios; Javanese paper ( dluwang ), except for ff. 123-126 which are of watermarked European paper. The folios of dluwang are of uneven thickenss and all have deckle/uneven outer edges. In black and red ink. There are further paper fragments found on ff. 50 and 51. NB ff. 43-46 comprise a loose quire, and it is uncertain where these folios belong. Binding: The volume is currently unbound with several loose quires. The first and last pages (f. 1r and f. 195v) are discoloured and bear old numbers and stamps, suggesting the manuscript may have been without covers for some time. However, housed together with this manuscript are two covers and an envelope flap of an original Javanese brown leather binding with stamped frame bands and ornaments, but all three fragments are of slightly different size and therefore must originate from different bindings."
  },
  "MSS Jav 81": {
    "title": "Primbon",
    "language": "",
    "link": "",
    "scope": "Primbon . Containing several texts on religious subjects, on jimats , etc., including some Arabic passages with interlinear Javanese versions. In Javanese language and Arabic ( pegon ) script.",
    "physical": "Dimensions: 250 x 190 mm. 68 ff, Dutch paper, watermarked 'LVG'. Black ink, with some rubrication; 11 lines per page. No binding."
  },
  "MSS Jav 82": {
    "title": "Religious tracts in Javanese",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_82",
    "scope": "Religious tracts. In Javanese language and Arabic script ( pegon ). In verse, first canto in asmaradana .",
    "physical": "Dimensions: 205 x 145 mm. 166 folios; Javanese paper ( dluwang ). 11 lines per page, black ink. Some folios soiled and insect damaged; when folios are very thin the scribe has chosen not to write on the verso due to bleed-through from the recto (see eg. ff. 90, 91). Decoration: small 4-petalled floral motifs in black ink between stanzas and cantos. Binding: original Javanese brown leather binding with flap, with three stamped frame bands, corner pieces and medallion, now damaged with front cover loose."
  },
  "MSS Jav 83": {
    "title": "Shaṭṭārīya tracts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_83",
    "scope": "Shaṭṭārīya tracts A: ff. 1v-9r (RV pp. 1-16). Kitab Daka , concerning salat , kawulagusti teachings, sarengat , tarekat , etc., and the confession of faith. The first two pages are set in decorative frames with gilt borders. B: ff. 9r-18v (pp. 16-35). Kitab Fatahurrahman . A Javanese translation in verse of the Arabic Fath ar-Rahmán , containing the sayings of Muhammad, Ali, Seh Juned, etc. Dated at the end Jimakir A.J. 1663 [A.D. 1738, but that was Dal], at the time of rusake Walonda-Jawa . C: f. 19r (RV p. 36). Puji sarining manik asta gina , magical prayer. D: ff. 9v-20r (RV pp. 37-8). Shaṭṭārīya salsilah . E: ff. 20v-23v (RV pp. 39-45). On the merits of the rosary prayer and on tobat . F: ff. 24v-26r (RV pp. 47-50). Shaṭṭārīya salsilah . G: ff. 26r-29r (RV pp. 50-6). On bengat and usali . H: ff. 29r-32v (RV pp. 56-63). On dikir . I: ff. 32v-38v (RV pp. 63-75). On sifat murid . ff. 39r-v: various notes A transliteration of A and B and a summary of the contents of the entire MS by Mr. J. Soegiarto is in IOL MSS Eur. D. 518, ‘Manuscript uit London van India Office Library no. 3102, Shattariya tracts'. Another copy of Soegiarto's summary and transcription of A and B is in Leiden Cod. Or. 8448. In Javanese in Arabic script ( pegon ). Original India Office number: IO 3102",
    "physical": "Dimensions: 220 x 170 mm. 39 ff.; European paper, watermarked 'LVG'. 13 lines per page; black ink; various hands. Decoration: double frames with gilt borders on ff. 1v-2r; floral verse markers in red ink on ff. 2v-18v, up to f. 12r these are gilded. Triple black ink ruled page frames on ff. 24v-38v. Binding: half brown leather binding with brown buckram boards. The folios are mounted on guards."
  },
  "MSS Jav 84": {
    "title": "Primbon",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_84",
    "scope": "A primbon collection of short religious texts concerning salat , donga , etc. The fragment mentioned in Weatherbee [1973], p. 33, has the numerals 1175 but this does not appear to be a date. In Javanese in Arabic script ( pegon ) and in Arabic.",
    "physical": "Dimensions: 200 x 155 mm. 59 ff.; Javanese paper ( dluwang ). Many ff. soiled and damaged at beginning and end. In various hands; black ink. The bound volume consists of 57 ff., and the volume contains two loose pieces of paper numbered ff. 58 and 59. No binding; integral covers of thicker dluwang comprising ff. 1 and 57. Housed in a brown buckram box."
  },
  "MSS Jav 85": {
    "title": "Layang sĕmbayang lan tĕtamba",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_85",
    "scope": "Called in a note at the beginning Layang sĕmbayang lan tĕtamba . Contains several short texts. In the digitised version, the 26 blank folios after f. 30, and the 16 blank folios after f. 31, are not shown. In Javanese in Arabic script ( pegon ) and in Arabic.",
    "physical": "Dimensions: 125 x 80 mm. 39 ff.; Javanese paper ( dluwang ). Many blank folios (after ff. 2, 26, 30, 31). In various hands; black ink. Binding: brown full leather bindings with stamped frames and triangular ornaments. Front board loose. Fore-edge flap present but envelope flap missing. Housed in a brown buckram box."
  },
  "MSS Jav 86": {
    "title": "Sĕrat Kanda",
    "language": "",
    "link": "",
    "scope": "Sĕrat Kanda. Begins with Prabu Basudewa of Mandura; incomplete at the end. on the inside yasanipun Kangjĕng Raden Adipati Sasra Adiningrat [Sasradiningrat II, patih of Surakarta 1812-46], with the date 19 Bĕsar A.J. 1740 [13 Dec. A.D. 1813]. The text itself begins on p. 18 and is dated 29 Bĕsar sirnaning kang catur rĕsi ning jalmi [A.J. 1740/25 Dee. A.D. 1813]. In verse. On p. 3 there begins a fragment of what seems to be a copy of a letter to Hugh Hope, Civil Commissioner of East Java. It mentions Raden Adipati Sasra Adiningrat, Raden Panji Sura¬dilaga, Raden Tumĕnggung Yudanĕgara, and Kyahi Tumĕnggung Mangkuyuda. It is dated 19 Ruwah A.J. 1739 [28 July A.D. 1812]. In Javanese language and script.",
    "physical": "Dimensions: 410 x 280 mm. 249 ff.; Javanese paper ( dluwang ). In various hands; black ink; 21 lines per page. Binding: original brown full leather bindings with six stanped frame bands, corner pieces and a central medallion. New spine. Fly leaves of English paper, 'J Whatman'. The volume has a newly-renovated leather spine, but the original leather spine, with stamped bands and circular and bud-shaped motifs, is preserved in the manuscript. Housed in a brown buckram box."
  },
  "MSS Jav 87": {
    "title": "Religious texts",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_87",
    "scope": "Religious texts. At the beginning called Wiridnya Kangjĕng Pangeran Pakuningrat of Yogyakarta. Several texts on religious subjects, ngelmu , etc., with some mystical diagrams. In Javanese in Arabic script ( pegon ) and in Arabic.",
    "physical": "Dimensions: 170 x 130 mm. 70 ff.; Dutch paper, watermarked 'VOC'. In various hands; black ink. One loose sheet enclosed at end. Binding: original covers of paper laminated with red outer cover; very damaged and fragmentary."
  },
  "MSS Jav 88": {
    "title": "Fragment in Javanese",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_88",
    "scope": "Rough fragment of a Javanese text, on f. 2r. is mentioned Ki Rangga Lawe. Note in pencil in English on f. 4r: This Book belonging to J.M. Marlin[?]. This MS has been detached from IO 2484 (Persian series), in which it was ff. 123-30. In Javanese language and script.",
    "physical": "Dimensions: 120 x 90 mm. 8 folios; European paper, chainlines, no watermark visible. 7-10 lines per page, black ink and pencil. Decoration: crude drawings in black ink on f. 4r. Binding: no covers; currently housed in a brown buckram box."
  },
  "MSS Jav 89": {
    "title": "Serat Damar Wulan",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_89",
    "scope": "MS begins with the accession of the daughter of Brawijaya (Kusuma Kancana Wungu) to the throne of Majapahit. Javanese language and script. Dated Jumahat-Manis, 9 Rabingulawal, no year given.",
    "physical": "Dimensions: 255 x 200 mm. 14 lines per page, black ink with gold highlights; different hand from f.204. Dutch paper, watermarks 'JH &amp;Z' (f.161), 'J. Honig' (f.177); pages stained and well-thumbed, indicating heavy use. Profusely illustrated with lively and vigorous illustrations in colours and gold. Binding: Modern full leather binding (one original dark brown leather board, with stamped ornamental frames and medallions, is stored alongside the MS in the box)."
  },
  "MSS Jav 9": {
    "title": "Fragments of Carita satus and Sĕrat Bratayuda",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_9",
    "scope": "ff. 1r-3r: Various notes. On f. 2v (RV p.2) is a fragment of a letter mentioning Raden Tumĕnggung Purwadipura and Pangeran Arya Panular, dated 10 Muharram A.J. 1737 [15 Feb. A.D. 1810]. A fragment on f. 3r (RV p. 3) mentions a nuwala of Sultan Hamĕngkubuwana of Yogyakarta. A: ff. 3v-15v (RV pp. 4-28). Fragment of a carita satus in Arabic script ( pegon ). B: ff. 16r-34r (RV pp. 30-65), bound upside down. Fragment of a Sĕrat Bratayuda , dated in Yogyakarta, 3 Jumadilawal naga tĕlu nunggang bumi [A.J. 1738/26 May A.D. 1811]. In verse; 11 cantos. ff. 35v-36r. Notes on the title and calligraphic exercises. Between ff. 34 and 35 there are 135 blank folios, and after f. 36 a further four blank folios, which have not been digitised. In Javanese language, and Javanese and Arabic script. This volume is foliated Arabic style, from right to left. References to the page numbering used in Ricklefs &amp; Voorhoeve (1977: 59) are indicated with 'RV'.",
    "physical": "Dimensions: 280 x 200 mm. Javanese paper ( dluwang ). 36 numbered folios; with 135 blank folios between ff. 34 and 35, and four Binding: rebound in the British Library in 1993 using the original brown leather Javanese covers, with stamped frames and ornaments, and with endpapers of dluwang . Dark brown leather spine, and head and tail bands of green and white threads."
  },
  "MSS Jav 90": {
    "title": "Kuntara",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_90",
    "scope": "Kuntara , law book. According to the cover the MS is from Rembang. In Javanese language and script. In verse; 5 cantos.",
    "physical": "Dimensions: 200 x 145 mm. 27 folios; thin Chinese paper with brush marks, some worm holes. 15 lines per page, black ink . Binding: unbound, loose quires; currently housed in a brown buckram box."
  },
  "MSS Jav 91": {
    "title": "Javanese tales of legendary history",
    "language": "",
    "link": "",
    "scope": "Tales of legendary history. Said at the beginning to describe the jĕnĕng ing para nata . Ends with warfare between the Javanese and the Dutch, French, and English. In Javanese language and script. In verse; 9 cantos.",
    "physical": "Dimensions: 205 x 155 mm. 9 folios; thin Chinese paper, with wrappers of Javanese paper ( dluwang ). 15 lines per page, black ink . Binding: unbound, loose quires; currently housed in a brown buckram box."
  },
  "MSS Jav 92": {
    "title": "Wilangan wulan, kang bĕcik kang ala",
    "language": "",
    "link": "http://www.bl.uk/manuscripts/FullDisplay.aspx?ref=MSS_Jav_92",
    "scope": "A: ff. 1-29. Wilangan wulan, kang bĕcik kang ala . Astrological calculations and several miscellaneous items, e.g.: f. 21r., punika pemut patĕdandalĕm yatra ingkang dateng Kangjĕng Ratu Bĕndara [probably Ratu Bĕndara, the eldest daughter of Sultan Hamĕngkubuwana I of Yogyakarta]. f. 22v., yen karsa mumule datĕng Sunan Ampel . . . ï. 24v., punika pemut patĕdanipun Kangjĕng Pangeran Arya Dipanĕgara ing dalĕm satĕngah taun . . . [probably the Pangeran Dipanĕgara who was the husband of the Ratu Bĕndara mentioned above between 1765 (after her divorce from Mangkunĕgara I) and his death in 1787]. B: ff. 29v.-39. Sĕrat Pralambang . The writer ( ingkang nyĕrat ) is named on f. 30v. as Sastratruna. Dated lawang sonya ngarga tunggal [AJ. 1709/A.D. 1782]. Incomplete at the end. A note inside the cover says, ‘Djocjakarta. From Dr. Studzee [?], July 6 1812.' In Javanese language and script.",
    "physical": "Dimensions: 145 x 100 mm. 40 folios; Javanee paper ( dluwang ). 9-12 lines of various scripts per page; black ink. Decoration: astrological diagrams on ff. 2v, 3r, 4r, 17v (in red and black). The front cover of European card has 6 small red wax impressions of European seals. Housed in a grey cardboard flap case."
  },
  "MSS Jav 93": {
    "title": "Jugul Muda",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_93",
    "scope": "A: ff. 1-9v. Jugul Muda . In prose. B: ff. 10r.-12r. Kuntara , from Tĕlaga Ĕning. In prose. In Javanese language and script.",
    "physical": "Dimensions: 200 x 145 mm. 12 folios; thin Chinese paper, wormholed. 15 lines per page, black ink . Binding: unbound, loose quires; currently housed in a brown buckram box."
  },
  "MSS Jav 94": {
    "title": "Dictionary of Javanese",
    "language": "",
    "link": "",
    "scope": "Dictionary: Javanese ngoko -Javanese krama -Malay-English. The Malay and English entries end on f. 4v. The Javanese entries are in Javanese script, the Malay is romanized.",
    "physical": "Dimensions: 265 x 200 mm. 101 folios; Javanese paper (dluwang), of poor quality, with pages of very uneven sizes and edges. The dictionary entries are placed in ruled columns, written in black ink. A few entries have been obscured by clean paper being stuck over the entry (see eg. f. 80r). Binding: unbound volume, comprising quires sewn together, the first quire is detached; currently housed in a brown buckram box."
  },
  "MSS Jav 95": {
    "title": "Copy of the Hantang Old Javanese inscription",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_95",
    "scope": "'Copy of an inscription on stone in the kawi character and language with a translation in Modern Javan - in the eastern part of the island.' This is a copy of the Hantang inscription (D 9 in the National Museum in Jakarta), dated saka 1057 = A.D. 1135 (Brandes 1913: 154-158 (OJO LXVIII)), NB Ricklefs &amp; Voorhoeve 1977: 178 erroneously give the date as saka 1056=A.D. 1134. The text of the inscription is given in three lines: firstly, in bold black ink is a visual reproduction of the original Old Javanese language in the original Kawi script; second, in red ink, is a copy of the Old Javanese text with the Kawi transliterated into modern Javanese script; thirdly, in cursive black ink, is a free translation of the Old Javanese text in modern Javanese. The copy includes a (not very accurate) drawing of the Narasiṅha emblem of Jayabhaya at the top of the inscription.",
    "physical": "Dimensions: 1240 x 350 mm. 2 folios; English paper, watermarked 'Stroud &amp; Co 1806'. The inscription is copied onto a single sheet of paper made up of six pieces of paper stuck together, and the sides have evidently been cut to emulate the shape of the original stone inscription. This sheet of paper was then folded many times, and enclosed in a an outer wrapper of a single sheet of paper, which was sealed with red wax."
  },
  "MSS Jav 96": {
    "title": "Copies of an Old Javanese inscriptions",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_96",
    "scope": "‘Transcript of an ancient Manuscript found in Cheribon [Cirĕbon]—and three [sic] others, whence &amp; subject unknown.’ This appears to be a copy of the same MS as Add. 12340. See the discussion of the MS there. A: ‘Facsimile of the Cheribon MS.’ Pencil copy in antique Javanese script. Single sheet of English paper: ‘GR’, 395 × 100 mm, folded into 8 ff. With figures and diagrams. Somewhat soiled. B: Another pencil transcription similar to A, hut without figures or diagrams. Single sheet of European paper, 380 x 100 mm, folded into 2 ff. Somewhat soiled. C: Same as A and B, without figures or diagrams. Single sheet of English paper: ‘GR’, 375 ×100 mm, folded into 7 ff.. Somewhat soiled. D: Pencil transcription in antique Javanese script, with extensive illustrations and calendrical tables (?). Single sheet of Dutch paper ‘C &amp; I Honig’, 375 × 90 mm, folded into 6 ff. Rather soiled. E: Pencil transcription in antique Javanese script with the same diagrams as in A. Single sheet of English paper: ‘S &amp; C Wise 1810’, 395 x 100 cm, folded into 9 ff. Rather soiled. Cohen Stuart, 1862, p. 159, and Niemann, 1870, p. 136, appear to have been wrong in suggesting that this is the same as the ‘Falak Budha' MS (see RAS Javanese Raffles Java 1). In Old Javanese language and script.",
    "physical": "5 sheets of paper, each folded a number of times."
  },
  "MSS Jav 97": {
    "title": "Caraka Basa",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_97",
    "scope": "Caraka Basa. Also called in the text papakĕm digbya basa . ‘Vocabulary, Kawi and Javanese.' Its presentation (probably by Kyahi Adipati Sura Adimanggala) to Raffles is recorded. Dated ngarasa want naga sura for the Kumpĕni Inggris year A.D. 1816. Approximately 2,500 entries. Pp. ruled in double columns. In Javanese language and script.",
    "physical": "Dimensions: 390 x 240 mm. 120 ff; European paper. Boxed."
  },
  "MSS Jav 98": {
    "title": "Fragments in Javanese, Malay and Arabic",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_98",
    "scope": "Fragments in Javanese, Malay and Arabic. A: ff. 1r-2r. Romanized Malay fragment on Javanese history, 1677-1755. 2 ff. B: Malay fragment on the medicinal use of river water. 1 large sheet of paper originally folded into four to give four folios, three of which have writing on them. 4 ff. C: ‘Translation of two inscriptions at Magelan &amp; Chandin [Magĕlang and Canḍi] into Modern Javanese—by the Crown Prince's Secretary.’ Javanese. 4 ff. D: Fragment in Javanese, identified by Weatherbee, forthcoming, as from a Sĕrat Gonda Kusuma . Dated A.J. 1742 [A.D. 1815]. 7 ff. E: Javanese list of words used in sĕngkalas . Dated in Surabaya, 1814. 4 ff. F: Javanese. Pratelanipun abdi-dalĕm Bupati ing Surakarta sĕdaya , with sizes of appanages. Also lists of the holdings and subjects of individual dignitaries. 24 ff. G: Javanese. List of the family of Kramawijaya of Surabaya. 1 f. H: Javanese. Carriagepost agreement ( kapal pos ) between the British government of Java and the Bupatis of Tĕgal, Barĕbĕs, and Pama¬lang, A.D. 1814. 2 ff. I: Javanese. Carriagepost agreement ( kapal pos ) between the British government of Java and the Bupatis of Pĕkalongan and Batang, A.D. 1814. 2 ff. J: Javanese. Carriagepost agreement ( pos kareta ) between the British government of Java and Sultan Sĕpuh and Sultan Anem of Cirĕbon, A.D. 1814. 1 f. K: Javanese. Carriagepost agreement ( kapal pos ) between the British government of Java and the Bupati of Tuban. 3 ff. 2 copies. L: Malay proclamation on the victory of the British forces. 1 f. M: Arabic with interlinear Malay translation. Document announcing the arrival in Muscat of a party from Penang in the ship of Sayid Husain Aidid. 1 f. N: Fragments in Arabic, in various hands, some calligraphic. 8 ff. O: Malay, fragment of a terasul , with sample portions of letters from the Sultan Ratu of Palembang to the Governor-General and Raad van Indie in Batavia. 2 ff. P: Folder, labelled ‘Javan Antiquities &amp; History'. 2 ff. [Parts L-O not listed in RV 1977: 72.] In Javanese language and script, with notes in English and Dutch.",
    "physical": "Dimensions: 330 x 220 mm. 68 ff; various European papers. Boxed."
  },
  "MSS Jav 99": {
    "title": "Surya Alam",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=mss_jav_99",
    "scope": "Surya Alam , from Rembang. Similar in format and in the same hand as MSS Jav 90 and 93. In Javanese script. In verse.",
    "physical": "Dimensions: 200 x 145 mm. 11 folios; thin Chinese paper, with chainlines. Black ink. Binding: Unbound; two quires sewn together. Stored in a buckram folder."
  },
  "Or 13329": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181063940.0x000001",
    "scope": "Carita Yusup. A: ff. 1-117. Carita Yusup . Beginning intact but leaves out\nof order and some missing. The ending seems to be missing. Badly soiled, some\nleaves illegible. In verse. 4 lines per page. B: ff. 118-37. Yusup story, again. Leaves out of order,\nseveral missing, several soiled and badly damaged; less dark than leaves of A. The beginning is to be found\non f. 125v. End missing. In verse. 2-4 lines per page. In Javanese language and script.",
    "physical": "Dimensions: 28 x 380 mm. 137 ff.; palm leaves. 3 holes; the middle hole is 150 mm from the left hole but 200 mm from the right hole. The first leaf of text is of double thickness, and consists of two leaves stitched together with white thread through the three holes. It is decorated with an ornamental frame, enclosing two lines of text. Some of the leaves are damaged, with some old stitched repairs. Covers: two wooden boards, with five flat beveled sides, with three holes, at the centre and at each end. This MS is unstrung."
  },
  "Or 13523": {
    "title": "Works in Javanese by Kyai Haji Ahmad Rifa‘i of Kalisalak",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13523",
    "scope": "Works by Kyai Haji Ahmad Rifa‘i of Kalisalak (1786-1876). Ahmad Rifa‘i established his pĕsantren at Kalisalak after spending 1833-41 in Mecca, and was exiled by the Dutch colonial regime to Ambon in 1859, where he died. A: ff. 1r.-48r. Nazham tazkiyyah , by Haji Ahmad al-Rifa‘i ibn Muhammad Marhum, on legal rules for slaughtering animals. Malay note on f. 1r: ‘No.3. Namanja kitab Tazekiah poenjanja Amad Roesdan desa Boeloes. Menerangkan – Potong binatang. Panghoeloe landraad Poerworedjo Hadji Bahri.’ f.2r: Text proper ff. 4v-42r, on the latter folio dated AH 1269 [CE 1852-3]. V. B: f. 42v. Two Arabic prayers: doa sĕlamĕt and doa kubur . C: ff. 43r.-48r. fragments of a nazam on rukun Islam and rukun iman , probably part of one of Ahmad Rifa‘i's works. D: ff. 49r.-244v. Identified on f. 50r. as Kitāb asnā al-maqāsid , by Haji Ahmad Arifa‘i ibn Muhammad. A work on ushul, fiqh and tasawwuf, according to Abdul Djamil 2001, p. 32, originally written in AH 1260 (CE 1844). On f. 244v. a colophon dating this MS AH 1261 [CE 1845]. On f. 49r., ‘No.1. T oeroenan tjoeplikan dari kitab Asnalmakasid karangan goeroe ilmoe Kalisalak bijlagen: II.’ On f. 96r. a marginal note in Malay in the same hand, pĕrmulaan dari sini sampai kĕpada angka 95 tĕrsĕbut dosa orang yang mĕngikut hawa nafsunya dan mĕngambil ilmu kĕpada ulama yang fasik, wajib alim adil mĕnyĕgah maksiat sĕbagaimana kuasanya. Jika ia tidak mĕnyĕgah, tĕntulah ia mĕnurut maksiatnya si awam. Pencil note on front cover probably by a bookseller: ‘Ahmad Ripangi. Manuscript written by Teungkoe Mochamat Noerdin, and containing the Nazm tadkija , a few smaller works, and a toeroenan tjoeplikan .’ In Javanese language in Arabic ( pegon ) script.",
    "physical": "Dimensions: 215 x 165 mm. 244 ff., German paper: ‘FELIX HEINR. SCHOELLER DUREN / NORMAL 22’. Black ink with rubrication in red ink, 17 lines per page in two columns, many marginal notes. Binding: Modern dark green British Library half leather and buckram binding."
  },
  "Or 13572": {
    "title": "A collection of legal texts in Javanese",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13572",
    "scope": "A collection of legal texts. On the title page identified as Nawala Pradata-dalĕm , referring to the first text in the volume. A: ff. 1r.-3r. A printed text beginning, Pengĕt, nawalaningsun Kangjĕng Susuhunan Pakubuwana … ingsun gadhuhakĕn marang kawulaningsun si Angabehi Amongpraja . A legal text, mentioning at the end the Patih Adipati Sasradiningrat. (There were several Patihs of Surakarta with this name from 1770 into the 19th century; a Javanese typeface was not available until the middle years of the 19th century). The remaining texts in the volume are manuscripts. B: ff. 4r.-47r. A legal text, the beginning missing. At the end dated in Surakarta, 18 Bĕsar, Dal 1759 [19 May 1832]. C: ff. 47r.-242r. Identified at the beginning as Anggĕr Sadasa. Dated at the end in Surakarta, 3 Bĕsar, Wawu 1745 [4 Oct. 1818]. D: ff. 243r.-356v. Anggĕr Undhang . Ordered by Susuhunan Pakubuwana VII (1830-58). On f. 365r., said to have been (originally) written in Sĕmarang (Sĕmawis) on 11 Sura, Alip 1699 [4 April 1773], then renegotiated and dated at the end (f. 356 v.) in Yogyakarta on 5 Bĕsar, Ehe 1708 [11 Nov. 1782]. In Javanese and Arabic language, in Javanese script.",
    "physical": "Dimensions: 200 x 165 mm. 356 ff., Dutch paper:‘CONCORDIA’. The ff. have original Javanese numbering from 10 to 726. Black ink, 12 lines per page, ruled pencil guidelines. Binding: Modern dark green binding."
  },
  "Or 13576": {
    "title": "Sĕrat Anbiya.",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13576",
    "scope": "Sĕrat Anbiya. On the title page (f. 1r.) said to be owned by Tuwan Mestĕr Robĕnsen and to have been written by Ki Mas Dhaeng Nur ‘Ali [b.?] Muhammad Dhaim, who was a pranakan Mĕngkasar in Batavia in Jimawal AH 1229 / CE 1814. At the beginning (f. 1v.) described as carita satus … saking para Anbiyah, tĕgĕsipun carita para Nabi. The work is incomplete at the end. The owner was probably the English Baptist missionary and school master W. Robinson, who was in Batavia from May 1813; he had a command of Malay and wrote both SOAS Malay MS 175094 and a work on Malay orthography published in 1824 (see de Haan 1935, pp. 629-70). In Javanese language and script. In verse.",
    "physical": "Dimensions: 320 x 200 mm. 93 ff., English paper, watermarked ‘GR 12’. Brown-black ink, 20 lines per page; coloured text markers in red, yellow and green. Heavy water stain at beginning. Binding: Full brown leather binding."
  },
  "Or 13826": {
    "title": "M ĕ kuta Raja",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13826",
    "scope": "Mĕkuta Raja , a Javanese version of the Malay work Mahkota sĕgala Raja-raja or Taj al-salatin , a book of instruction for princes. Incomplete at end. Written in Yogyakarta in Je, catur ing rat kang winangun nĕnggih jayeng buwana [probably Je A.J. 1814 / A.D. 1885]. At the beginning the anonymous author describes himself as Jĕng Pangran wakil Narendra Ngayogyakarta . In Javanese language and script.",
    "physical": "Dimensions: 300 x 190 mm. 142 ff., European paper. The ff. have original Javanese numbering on the verso from 1 to 148, and a note at the end of the volume states from ff. 110-111 and 119-122 are missing. Black ink with red rubrication and some decorated canto headings, 21 lines per page, set in double-ruled black ink frames. Binding: Modern dark green half leather and buckram British Library binding."
  },
  "Or 13827": {
    "title": "Babad",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13827",
    "scope": "Babad , extending from Majapahit to the reign of Panĕmbahan Senapati of Mataram. On the title page is written the name of one Martasuwarna of the Bran[g]takusuman [Yogyakarta]. Dated panca warna mangesti Sri Narapati [A.J. 1845/A.D. 1941]. Stamp of a former owner 'M. Martadjoemeno' on f. 1r, and on back flyleaf, and initials 'M.T.J.N.H.' on f. 1r. In Javanese language and script.",
    "physical": "Dimensions: 330 x 190 mm. 328 ff., original Javanese numbering from 3 to 638, but jumps from 64 to 67, while 526 and 527 are repeated. European paper; some folios in poor condition, now repaired. Black ink, 20 lines per page. Binding: Modern dark green half leather and buckram British Library binding."
  },
  "Or 13828": {
    "title": "Babad",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13828",
    "scope": "Babad , concerning the history of Yogyakarta from the treaty of Giyanti [1755] to the appointment of Sultan Hamĕngkubuwana III [1810-11, 1812-14]. Part of a larger work, as is indicated by the label S ĕ rat Babad G ĕ ng jilidan nom ĕ r 5 . Owned by Bendara Raden Ria Danuatmaja; stamped with the oval red ink seal of Raden Rida Danuatmaja 'Regent Kalipapang' (the bupati of Kalibawang, Kulon Praga), bearing the date A.J. 1813 [A.D. 1883]; Danuatmaja was probably from the Danurĕjan line of Yogyakarta. The seal is found on ff. 12r, 229v, 400v and 503v. In Javanese language and script.",
    "physical": "Dimensions: 340 x 200 mm. 470 ff., Dutch paper, watermarked 'Pro Patria'. Black ink, 21 lines per page; most pages with double-ruled black ink text frames. Frequent marginal inscribed section indicators, in the form of architectural constructs with decorative roofs. Some black ink decorated canto headings.As many of the folios were waterdamaged, the MS has been extensively repaired and most pages laminated, and the quires are now mounted on guards and the manuscript bound in two separate volumes (v. 1 ff. 1-253; v. 2 ff. 254-506).Binding: currently with modern dark green half leather and buckram British Library binding, each volume housed in a green buckram box. The original Javanese full brown leather binding, with 3 frame bands, corner pieces and mediallions, is stored in the same box as v. 1."
  },
  "Or 13841": {
    "title": "Menak story",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13841",
    "scope": "Menak story. The name Kalana Jayadimurti or Jayengmurti occurs throughout. In Javanese language and script.",
    "physical": "Dimensions: 215 x 175 mm. 42 ff., brownish wove paper. The pages have original Javanese numbering. Black ink, 10 lines per page. Binding: Modern dark green half leather and buckram British Library binding."
  },
  "Or 13842": {
    "title": "Sĕrat Langĕndriyan",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_13842",
    "scope": "Sĕrat Langĕndriyan. Based on the Damar Wulan stories. In Javanese language and script. In verse.",
    "physical": "Dimensions: 210 x 170 mm. 39 ff., brownish laid paper with chainlines. Purple ink, 6 lines per page. Binding: Modern dark green half leather and buckram British Library binding."
  },
  "Or 13843": {
    "title": "Sĕrat Cekel Endra-Laya",
    "language": "",
    "link": "",
    "scope": "Sĕrat Cekel Endra-Laya. Ontarĕja, Burisrawa and Bathara Durga are mentioned at the beginning. The text may be incomplete at the end. In Javanese language and script. In verse.",
    "physical": "Dimensions: 210 x 170 mm. 31 ff., brownish laid paper with chainlines. Brown ink, 9 lines per page. Binding: Modern dark green half leather and buckram British Library binding."
  },
  "Or 14606": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348115.0x000001",
    "scope": "Carita Yusup. The story of the prophet Yusuf (Joseph), in macapat verse form. In Javanese language and script. This manuscript identified by Ben Arps.",
    "physical": "Dimensions: 35 x 420 mm. 123 ff.; palm leaves. 3 holes; 4 lines per page; in partially unblackened script. Ff. 2 and 123 are of double thickness and stitched together in the centre and at each end with red thread; f. 18 is also of double thickenss and is stitched together with white thread. Some damaged leaves have been repaired with new leaf in the BL Conservation studio, eg. ff. 38, 39. Covers: two wooden boards, rounded on the outside, with three holes; original string through end hole of back cover. This MS is currently strung with modern string, with plexiglass supports at each end."
  },
  "Or 14607": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348192.0x000001",
    "scope": "Carita Yusup. The story of the prophet Yusuf (Joseph). Incomplete at beginning; leaves are not in order and the MS may contain two texts as there are at least two different hands. Beginning of Carita Yusup found in middle; preceding leaf (f. 67) is empty save for date: 23 Sebteber [September] 1895. In Javanese language and script. In verse. This manuscript identified by Ben Arps.",
    "physical": "Dimensions: 40 x 340 mm. 123 ff.; palm leaves. 3 holes; 4 lines per page. Some damaged leaves have been repaired with new leaf in the BL Conservation studio. Covers: two wooden boards, bevelled and ridged on the outside, with three holes. This MS is currently strung with modern string."
  },
  "Or 14608": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348284.0x000001",
    "scope": "Carita Yusup. The story of the prophet Yusuf (Joseph). In Javanese language and script. In verse. This manuscript identified by Ben Arps.",
    "physical": "Dimensions: 35 x 360 mm. 129 ff.; palm leaves. 3 holes; 4 lines per page; no punctuation between verse lines. Ff. 1 is a double folio stitched together through each of the three holes with black thread; f. 101 has a ‘bookmark’ of a small leaf strip tied through one of the end holes. Some damaged leaves have been repaired with new leaf in the BL Conservation studio. Covers: two wooden boards, bevelled and ridged on the outside, with three holes; currently strung with original string, to which is affixed at one end a wooden pointer (as an aid to reading)."
  },
  "Or 14609": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348368.0x000001",
    "scope": "Carita Yusup. The story of the prophet Yusuf (Joseph), in macapat verse form. In Javanese language and script. This manuscript identified by Ben Arps.",
    "physical": "Dimensions: 35 x 330 mm. 116 ff.; palm leaves. 3 holes; 4 lines per page; in partially unblackened script. F.1 is a double folio stitched together with (originally white?) thread through the three holes; f. 94 has a ‘bookmark’ of a small palmleaf strip tied through one of the end holes. Some damaged leaves have been repaired with new leaf in the BL Conservation studio. Covers: two wooden boards, bevelled and ridged on the outside, with three holes."
  },
  "Or 15026": {
    "title": "Panji romance",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_15026",
    "scope": "Panji romance, with 39 coloured drawings (including four across two pages) with Javanese wayang -style figures on naturalistic backgrounds. The MS is dated at the beginning but with confused dates combining AJ and CE dates. The AJ date should evidently be Jimawal 1789, which coincided with the CE date given as 7 May 1861. The MS says that it was owned by one Bah Si Cong who lived in Kampung Cina (but of what town is not said). In Javanese language and script.",
    "physical": "Dimensions: 330 x 200 mm. 235 ff., with original foliation on the versos in Arabic numerals. Dutch paper, watermarked 'V d L', some pages heavily waterstained. Brown ink, with rubrication in red, green and yellow; 17 lines per page. Double decorated frames in blue and yellow on ff. 1v-2r. 39 coloured drawings in red, blue, yellow, green and black, with captions. The BL holds a lengthy description of the MS prepared in 1994 by P.B.R. Carey, identifying the illustrations.Binding: original mottled brown leather binding, with orange and purple printed endpapers."
  },
  "Or 15933": {
    "title": "Calligraphy exercises in Javanese",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_15933",
    "scope": "Calligraphy exercises in Javanese, illustrating combinations of aksara lĕgĕna with pasangan and sandhangan . In Javanese language and script.",
    "physical": "Dimensions: 490 x 300 mm. 25 ff., English paper, watermarked: ‘J Whatman 1810’, ‘V E I C’, 'S &amp; C Wise 1813'. Black ink, on ruled pencilled lines.Binding: no covers; stitched in quires with brown leather hinges."
  },
  "Or 16678": {
    "title": "Islamic texts in Arabic with interlinear Javanese translations",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_16678",
    "scope": "Islamic religious texts in Arabic with interlinear Javanese translations and marginal notations. A: f. 1r. incomplete verses of Sūrat al-Baqarah : 163 and 255 ( ayat Kursi ), commonly read during dhikr and for other purposes, including tahlil . B and C: ff. 1v.-17r. Umm al-barāhin by Abū ‘Abd Allāh Muḥammad b. al-Walī al-Ṣāliḥ Yūsuf al-Sanūsī al-Mālikī al-Maghribī al-Tilimsānī (1437- 90) and Abū Laith al-Samarqandī’s Masā’il on theology of ahl al-sunnah wa-al-jamā‘ah . These two works seem to be misbound together. On ff. 1v. et seqq. we find Umm al-barāhin , also called al-‘Aqīdah al-sanūsīyah , one of the principal works of Islamic theology by Abū ‘Abd Allāh Muḥammad b. al-Walī al-Ṣāliḥ Yūsuf al-Sanūsī al-Mālikī al-Maghribī al-Tilimsānī. On ff. 16v.-17r. we find the end of Abū Laith al-Samarqandī’s Masā’il on theology of ahl al-sunnah wa-al-jamā‘ah, which is written in the form of questions and answers. This work is well known as Kitāb Samarqandī as mentioned in the colophon tammat hādhā al-kitāb Samarqandī (f.17r), or called Asmarakandhi. The author is Naṣr ibn Muḥammad ibn Aḥmad ibn Ibrāhīm al-Samarqandī (d. 375 AH/985 CE), well known as Imām al-Hudā, who wrote his monumental tafsīr entitled Baḥr al-‘ulūm . Ff. 4v.-5r. and ff. 7v.-8r. are part of Umm al-barāhin ; on ff.10v.-11r. is found part of Samarqandī; ff.11v.-12r. are again part of Umm al-barāhin . D: ff. 17v-28r: Kitāb al-sittīn mas’alah , a fiqh treatise written by Abū al-‘Abbās Aḥmad al-Zāhid (d. 819 AH/1416 CE), which deals with the basic Islamic teachings according to the Shāfi‘ī madhhab . The colophon on f.28r says: tammat hādhā al-kitāb al-Sittīn, wallāhu a‘lam . Marginal notes in Javanese mostly give a more detail explanation of the subject discussed in the main text. The note on the top of f. 17v contains an explanation of the significance of reciting basmalah before doing anything. It quotes a hadith which is frequently cited by kyais in pĕsantrens, which says, kullu amrin dhī bālin lā yubtada’u fīhi bismillāh al-raḥmān al-raḥīm fa-huwa aqta‘ (all good things, if started without reciting bismillāh al-raḥmān al-raḥīm , will have their blessings broken [Javanese pĕgat bĕrkate ]). E: ff. 28v.-30r. An Arabic treatise with extensive explanation of the significance and meanings of the two sentences of shahādah . The colophon says (f.30r), tammat hādhā al-kitāb bi-al-kalimāt . F: f. 30v. The text says: qāla al-nabī ṣ m, ingandika Nabi, bismillāh al-raḥmān al-raḥīm, bismillāh al-raḥmān al-raḥīm . [Contents identified by Oman Fathurahman.] In Javanese and Arabic language, in Arabic (pegon) script.",
    "physical": "Dimensions: 270 x 200 mm. 30 ff., Javanese treebark paper ( dluwang ). Black ink; 7 lines of Arabic per page; many marginal annotations in Javanese. Original page numbering in pencil in Arabic numerals, 40-83 (NB ff. 5v.-6r. not numbered).Binding: no covers."
  },
  "Or 16679": {
    "title": "Islamic texts in Arabic with interlinear Javanese translations",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_16679",
    "scope": "Islamic religious texts in Arabic with interlinear Javanese translations and marginal notations. A: ff. 1v.-2r. and f.51v. appear to belong together. The present a chart dealing with three types of hukm (law) in Javanese, namely (1) syarak lima , (2) [not seen here, but implicitly hukum akal ] and (3) adat papat : 1. f. 51v. a chart on the five principles of Islamic law ( syarak lima ), namely: wājib (obligatory), sunnah (recommended), ḥaram (forbidden), makrūḥ (not recommended but not forbidden/disliked), and mubāḥ (neutral). There is also another chart explaining the three categories (presumably of hukum akal ): wājib (necessary), mustaḥīl (impossible) and jā’iz (possible). 2. f. 1v. four principles of adat law ( adat papat ), concerning wujud (existence) and adam (nonexistence): wujud kalawan wujud, adam kalawan adam, adam kalawan wujud , and wujud kalawan adam . There is also another chart, with example of each, on hukum syara’ (sacred law), hukum akal (laws of intellect), and hukum adat (laws of nature). B: ff. 2v.-5r. a brief Arabic text with interlinear translation in Javanese explicating the phrase lā ilāha illallāh Muḥammad rasulūllāh in relation to the concepts of nafy (negation) and ithbāt (affirmation). C: ff. 5v.-6r. fragments: 1.f. 5v. contains Arabic words which are among the attributes of Allah, including: qudrat, irādat, sama‘, baṣar, ‘ilm, and kalām . An explanation is found in Javanese. 2. f. 6r. contains Surat al-Fātiḥah , but with insertion of the words sakīnah and waqf between certain words, followed by an Arabic text with interlinear translation in Javanese which is claimed to be the Prophet’s words encouraging respect for a teacher ( ustaz ), lest troubles arise. D: ff. 6v.-51r. al-Mukhtaṣar al-ṣaghīr fi-mā lā budda li kulli muslim min ma‘rifatihi fī al-‘ibādāt authored by ‘Abd Allāh ibn ‘Abd al-Raḥmān Bā Faḍal al-Haḍramī (850-918 AH/1446-1512 CE), an Arabic treatise with interlinear translation in Javanese concerning worship rituals which should be known by every Muslim according to the Shāfi‘ī madhhab . [Contents identified by Oman Fathurahman.] In Javanese and Arabic language, in Arabic (pegon) script.",
    "physical": "Dimensions: 290 x 200 mm. 51 ff., Javanese treebark paper ( dluwang ). Black ink, with rubrication in red near the beginning; 7 lines of Arabic per page; many marginal annotations in Javanese. Binding: no covers."
  },
  "Or 16803": {
    "title": "Raden (Ardi) Kusuma romance",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348791.0x000001",
    "scope": "Raden (Ardi) Kusuma romance A MS perhaps from Madura. Complete. The first folio containing the basmalah enclosed within foliate scrolls. This MS identified by Edwin Wieringa (14 March 2011) who noted, ‘Scanning the leaves for key terms, I detected the words Mĕsir, Ngĕrum, and Kusuma, so perhaps we're dealing here with the Raden (Ardi) Kusuma romance.’ In Javanese language and script. In verse.",
    "physical": "Dimensions: 35 x 360 mm. 100 ff.; palm leaves. 3 holes; 4 lines of text per page. F.1 is double thickness and sewn together with black thread at the three holes. Decoration: f. 1 is decorated with a frame of foliate scroll motifs around one line of text. Some leaves damaged with parts broken off. Covers: two wooden boards, slightly bevelled and ridged on the outside, with three holes. This MS is currently unstrung."
  },
  "Or 16878": {
    "title": "Unidentified Arabic text with interlinear Javanese translation",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_16878",
    "scope": "Unidentified Arabic text with interlinear Javanese translation in pegon script. In the opening quotes Shamsuddin Abu Abdullah Muhammad ibn Kasim al-Shafi‘i. In Javanese and Arabic language, in Arabic (pegon) script.",
    "physical": "Dimensions: 330 x 205 mm. 157 ff., Brownish Dutch paper, watermarked: ‘V d L’, ‘EENDRAGT’. Black and red ink; 13 lines of Arabic text per page, set within single-ruled red ink text frames. Binding: Original brown cardboard binding with envelope flap."
  },
  "Or 16912": {
    "title": "Historical prose text",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348899.0x000001",
    "scope": "‘Historical’ prose text, from Bali. Comment by S. Supomo, 27 October 2013: “I can only say that the MS is probably a kind of Old Javanese ‘historical’ prose – like the Pararaton . This is apparent from some proper names which occur in the text, e.g.: [ha]yam Uruk, sryaji Wĕngker, patih Madhu, patih Tatag, Marga Lĕwih. While the names of Ayam Uruk and Wĕngker occur in various sources, as far as I know the last three names are known only in Kidung Sunda (see C.C. Berg, Kidung Sundayana, Surakarta, 1928, Canto 5.20 for Tatag and Marga Lĕwih). However, there are also names which do not occur in the Kidung Sunda , as well as in the Pararaton , e.g. Arya Damar of Palembang, and Jaran Pakolih of Madura; and Arya Damar, who ‘mukti’ in Palembang, most likely refers to Arya Damar of the Babad Tanah Jawi .” In Old Javanese language and Javanese script.",
    "physical": "Dimensions: 40 x 350 mm. 59 ff.; palm leaves. 3 holes; 4 lines of text per page; mostly written in two columns but with a few leaves written across the leaf. Some of the leaves are badly damaged while others have old stitched repairs; the MS appears to be incomplete and the leaves are currently out of order. Covers: two wooden boards, with one hole in the middle; fragments of an original string with a Chinese coin at the end. This MS is currently unstrung, and stored in a box mislabelled 'Balinese calendar'."
  },
  "Or 16913": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181348963.0x000001",
    "scope": "Carita Yusup. The story of the prophet Yusuf (Joseph). In Javanese language and script. In verse.",
    "physical": "Dimensions: 40 x 375 mm. 140 ff.; palm leaves. 3 holes; 4 lines of text per page. Ff. 1 and 140 are of double thickness stitched together with white thread through the 3 holes. Ff. 111-139 have two holes at each end and one in the middle. Bookmarks through the holes on f.93, 102. Decoration: f. 1 is decorated with a frame of diamond-shaped motifs around the 2 lines of text. Covers: two wooden boards, ridged on the outside with traces of red pigment, with three holes; original red and white string knotted at one end. (NB in Ricklefs, Voorhoeve and Gallop 2014: 288 the descriptions of the binding strings of Or 16913 and Or 16914 have been transposed)."
  },
  "Or 16914": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181349124.0x000001",
    "scope": "Carita Yusup. The story of the prophet Yusuf (Joseph). In Javanese language and script. In verse.",
    "physical": "Dimensions: 35 x 375 mm. 142 ff.; palm leaves. 3 holes; 4 lines of text per page. F. 1 is of double thickness stitched together with black thread through the 3 holes. Ff. 4, 74 have old repairs with two palm leaf spine splints sewn across a tear to keep the leaf together. Bookmarks through the holes on ff. 59, 73, 105, 118. Covers: two wooden boards, ridged on the outside with traces of red pigment, with three holes; original white string with a bone ornament at one end. (NB in Ricklefs, Voorhoeve and Gallop 2014: 288 the descriptions of the binding strings of Or 16913 and Or 16914 have been transposed)."
  },
  "Or 3583": {
    "title": "Pawukon",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181349259.0x000001",
    "scope": "Pawukon. Prose treatise on divination, in\nconnection with the Javanese wuku calendar of 30 x 7 days, and other\nchronological systems (weeks of 210 days). Medicines for children are also\nmentioned. The idiom is pre-Islamic Javanese; the style is succinct and\npragmatic, using many abbreviations for days, weeks, and wukus . The top and bottom lines of the leaves are\ndarkened and often illegible. The leaves have no original numbering (or it is\nillegible) and seem to be out of order. Dr. Pigeaud suggests the MS may be 17th\ncentury or a little earlier, and perhaps from the countryside of Central or\nEast Java. In Javanese language, in Buda or gunung script, regular and done with care.",
    "physical": "Dimensions: 35 x 395 mm. 77 ff.; palm leaves. 4 lines of text per page, in two columns. Some leaves were damaged and have been repaired and laminated. Covers: two wooden boards, with three holes, at the centre and at each end. This MS is currently unstrung, and the leaves may be out of order."
  },
  "Or 5306": {
    "title": "Añang Nirartha Kakawin",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181349441.0x000001",
    "scope": "Añang Nirartha Kakawin. Contains two texts: A: ff. 1v-19r. B: ff. 20r-40r. Said to be from Lombok. In Old Javanese.",
    "physical": "Dimensions: 30 x 330 mm. 41 ff.; palm leaves. 4 lines of text per page, in two columns; the edges are stained red. F.1 is double thickness, with two leaves clipped together with metal clips at the two ends and in the middle. Covers: two wooden boards, with a central hole and very small holes at each end. This MS is currently unstrung."
  },
  "Or 6622": {
    "title": "Primbon",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_6622",
    "scope": "On the basis of a brief examination. Dr. Th. G. Th. Pigeaud describes this as a primbon consisting of three or more parts, one part concerns medical lore and legal material; another contains Arabic in Javanese script. The MS seems to be of considerable antiquity. It is written on very thin and delicate Javanese paper, discoloured and wormeaten. An official document from Cirĕbon, dated 6 February 1849, in Malay in Latin script, was originally used as a cover. In Javanese and Arabic language, in Javanese script.",
    "physical": "Dimensions: 195 x 120 mm.27 ff.; Javanese paper ( dluwang ). Some folios (eg. ff. 9, 12, 13) were of double thickness and have now begun to separate. F. 12 has a string threaded through near the outer vertical edge (perhaps to function as a bookmark?).Black ink; 13-15 lines per page; a variety of different hands. \n Binding: no binding; the outer folios of stiffened dluwang acted as covers. An official document from Cirĕbon, in Malay in Roman script, dated 6 February 1849, written on a piece of Dutch paper (with Concordia watermark) was previously used as a cover."
  },
  "Or 9333": {
    "title": "Drawings of wayang figures",
    "language": "",
    "link": "https://www.bl.uk/manuscripts/Viewer.aspx?ref=or_9333",
    "scope": "43 coloured figures from the wayang shadow puppet theatre, identified\nby romanized notes. In several different hands. Contents: f. 1v: Anoman Dewi Andjani f. 2r: Patih Beradjamaestie, Peraboe Dasamaeka f. 2v: Ratoe Goening mandoera, Bagawang Sakalima f. 3r: Perboe Astinapatie, Magang Tjiterajoeda, Arija Pandjarijoemoet f. 3v: Dewie Sirkandie, Dewie Saebadera, Wiramadie f. 4r: Toemenggoeng Djaja djatera, Dewa Batalakilie f. 4v: Patih Setjakie, Perboe Batalakoesoema, Raden Poernoeganda f. 5r: Perboe darmakasoema, Arija Djaja Sena f. 5v: Pangeran Purba Tjanasaeta, Ratoe ramanaidjaja f. 6v: Patih Boma Reksa f. 7r: Praboe Mais Patie f. 7v: Raden Pantjawala f. 8r: Pangeran Pantja Soerwedie f. 8v: Anoman Soeraba f. 9r: Anoman Toergangga f. 9v: Praboe Brahma Widjaja f. 10r: Pangeran Dipati Karna f. 10v: Raden Djaja Eramba, Djimat Keris toenggal naga f. 11r: Raden Djaja Erawan, Djimat Gada Kajoe Kastoeba f. 11v: Raden Aradeja, Raden Arajana f. 12r: Patih Paksi Goentajoe f. 12v: Dewa Pandji Nerada, Dewa Batara Goeroe f. 13r: Pangeran Tandjoeng Anom, Ratoe Darma Koesoemah f. 13v: Raden Majat Miring, Raden Djaja Miring f. 14r: Pangeran Dipati Soeria Laga f. 14v: Pangeran Bagawan Sokolima f. 15r: Pangeran Mahesa Genie, Djimat Arda Dedalik f. 16r: Dewa Brahma, Djimat Moestika Djamoer f. 16v: Patih Praba Kesa In Javanese language and Latin script.",
    "physical": "Dimensions: 470 x 360 mm. 16 ff.; various European papers. Coloured pigments, gold and black ink. Binding: full dark brown buckram binding."
  },
  "Or 9809": {
    "title": "Carita Yusup",
    "language": "",
    "link": "http://access.bl.uk/item/viewer/ark:/81055/vdc_100181349539.0x000001",
    "scope": "Carita Yusup. In verse. In Javanese language and script.",
    "physical": "Dimensions: 25 x 405 mm. 123 ff.; palm leaves. 4 lines of text per page, in two columns. The MS has original Javanese foliation in the left margin on the verso of each leaf; modern British Museum foliation in pencil is the wrong way round, starting at the end of the manuscript and finishing at the beginning. The first leaf of text is of double thickness, and consists of two leaves stitched together with red thread through the three holes (numbered f. 122 in pencil). It is decorated with two lines of repeated characters at top and bottom, enclosing two lines of text. Covers: two wooden boards, with three flat beveled sides, with three holes, at the centre and at each end. This MS is strung through the middle with modern black chord, with a Chinese coin at the end, and two modern plexiglass supports within the wooden boards."
  }
}